{"contentAdvisoryRating": "4+", "features": ["iosUniversal"], "languageCodesISO2A": ["EN"], "ipadScreenshotUrls": ["http://a2.mzstatic.com/us/r30/Purple4/v4/48/8d/f3/488df351-2862-74a8-0554-61d94da01d2d/screen480x480.jpeg", "http://a4.mzstatic.com/us/r30/Purple3/v4/02/69/fa/0269fa8d-fcfa-0cdb-287c-eaf8ea33f792/screen480x480.jpeg", "http://a5.mzstatic.com/us/r30/Purple3/v4/61/53/c6/6153c6df-0cda-88e7-ec26-5bcbc0412073/screen480x480.jpeg", "http://a1.mzstatic.com/us/r30/Purple4/v4/2b/64/ac/2b64ac82-1365-7aa7-4b2c-ffdfec99e6f1/screen480x480.jpeg", "http://a5.mzstatic.com/us/r30/Purple5/v4/8c/8d/7a/8c8d7a37-198a-f648-d360-9785f5c4f210/screen480x480.jpeg"], "releaseDate": "2008-07-23T16:55:09Z", "currency": "USD", "artistId": 669613188, "userRatingCountForCurrentVersion": 78, "wrapperType": "software", "advisories": [], "genres": ["Sports", "News"], "trackId": 285692706, "description": "theScore is your home for the NFL, NCAA Football, MLB, NBA, NHL, EPL, La Liga and all major sports!\n\ntheScore is designed to deliver the ultimate mobile sports experience with comprehensive and completely customizable scores, stats, news, alerts & much more for the iPhone and iPad. \n\n-- \n• One of Apple's \"Amazing Apps for iPhone 5\". \n• Featured as an App Store Essential Sports App for iPhone & iPad. \n• Member of the App Store Essentials Hall of Fame. \n• One of Time Magazine's Must-Have iPad apps. \n-- \n\nReal time coverage includes: \n- Football (NFL, NCAA, CFL) \n- Baseball (MLB)\n- Basketball (NBA, NCAA - including March Madness) \n- Hockey (NHL, Men's / Women's Winter Olympic Hockey, IIHF WJHC - World Junior Hockey Championship) \n- Soccer (EPL / Premier League, Champions League, World Cup, Serie A, La Liga, Bundesliga, MLS FA Cup, Capital One Cup, Europa League, Ligue 1, Coppa Italia, DFB-Pokal, Copa Del Rey, and Liga MX) \n- Mixed Martial Arts (MMA: UFC and Bellator) \n- Auto Racing (NASCAR Sprint Cup, Formula 1) \n- Golf (PGA, LPGA, EPGA) \n- Tennis (ATP, WTA) \n- Lacrosse (NLL) \n\n• Push Alerts: Receive free Push Alerts including goals, ends of quarters and key moments in any game to keep you on top of the action; anytime-anywhere.\n\n• Breaking News Alerts for Every League, Team and Player: Be on top of the biggest news in your favorite sports. You can configure these on/off in the settings area. \n\n• Player Alerts: With theScore’s Player Alerts for NFL, NBA, NHL, MLB and footy, users are notified in real-time when a player they’re following makes a major scoring play or is involved in breaking news. For example, if you need to know when your quarterback throws a touchdown or one of your guys is not in the starting line-up, we’ll shoot you an alert and let you know. \n\n• My Score: Use the \"My Score\" section to customize the app. Follow any team, player or event. With Player grouping you can follow all of your fantasy teams (football, hockey, basketball and baseball) in one app in real-time.\n\n• Feed - In the \"Feed\" section you can create your own continuously updated stream of sports content, combining all the information on the leagues, teams and players you are following in one place. theScore’s deep player data coverage also makes Feed the perfect fantasy sports tracking tool, giving you live updates on how your favorite players are performing in real-time. Feed can be found in the \"My Score\" section.\n\n• Mobile sports news the way it’s meant to be: Rich, comprehensive, snackable content with even more visuals! theScore now delivers the most comprehensive, curated, mobile sports news available. Go into the News section of any league and get the latest stories, tweets, GIFs and videos personally delivered by theScore’s in-house content team. Follow a story from start to finish, with each bite-sized update stacked on top the last. \n\n• Top News and Hot Games: We’ll bring you the biggest sports stories in an instant with Top News. Top News gives you an at-a-glance view of the stories making headlines. Want to know what games to look out for? No problem. Hot Games gathers all of the most popular events in one place, showing you what’s trending in sports at that moment and what’s coming-up, so you won't miss a thing. \n\n--\n• Follow us on Twitter for the latest updates and to provide product feedback: twitter.com/theScoreHelp \n• For more information: mobile.theScore.com \n• Need support? We’re here to help: thescoreapp[at]thescore[dot]com \n-- \nWe are affiliated with theScore.com", "artistName": "theScore", "artworkUrl512": "http://a1336.phobos.apple.com/us/r30/Purple5/v4/59/eb/47/59eb47c0-a33d-0afc-7a69-d8893d23d07e/pr_source.jpg?downloadKey=1417124417_adc979068d7aa9324897dee973089700", "version": "4.4.1", "primaryGenreId": 6004, "primaryGenreName": "Sports", "fileSizeBytes": "44951375", "price": 0.0, "isGameCenterEnabled": false, "trackCensoredName": "theScore", "genreIds": ["6004", "6009"], "trackName": "theScore", "releaseNotes": "New in 4.4.1\n• Bug fixes and overall improvements\n• theScore's customizable ‘Feed’ feature, found within MyScore, offers a personalized view of all the news, stats and scores from the leagues, teams and players you’re following.\n- Feed Filters - Now you can create separate, customized Feeds for your fantasy rosters - or anything else - giving you an at-a-glance view of injury news, scoring updates and much more all in real-time! Just select the ‘+’ sign in the top right corner within ‘Feed’ to create a new filter\n\n• Optimized for iPhone 6 & 6+\n\n• Bug fixes and performance improvements\n\nIf you enjoy using theScore, please take the time to leave us a review. Thanks!\n\nRecent additions:\nFootball is back! Our latest update makes theScore the definitive football companion on mobile devices this season, taking you closer to the gridiron than ever before.    \n\n• Rich Scoring Play Visuals for NFL: You'll now be able to see exactly how a scoring play was made via rich graphics that show every key moment leading up to touchdown or field goal, including the number of plays, rush yards, pass yard and total time of that drive.\n\n• More Player Comparison Data: Available before and after each game, you can now compare season and individual game totals of key players for each matchup side-by-side, it's a perfect tool for checking which team has the edge.\n\n• Odds Movement Visualizations: A clear picture of how each game’s point spread and total have changed since the opening numbers were set by oddsmakers via a dynamic graphic that updates in real-time.\n\n• Situational Team Splits: Perfect for you ‘couch offensive coordinators,’ we've added situational team splits to live games, giving you the inside track on what the next play the offense will likely be running.   \n\n• Make sure to follow your NFL fantasy teams to get scoring alerts and breaking news on all of your players all season long.\n\n• Enhanced MLB box scores: Our enhanced MLB box scores now have more in-depth game stats and graphics, including charts for scoring plays and pitches.\n\n• MLB data visuals: The new Pitch-by-Pitch section tells you exactly what's happening live, pitch by pitch. Charts for batter hot zones and pitch location get you closer to the game than ever before.\n\n• Richer game details for MLB: We now include info on weather conditions and umpires for each game. \n\nIf you have any issues, feedback or ideas to enhance the app please email us at: thescoreapp[at]thescore[dot]com or tweet us @theScoreHelp. We sincerely appreciate your support. -theScore App team.", "sellerUrl": "http://mobile.thescore.com", "screenshotUrls": ["http://a5.mzstatic.com/us/r30/Purple3/v4/2c/ee/82/2cee8226-c07f-753a-64f0-81ca23c1f191/screen1136x1136.jpeg", "http://a5.mzstatic.com/us/r30/Purple3/v4/09/53/b8/0953b85c-e6cc-fb27-5c60-820072a9b9fe/screen1136x1136.jpeg", "http://a5.mzstatic.com/us/r30/Purple1/v4/0e/0e/e2/0e0ee2f1-f5aa-fa1e-6971-f30417b52661/screen1136x1136.jpeg", "http://a4.mzstatic.com/us/r30/Purple5/v4/b3/b7/f5/b3b7f502-ce2e-0fd9-c541-090ee279262a/screen1136x1136.jpeg", "http://a1.mzstatic.com/us/r30/Purple4/v4/f5/84/27/f58427c1-e382-b3b3-62c7-8c89eb20bf86/screen1136x1136.jpeg"], "userRatingCount": 49679, "trackContentRating": "4+", "formattedPrice": "Free", "artistViewUrl": "https://itunes.apple.com/us/artist/thescore/id669613188?uo=4", "kind": "software", "averageUserRatingForCurrentVersion": 3.0, "sellerName": "Score Media Ventures", "supportedDevices": ["iPhone5", "iPadThirdGen4G", "iPadFourthGen", "iPhone5c", "iPadMini", "iPad2Wifi", "iPodTouchFifthGen", "iPadThirdGen", "iPhone4S", "iPadMini4G", "iPadFourthGen4G", "iPhone5s", "iPad23G", "iPhone4"], "artworkUrl100": "http://a1336.phobos.apple.com/us/r30/Purple5/v4/59/eb/47/59eb47c0-a33d-0afc-7a69-d8893d23d07e/pr_source.jpg?downloadKey=1417124417_adc979068d7aa9324897dee973089700", "bundleId": "iphone.thescore.com", "trackViewUrl": "https://itunes.apple.com/us/app/thescore/id285692706?mt=8&uo=4", "minimumOsVersion": "7.0", "artworkUrl60": "http://a1626.phobos.apple.com/us/r30/Purple3/v4/88/a7/74/88a77432-64b6-144f-62ac-797cebba8e8a/AppIcon60x60_U00402x.png", "averageUserRating": 4.0}