{"contentAdvisoryRating": "4+", "features": [], "languageCodesISO2A": ["AR", "DA", "NL", "EN", "FR", "DE", "IT", "JA", "PT", "ZH", "ES", "ZH"], "ipadScreenshotUrls": [], "releaseDate": "2008-10-14T05:35:16Z", "currency": "USD", "artistId": 291890423, "userRatingCountForCurrentVersion": 2153, "wrapperType": "software", "advisories": [], "genres": ["Health & Fitness", "Social Networking"], "trackId": 291890420, "description": "Winner: Best Running App 2012 Reader's Choice at About.com. Built to help runners, joggers, and walkers of all ability levels and ages.\n\nEasily track pace, distance, calories, time with audio alerts and much more!\n\n“The best part of my run—the MapMyRun app. I’m in love with this thing… With MapMyRun, all you do is press Start when you begin your work out, and it calculates your route, mileage, minutes per mile and calories burned.” - @plankpilates\n\nTrack running, cycling, and over 600 types of other activities with:\n⊕ Pace\n⊕ GPS Route Mapping\n⊕ Distance\n⊕ Route navigation\n⊕ Calorie counting\n⊕ Elevation profile\n⊕ Nutrition, food, diet, and weight tracking\n⊕ Real-time Stats (avg, min, max) during workout\n⊕ Voice prompts that give you updates on your progress as you go!\n⊕ Sync with heart rate, speed, cadence and power sensors from CycleOps, Wahoo, Polar, Garmin and others (Bluetooth Smart™ and ANT+™). Works with Magellan Echo smart sports watch.\n⊕ Compete on local Courses: receive automatic achievements and overall rank on Leaderboards for popular local runs and rides.\n⊕ Tracks in the background so you can listen to music, take calls, and use any other feature of your phone, while still tracking\n\nBragging (optional!):\n⊕ Post your workouts to Facebook and Twitter, or keep every thing completely private\n\nPerfect training app for “couch to 5K”, all the way to elite marathoner, or even someone just looking for a weight loss, diet or calorie counting app.\n\nGreat for training for 10K, half marathon, marathon, even 50k (battery life up to 8 hours of tracking on newer phones!).\n\n--\nGreat for tracking any of the following activities: running, cardio, cycling, jogging, walking, weight lifting, dog walking, cross country skiing, unicycling, downhill skiing, snowboarding, gym workouts, weight lifting, basketball, soccer, hockey, yard work, yoga, p90x, crossfit, insanity, interval training, hill runs, rock climing, hiking, mountain biking, road cycling, dance, inline skating, barbell curls, cross training, spinning, roller skating, endurance training, kayaking, horseback riding, rowing machine, elliptical, resistance, commuting, skateboarding, rollerblading, stairs, abs, sprints, golf, lap swimming, open water swimming, triathalon, track & field, group runs, treadmill, stairmaster, weight machines , trail runs, cross country running, and any outdoor activity\n--\n\nNOTE: Continued use of GPS running in the background can dramatically decrease battery life.\n\nBe sure to visit us at www.MapMyRun.com for the full experience.\n\nGET MVP FOR PREMIUM FEATURES \nGain access to exclusive features with MVP from just USD 2.50 monthly.\n\n⊕ Reach your fitness goals with personal training plans \n⊕ Route Genius gives you route recommendations for any distance, starting from your current location \n⊕ Customized audio coaching tells you real-time workout details as you move \n⊕ Share your real-time location with family and friends using Live Tracking \n⊕ Analyze heart rate data for every workout (requires compatible HR monitor) \n⊕ Enjoy an ad-free experience \n\nShould you choose to upgrade to MVP, payment will be charged to your iTunes account at confirmation of purchase. The monthly subscription costs USD 5.99 per month while the yearly subscription costs USD 29.99 per year or USD 2.50 per month. Subscription renews automatically unless cancelled at least 24 hours prior to the end of the current period. There is no increase in cost when renewing. \n\nSubscriptions can be managed and auto-renewal turned off in Account Settings in iTunes after purchase. Once purchased, the current period can not be cancelled. Any unused portion of a free trial period is forfeited if you choose to purchase a subscription to MVP. \n\nFind the full terms and conditions, and our privacy policy, at http://www.mapmyrun.com/terms_of_use and http://about.mapmyfitness.com/about/user-privacy-policy/ respectively.", "artistName": "MapMyFitness", "artworkUrl512": "http://a901.phobos.apple.com/us/r30/Purple3/v4/1e/6b/6a/1e6b6a03-68eb-9ab2-c580-6d2f1696aa83/pr_source.png?downloadKey=1417124387_02fac6aa13bd87f8ded1b918c52d6aba", "version": "5.6.3", "primaryGenreId": 6013, "primaryGenreName": "Health & Fitness", "fileSizeBytes": "38297475", "price": 0.0, "isGameCenterEnabled": false, "trackCensoredName": "Run with Map My Run - GPS Running, Jog, Walk, Workout Tracking and Calorie Counter", "genreIds": ["6013", "6005"], "trackName": "Run with Map My Run - GPS Running, Jog, Walk, Workout Tracking and Calorie Counter", "releaseNotes": "• Enhanced auto-layout design\n• Minor bug fixes", "sellerUrl": "http://www.mapmyrun.com", "screenshotUrls": ["http://a5.mzstatic.com/us/r30/Purple3/v4/6c/20/f2/6c20f293-79eb-08f2-b467-76d7b3a7fe8f/screen1136x1136.jpeg", "http://a1.mzstatic.com/us/r30/Purple5/v4/ec/cb/e5/eccbe54f-efb0-3ada-a1a8-15a284c5c296/screen1136x1136.jpeg", "http://a3.mzstatic.com/us/r30/Purple3/v4/f4/25/3d/f4253dca-db39-c04a-615d-49efa69cf8d1/screen1136x1136.jpeg", "http://a1.mzstatic.com/us/r30/Purple3/v4/56/9b/5b/569b5b7a-7856-f518-b826-d73cc5ce129a/screen1136x1136.jpeg", "http://a4.mzstatic.com/us/r30/Purple5/v4/62/1d/c5/621dc53a-262b-8b54-e7f1-1d0b3b3c8c69/screen1136x1136.jpeg"], "userRatingCount": 113169, "trackContentRating": "4+", "formattedPrice": "Free", "artistViewUrl": "https://itunes.apple.com/us/artist/mapmyfitness/id291890423?uo=4", "kind": "software", "averageUserRatingForCurrentVersion": 5.0, "sellerName": "MapMyFitness", "supportedDevices": ["iPadFourthGen4G", "iPadMini4G", "iPhone5s", "iPadThirdGen4G", "iPhone5", "iPhone4", "iPhone4S", "iPadFourthGen", "iPadMini", "iPad23G", "iPadThirdGen", "iPhone5c", "iPodTouchFifthGen", "iPad2Wifi"], "artworkUrl100": "http://a901.phobos.apple.com/us/r30/Purple3/v4/1e/6b/6a/1e6b6a03-68eb-9ab2-c580-6d2f1696aa83/pr_source.png?downloadKey=1417124387_02fac6aa13bd87f8ded1b918c52d6aba", "bundleId": "Q5AWL8WCY6.iMapMyRun", "trackViewUrl": "https://itunes.apple.com/us/app/run-map-my-run-gps-running/id291890420?mt=8&uo=4", "minimumOsVersion": "7.0", "artworkUrl60": "http://a469.phobos.apple.com/us/r30/Purple1/v4/8d/0d/2c/8d0d2c08-fbab-0e9b-fc17-0c83e6b1dbd1/MapMyRun_App_Icons57x57.png", "averageUserRating": 4.5}