{"contentAdvisoryRating": "4+", "features": [], "languageCodesISO2A": ["EN"], "ipadScreenshotUrls": [], "releaseDate": "2008-10-16T00:49:33Z", "currency": "USD", "artistId": 288669797, "userRatingCountForCurrentVersion": 97, "wrapperType": "software", "advisories": [], "genres": ["Health & Fitness", "Productivity"], "trackId": 292987597, "description": "Recommended by Dr. Oz as a miracle for better sleep! Find out why the world is sleeping better with White Noise Lite for FREE. Features ambient sounds of the environment to help you relax during the day and sleep great at night. \n\nDo you have trouble going to sleep? Are you traveling on a plane and need a quick power nap? Does your newborn baby wake up in the middle of the night? There are numerous benefits to using White Noise: \n\n• Helps you sleep by blocking distractions \n• Relaxes and reduces stress \n• Pacifies fussy and crying babies \n• Increases focus while enhancing privacy \n• Soothes headaches and migraines \n• Masks tinnitus (ringing of the ears) \n\nEven when you’re asleep, your brain is constantly scanning and listening for sounds. If it’s too quiet, unwanted noises such as faucet drips or police sirens can interrupt your sleep. White Noise generates sounds over a wide range of frequencies, masking those noise interruptions, so you can not only fall asleep, but stay asleep. \n\nSOUND CATALOG\n\nAir Conditioner, Airplane Travel, Amazon Jungle, Beach Waves Crashing, Blowing Wind, Blue Noise, Boat Swaying in Water, Brown Noise, Camp Fire, Cars Driving, Cat Purring, Chimes Chiming, City Streets, Clothes Dryer, Crickets Chirping, Crowded Room, Dish Washer, Extreme Rain Pouring, Frogs at Night, Grandfather Clock, Hair Dryer Blowing, Heartbeat, Heavy Rain Pouring, Light Rain with Birds, Ocean Waves Crashing, Oscillating Fan, Pink Noise, Rain on Car Roof, Rain Storm, Running Shower, Running Water, Stream Water Flowing, Thunder Storm, Tibetan Singing Bowl, Train Ride, Vacuum Cleaner, Violet Noise, Water Dripping, Water Sprinkler, White Noise\n\nAPPLICATION FEATURES \n\n• 40+ perfectly looped sounds with free downloads from the White Noise Market at http://whitenoisemarket.com/ \n• Record and loop additional new sounds with total ease\n• Create new soundscapes by mixing multiple noises together like a DJ with support for adjusting volume, balance, and pitch of each individual sound in the mix \n• Full screen digital clock with multiple colors and brightness controls makes it the perfect companion for any nightstand \n• Advanced alarm and timer system that slowly fades audio in and out so you awake naturally feeling more refreshed \n• On-screen media player and volume controls with swipe gesture support for navigating sound collection \n• Star favorite sounds and mixes in the sound catalog for quick access using the Favorite view \n• Use iPod Music as alarms that slowly fade in so you wake refreshed \n• AirPlay sounds to Bluetooth devices or Apple TV \n• iPhone 5 and Retina display support \n• Control White Noise Lite from Lock Screen or using headphones with remote control buttons \n• Create timed playlists of sounds and mixes \n• Advanced Settings let you adjust sound volume, balance, pitch, mixing with iPod music, looping the playlist, custom alarm snooze times, and more \n\nPRESS REVIEWS \n\nWhite Noise has been featured by popular TV shows (Dr. Oz Show, FOX&Friends, Late Night with Jimmy Fallon), major media outlets (NBC News Today, Health Magazine, The Washington Post, NY Times, CNET, Esquire, PC Magazine), and raved about by millions of satisfied customers. \n\nDR. OZ SHOW: 13 Miracles of 2013 \n\"Revolutionary Sound App!” \n\nTHE WASHINGTON POST: Smartphone Puts Newborn to Sleep \n\"For the next four months, the infant slept with his father's phone in his crib and White Noise tuned to 'air conditioner.' The monotonous buzz kept the baby sleeping soundly and his parents happy.\" \n\nCNET: Apps that can improve your life \n“Trouble falling asleep at night? A little White Noise might do the trick.” \n\nHEALTH MAGAZINE: \"Help you turn off your brain, fall asleep faster, and get the rest you desperately need\" \n\nUPGRADE TO FULL VERSION\n\nDownload the full version of White Noise to get background audio, additional alarms, unlimited recordings, unlimited downloads, and no ads.  Just tap the web button to learn more.", "artistName": "TMSOFT", "artworkUrl512": "http://a518.phobos.apple.com/us/r30/Purple1/v4/49/42/56/494256c8-641b-2d05-6515-b69af839fbd7/mzl.hwccueet.png", "version": "5.7.4", "primaryGenreId": 6013, "primaryGenreName": "Health & Fitness", "fileSizeBytes": "34695793", "price": 0.0, "isGameCenterEnabled": false, "trackCensoredName": "White Noise Lite: Relax. Sleep. Better.", "genreIds": ["6013", "6007"], "trackName": "White Noise Lite: Relax. Sleep. Better.", "releaseNotes": "5.7.4 adds bug fixes and minor improvements under the hood to enhance performance.  5.7 added a total of 40 sounds and new Recorder.  Tap + and Create Recording to record and loop your own sounds.  Our GeniusLoop algorithm will professionally loop and blend your audio so it can playback forever without interruption.  New audio engine reduces memory usage.", "sellerUrl": "http://www.tmsoft.com/white-noise/", "screenshotUrls": ["http://a4.mzstatic.com/us/r30/Purple5/v4/5d/7c/20/5d7c205a-d1bd-6cc2-e8d3-d7341f63c255/screen1136x1136.jpeg", "http://a3.mzstatic.com/us/r30/Purple3/v4/34/6e/1c/346e1c8a-8383-a47d-9c09-221c1f4ce894/screen1136x1136.jpeg", "http://a3.mzstatic.com/us/r30/Purple1/v4/13/d4/cf/13d4cf6b-1545-b301-b569-7c381f5ee29e/screen1136x1136.jpeg", "http://a4.mzstatic.com/us/r30/Purple4/v4/0a/fe/77/0afe77c9-36e5-c887-b433-b9e1732238ce/screen1136x1136.jpeg", "http://a1.mzstatic.com/us/r30/Purple3/v4/af/3e/3a/af3e3adb-03db-6e35-870a-3c8375cace7d/screen1136x1136.jpeg"], "userRatingCount": 112306, "trackContentRating": "4+", "formattedPrice": "Free", "artistViewUrl": "https://itunes.apple.com/us/artist/tmsoft/id288669797?uo=4", "kind": "software", "averageUserRatingForCurrentVersion": 5.0, "sellerName": "TMSOFT", "supportedDevices": ["iPhone4", "iPadMini4G", "iPadFourthGen", "iPhone5", "iPad3G", "iPadWifi", "iPhone5s", "iPodTouchFifthGen", "iPadThirdGen4G", "iPad2Wifi", "iPadFourthGen4G", "iPadThirdGen", "iPad23G", "iPodTouchThirdGen", "iPhone5c", "iPadMini", "iPhone-3GS", "iPhone4S", "iPodTouchourthGen"], "artworkUrl100": "http://a518.phobos.apple.com/us/r30/Purple1/v4/49/42/56/494256c8-641b-2d05-6515-b69af839fbd7/mzl.hwccueet.png", "bundleId": "com.tmsoft.WhiteNoiseLite", "trackViewUrl": "https://itunes.apple.com/us/app/white-noise-lite-relax.-sleep./id292987597?mt=8&uo=4", "minimumOsVersion": "5.0", "artworkUrl60": "http://a602.phobos.apple.com/us/r30/Purple5/v4/00/8f/e4/008fe43d-3a8e-232e-71d0-44232d2f536f/Icon.png", "averageUserRating": 3.5}