{"contentAdvisoryRating": "4+", "features": [], "languageCodesISO2A": ["ZH", "NL", "EN", "FR", "DE", "IT", "JA", "KO", "PT", "RU", "ES", "SV"], "ipadScreenshotUrls": [], "releaseDate": "2009-01-14T01:56:47Z", "currency": "USD", "artistId": 300226026, "userRatingCountForCurrentVersion": 287, "wrapperType": "software", "advisories": [], "genres": ["Health & Fitness", "Sports"], "trackId": 300235330, "description": "Track your pace, measure workout distance, chart weight loss, crush training goals and more with LifeHacker’s 2012 Best Running App!  RunKeeper is the simplest way to improve fitness, whether you’re just deciding to get off the couch for a 5k, biking every day, or deep into marathon training. \n\nTrack your runs, walks, bike rides, training workouts and all of the other fitness activities using the GPS in your iPhone.\n○  Calculate running pace, cycling speed, route distance, elevation and calorie burn for any fitness activity - in high accuracy and real time!\n○  Find and follow pre-planned routes and see your location route on a map\n○  Follow training plan workouts or create your own with audio coaching \n○  Get audio updates while you work out about your total mileage, calorie count, pace, speed, mileage\n○  Sync your Bluetooth Smart or ANT+ heart rate monitor (such as Wahoo Blue HR, Polar H7, Garmin HRM, and many others) to track your heart rate and stay in heart rate zones\n○  Use your iPhone 5s to track cadence and steps\n○  Use your Pebble smart watch to track all your stats, right on your wrist!\n○  RunKeeper automatically integrates with your phone’s music app\n○  Easily add your indoor cardio (treadmill, elliptical) and gym workouts (Yoga, Crossfit)\n\nRunKeeper is the training app for all skill levels\n○  Find and follow Run/Walk training plans as a beginner\n○  Get coached with 10k, Half Marathon and Full Marathon training plans for more advanced runners built by renowned coaches like Jeff Galloway\n○  Train for weight loss with “running for fat loss” plans by Mike Diebler\n○  View entire training calendar directly in the app, and get coached through each workout while you run with audio cues\n\nSync Runkeeper.com with the best fitness apps you’re all ready using for nutrition, sleep monitoring, weight, step tracking, calorie counting and getting rewards. RunKeeper works great with:\n○  MyFitnessPal calorie tracking app\n○  Fitbit activity monitoring devices\n○  Garmin Forerunner GPS watches and Garmin Connect\n○  Withings wifi scales\n○  Sleep Cycle app\n○  Hundreds of other apps and devices like, Lose it!, Jawbone Up, GymPact, Earnedit, Fitocracy, Zombies Run, Gym Hero, pedometers and more!\n\nSet fitness goals and track your progress over time\n○  Set goals to run a half marathon, lose weight, complete a total distance or set a personal record\n○  Chart your progress, and see a full log of all your past goals\n\nRunKeeper Elite\n○  Compare Workouts: Automatically rank similar workouts and compare pace and elevation between them. See improvements over time with Insights!\n○  Premium Training Plans: Take advantage of premium training plans that show you what workouts you need to do each week to improve and stay on track towards achieving your goals\n○  Personalized Guidance with Goal Coach: Goal Coach will help you understand what you’re trying to achieve and create a training plan that’s perfect for you.  Encouragement and suggestions along the way help keep you on track.\n○  Live Activity Tracking: Share your current activity in real time\n○  Ad-Free Experience\n\nSubscriptions for RunKeeper Elite are $9.99 per month or $39.99 for a full year. RunKeeper Elite subscriptions will be charged to your iTunes account after your confirmation of purchase. Your monthly subscription will automatically renew each month and be charged through your iTunes account, yearly subscriptions will automatically renew each year. Subscriptions renew at $9.99 per month or $39.99 for a full year automatically unless cancelled at least 24 hours prior to the end of the current period. You can turn off auto-renew at any time from your iTunes account settings.  Cancellation of the current active subscription period is not allowed.\n\nFind the full terms and conditions, and our privacy policy, at http://runkeeper.com/termsofservice and http://runkeeper.com/privacypolicy respectively. \n\nNote: Continued use of GPS running in the background can dramatically decrease battery life.", "artistName": "FitnessKeeper, Inc.", "artworkUrl512": "http://a674.phobos.apple.com/us/r30/Purple1/v4/2c/22/ad/2c22ad3a-90bc-2427-b2c4-a81848d903c1/mzl.tbvncmod.png", "version": "5.0.1", "primaryGenreId": 6013, "primaryGenreName": "Health & Fitness", "fileSizeBytes": "33966230", "price": 0.0, "isGameCenterEnabled": false, "trackCensoredName": "RunKeeper - GPS Running, Walk, Cycling, Workout and Weight Tracker", "genreIds": ["6013", "6004"], "trackName": "RunKeeper - GPS Running, Walk, Cycling, Workout and Weight Tracker", "releaseNotes": "5.0.1\nFixed the music / audio cue issue that was preventing music from returning to normal volume. Thank you for your bug reports!\n\n5.0\nIndoor tracking! Running on a treadmill to escape the cold or rainy weather? We now made it easy to track your indoor activities with RunKeeper’s Stopwatch Mode. \n\n- View your Time and Heart Rate data during the activity\n- Receive audio cues for Time and Heart Rate \n- Your pace gets calculated when you enter your total distance after your workout\n- As usual, all of your hard-earned miles will be counted toward your goals\n\nHere’s how to track an indoor workout with Stopwatch Mode:\n1) On the “Start” screen select activity “Type”\n2) On the “Activity Type” screen select “Stopwatch Mode”\n3) Select your activity from the list\n4) Select the “Go” button on the “Start” screen and get your sweat on!", "sellerUrl": "http://www.runkeeper.com", "screenshotUrls": ["http://a5.mzstatic.com/us/r30/Purple3/v4/61/70/b9/6170b981-0ad6-5286-9bf4-28b87a478432/screen1136x1136.jpeg", "http://a4.mzstatic.com/us/r30/Purple4/v4/95/59/46/95594602-b076-ca76-fc38-3ec2696203c4/screen1136x1136.jpeg", "http://a1.mzstatic.com/us/r30/Purple3/v4/e2/ae/20/e2ae2017-c6a0-7bef-5e59-e0bc1bd309c1/screen1136x1136.jpeg", "http://a3.mzstatic.com/us/r30/Purple5/v4/fe/5d/de/fe5ddee2-a891-0338-b095-6dbfb5e9546c/screen1136x1136.jpeg", "http://a1.mzstatic.com/us/r30/Purple4/v4/71/9f/1d/719f1d47-57c8-9bde-42fd-0db756c8e4c3/screen1136x1136.jpeg"], "userRatingCount": 34233, "trackContentRating": "4+", "formattedPrice": "Free", "artistViewUrl": "https://itunes.apple.com/us/artist/fitnesskeeper-inc./id300226026?uo=4", "kind": "software", "averageUserRatingForCurrentVersion": 4.5, "sellerName": "RunKeeper, LLC", "supportedDevices": ["iPadThirdGen", "iPhone5s", "iPad2Wifi", "iPhone4", "iPad23G", "iPadMini4G", "iPhone5", "iPodTouchourthGen", "iPadMini", "iPadThirdGen4G", "iPhone-3GS", "iPhone5c", "iPadFourthGen4G", "iPhone4S", "iPadFourthGen", "iPodTouchFifthGen"], "artworkUrl100": "http://a674.phobos.apple.com/us/r30/Purple1/v4/2c/22/ad/2c22ad3a-90bc-2427-b2c4-a81848d903c1/mzl.tbvncmod.png", "bundleId": "RunKeeperPro", "trackViewUrl": "https://itunes.apple.com/us/app/runkeeper-gps-running-walk/id300235330?mt=8&uo=4", "minimumOsVersion": "6.0", "artworkUrl60": "http://a894.phobos.apple.com/us/r30/Purple3/v4/e1/2f/d5/e12fd54c-622b-3575-8519-f8918fbb9e8b/AppIcon57x57.png", "averageUserRating": 4.5}