{"contentAdvisoryRating": "4+", "features": ["iosUniversal"], "languageCodesISO2A": ["CA", "ZH", "CS", "NL", "EN", "FR", "DE", "IT", "JA", "KO", "NO", "PT", "RU", "ES", "SV"], "ipadScreenshotUrls": ["http://a3.mzstatic.com/us/r30/Purple3/v4/f2/9f/45/f29f4535-64b9-9476-7a36-6ff18e4b4269/screen480x480.jpeg", "http://a5.mzstatic.com/us/r30/Purple1/v4/1c/4e/37/1c4e374a-e0e8-15f5-202b-bdfde3fafd25/screen480x480.jpeg", "http://a5.mzstatic.com/us/r30/Purple3/v4/a6/41/1b/a6411b50-cc6b-1b16-7137-728fb0b8d3a6/screen480x480.jpeg", "http://a3.mzstatic.com/us/r30/Purple1/v4/53/9c/75/539c75f0-df46-c3dc-83fd-b05c6bce934d/screen480x480.jpeg", "http://a2.mzstatic.com/us/r30/Purple3/v4/a1/2a/7a/a12a7aae-f596-39d7-198d-a7c1e4bc1b53/screen480x480.jpeg"], "releaseDate": "2009-10-15T22:55:55Z", "currency": "USD", "artistId": 285944186, "userRatingCountForCurrentVersion": 58, "wrapperType": "software", "advisories": [], "genres": ["Productivity", "Utilities"], "trackId": 303656546, "description": "Be convinced! Checkout our video tutorials, showcasing various features: https://www.youtube.com/user/The2DoApp\n\n2Do lets you take a completely different approach to managing your tasks. With its extremely simple-to-use interface and a comprehensive and flexible set of powerful features, it lets you focus on what's most important to you: your life. There is no wrong way of using 2Do, and unlike other to-do apps, it won't force you in adhering to a particular task management methodology. \n\n\nAWARDS\n• “Best App Ever Awards” Winner\n• Cult Of Mac - 5/5\n• Gizmodo \"Best app for forgetful people\" - Gold Medal\n• Apple - Featured in “App Store Essentials”, \"Great apps for iOS 8\", \"@Work\"\n• Apple - Mac App Store “Get Stuff Done”\n• Apple - Mac App Store “Best of 2013”\n\n\u2028\u2028\nREADY FOR iOS 8\n• Widget for Notification Center\n• Support for iPhone 6 and 6 Plus.\u2028\n• Interactive notifications to mark your tasks done or snooze alerts right from the lock screen.\n• Touch ID to unlock 2Do\n• Use 2Do's Share Extension from Safari or other apps that share Text\n\n\u2028\nSYNC \n\u2028• Stay in sync using one of the following: Dropbox, Reminders (CalDAV), Toodledo, Fruux (CalDAV), Calendar Server (CalDAV), ownCloud (CalDAV), SabreDAV (CalDAV) or a 3rd party CalDAV Server of choice.\n• Using Reminders CalDAV sync enables Siri\n• Periodic automatic backups are created for you (compatible with 2Do for Mac) for a rainy day. \u2028\n\n\nSIMPLE TASKS, CHECKLISTS & PROJECTS \u2028\n• Create simple tasks, or checklists and projects with sub-tasks. Tasks can have notes, attachments and multiple alarms. \u2028\n• Set any task to repeat using a flexible set of options. \u2028\u2028\n\n\nLIST GROUPS, LISTS, INBOX & SMART LISTS\n\u2028• In addition to built-in Focus lists that allow you to conveniently view upcoming, starred or scheduled tasks, you can create multiple lists to manage and organize your tasks. \n• For GTD enthusiasts we’ve added built-in Inbox support to serve as the default collection list\n• Smart lists let you harness the true potential of 2Do using a number of search options, filters and search pre-sets. Using Smart Lists, you can create custom views of your tasks and use them to focus-in or find frequently managed tasks. \u2028\n\n\nPINCH ZOOMING\n\u2028• Control the amount of information you wish to see with a simple pinch-to-zoom gesture, from single line titles to multiple lines of titles, notes and tags.\u2028\n\n\nBATCH EDITING & SHARING\n\u2028• Drag & Drop support to move tasks between lists or drop on calendar to defer\n• Batch tagging, starring, marking tasks done and more\n• Task Sharing via AirDrop, iMessage and Email\n\n\nREIMAGINED TASK EDITOR & QUICK ADD\n\u2028• With focus on switching between editors effortlessly using a single tap only, you’ll save dozens of taps and swipes when editing your tasks.\n• Save your thoughts as they come to you, by using Quick Add (Tap-hold on [+])\n• With support for URL Schemes along with X-callback-url, 2Do is now a power-user playground\u2028\u2028\n\n\nTAGS \n\u2028• Manage tags from a dedicated Tags Panel which is just a swipe away\n• Organize your tags within groups\n\u2028• Leverage the easy to use yet powerful integration of Tags & Smart Lists to filter on frequently managed tasks. \u2028\n• Find Used vs. Unused tags\n\n\nYOUR TASKS UNLIMITED\n\u2028• Set a Start Date to hide tasks from a list before they're relevant and add Duration to put an estimate on the amount of time you’ll be spending on your task\n• Let your tasks be interactive. Add an action to call, write an email or message, navigate or trigger a URL Scheme right from 2Do\n• Attach an image or a voice memo to your tasks\n\n\nNEARBY ALERTS\n• Attach locations to tasks and get nearby alerts as you approach assigned locations \n\n\nDESKTOP-CLASS IPAD APP\n\u2028• Your Lists, Tasks, Daily Summary and Calendar, including Calendar Events, can all be viewed and managed from the same screen.\n• Use keyboard shortcuts with your Bluetooth keyboard\n\n\nEXTRAS\n• TextExpander support\n• Much more!\n\nFollow us:\nTwitter: @2DoApp\nFacebook.com/The2DoApp\nYoutube.com/user/The2DoApp", "artistName": "Guided Ways Technologies Ltd", "artworkUrl512": "http://a1957.phobos.apple.com/us/r30/Purple3/v4/f2/f0/bd/f2f0bdd9-216c-28c5-5495-7782858c29ec/mzl.hbfzmosv.png", "version": "3.2", "primaryGenreId": 6007, "primaryGenreName": "Productivity", "fileSizeBytes": "28537208", "price": 14.99, "isGameCenterEnabled": false, "trackCensoredName": "2Do", "genreIds": ["6007", "6002"], "trackName": "2Do", "releaseNotes": "What's New in 3.2:\nOne free action packed update after another! \n\n[NEW] Notification Center Widget! Access tasks from Today, Starred or a Custom picked list directly from the widget.\n[NEW] Overhauled and re-written CalDAV support. Support for 3rd party CalDAV servers such as Fruux, SabreDAV, ownCloud, Oracle and more! Support in the Mac app for 3rd party servers coming soon.\n[NEW] Much, much faster, more robust Reminders sync over CalDAV.\n[NEW] Export tasks as CSV\n[NEW] Focus filter for 'In Progress' tasks. Select this to immediately see only those tasks that have already started, due to an earlier start date or set duration that caused the task to appear in 'Today' before its due date.\n\n2Do now has its own YouTube channel! Access tutorial videos that walk you through the many features in 2Do from Settings > Video Tutorials. If if you think you're a veteran 2Do user, there is still a lot to discover! \n\nThis update brings you many performance and stability improvements, bug fixes and a lot more.\n\n\nWhat's New in 3.0:\n- Everything. Brand new app built from ground up with iOS 7 and 8 in mind. We've improved upon and introduced over 200 new features and improvements and touched every pixel of the app, whilst making the app feel light, fresh and clutter free. \n- Desktop-grade task management at your finger tips. Extendable lists, tasks and tags will make your workflows shine.\n- Calendar Events for iPad: View and manage your Calendar events directly from within 2Do. No need to switch between apps.\n- Native 'Inbox' for GTD lovers: Using an Inbox list in 2Do to cover your love for the GTD workflow? 2Do now promotes your Inbox lists optionally and allows you to set it as your default collection list.\n- List Groups: Create new List Groups for organizing your lists. You can collapse or expand a List group with a simple tap.\n- Quick Add: Tap and hold on [+] to add one task after another\n- Fluid Task Editing. We reimagined the 'edit' and 'new task' screens to make it more fun, and best of all, faster to switch between editing dates, alerts and everything else.\n- Extended View: Tap on the priority button next to the task to view multiple lines of text, notes and tags in one go\n- Pinch Zooming: Pinch your fingers to zoom in or zoom out of your tasks. \n- Drag & drop for Quick Deferring: The new batch edit bar (below the task list) allows you to batch edit, or display a calendar that you can drag and drop tasks on to\n- Keyboard Shortcuts for iPads (with external keyboards)\n- New Tap-Hold Popup: Do a lot more on a task by tap-holding on it\n- New and improved Search bar with search presets for easier Smart List creation.\n- New and improved Sort Bar\n- New and Improved Tag editing\n- New and Improved Actions\n- New and Improved Settings\n- New and Improved Password Protection with iOS 8 fingerprint unlock support\n- New and Improved Notifications with built-in actions for iOS 8\n- Improved and optimized background sync\n- New and Improved *everything*", "sellerUrl": "https://www.youtube.com/user/The2DoApp", "screenshotUrls": ["http://a5.mzstatic.com/us/r30/Purple3/v4/21/bf/49/21bf499e-17ee-5a70-62ea-d35a2180c9ab/screen1136x1136.jpeg", "http://a5.mzstatic.com/us/r30/Purple3/v4/db/b9/d6/dbb9d6fc-6abe-5188-4204-481eaa7f88dc/screen1136x1136.jpeg", "http://a2.mzstatic.com/us/r30/Purple3/v4/d9/4c/76/d94c769d-1fa8-a82a-1826-06d7b2bfa0a9/screen1136x1136.jpeg", "http://a2.mzstatic.com/us/r30/Purple3/v4/e5/62/ac/e562ac9d-655e-008c-5add-1882a2540a0a/screen1136x1136.jpeg", "http://a2.mzstatic.com/us/r30/Purple1/v4/48/6f/ea/486feac3-83ad-de84-24b8-83d418274610/screen1136x1136.jpeg"], "userRatingCount": 18092, "trackContentRating": "4+", "formattedPrice": "$14.99", "artistViewUrl": "https://itunes.apple.com/us/artist/guided-ways-technologies-ltd/id285944186?uo=4", "kind": "software", "averageUserRatingForCurrentVersion": 4.0, "sellerName": "Guided Ways Technologies Ltd", "supportedDevices": ["iPadMini4G", "iPhone5", "iPadThirdGen4G", "iPadMini", "iPhone4", "iPadThirdGen", "iPhone5c", "iPadFourthGen4G", "iPad23G", "iPhone4S", "iPadFourthGen", "iPad2Wifi", "iPhone5s", "iPodTouchFifthGen"], "artworkUrl100": "http://a1957.phobos.apple.com/us/r30/Purple3/v4/f2/f0/bd/f2f0bdd9-216c-28c5-5495-7782858c29ec/mzl.hbfzmosv.png", "bundleId": "com.guidedways.2Do", "trackViewUrl": "https://itunes.apple.com/us/app/2do/id303656546?mt=8&uo=4", "minimumOsVersion": "7.0", "artworkUrl60": "http://a1054.phobos.apple.com/us/r30/Purple3/v4/04/b2/e5/04b2e50c-3b41-1f4b-0bb8-44b2fdb0323b/AppIcon60x60_U00402x.png", "averageUserRating": 4.5}