{"contentAdvisoryRating": "4+", "features": [], "languageCodesISO2A": ["EN"], "ipadScreenshotUrls": [], "releaseDate": "2009-03-27T01:32:14Z", "currency": "USD", "artistId": 291276001, "userRatingCountForCurrentVersion": 4, "wrapperType": "software", "advisories": [], "genres": ["Health & Fitness", "Lifestyle"], "trackId": 306287984, "description": "Introducing the all-new FitnessBuilder. This comprehensive fitness experience is *the* portable personal trainer that completely guides your fitness lifestyle. FitnessBuilder 5 is for everyone, whether you are new to fitness or a seasoned veteran. It’s also the definitive app for fitness professionals, coaches and physical therapists.\n\nCHOOSE YOUR ACCESS\nFREE: Create a FREE account and get access to over 400 workouts in 16 multi-week fitness plans. Any previous user with Free access also gets access to these same plans. There are no ads or automatic subscriptions if you choose to keep Free access.\n\nPLUS: Upgrade to Plus access and unlock the full fitness library of over 1,000 workouts and use Builder, where you can create your own workouts using over 7,000 exercise images & videos. A Plus subscription also allows you to share & receive workouts with friends & trainers, ask Fitness Questions, generate Workout PDFs, create your own My Exercises and more.\n\nPRO: If you are a fitness professional, Pro access is the ultimate training tool for you. It allows you to keep track of all your clients, their workouts and logs for both in-session and Remote Training. You can share workouts with clients to their Plus accounts, where they can digitally receive and track those sessions, and their logs will sync back to your client dashboards for review. Each of those Remote Training sessions are also delivered as an interactive PDF with videos, if your clients don’t want to get Plus. You can also brand the app & shared workouts with your company name & logo.\n\nPT: Physical Therapists and other rehab specialists get access to everything Pro offers in addition to hundreds of rehab exercises, for a total of 1,400+ rehab exercise images & videos and 350+ recovery protocols -with a PT subscription. PT access allows the building of custom rehab workouts and track & share these with patients. The Remote Rehab compliance monitoring also allows therapists to receive patient feedback helping to speed up recovery rates.\n\nWORKOUTS\nFitnessBuilder contains over 1,000 pre-made workouts covering all fitness levels and disciplines. Each workout is mapped with Next Workout intelligence that recommends the next session for you. Once you start a plan, FitnessBuilder keeps you on track. FitnessBuilder is also available on your mobile device, tablet and computer browser, all staying in sync with each other for access anywhere, anytime.\n\nWith HealthKit support, when you complete a workout log, FitnessBuilder will ask your permission to use your body weight, workout difficulty and duration to calculate the estimated caloric burn, and post it to the Health app as a workout.\n\nSYNC NOW & UPDATE\nBefore updating to iOS 8, all users currently on iOS 7 are urged to first go to FitnessBuilder Settings and tap Sync Now until the Complete message appears. This will best prepare you for your FitnessBuilder 5 update, which will then sync down all your backed up cloud data.\n\nFitnessBuilder 5 is iOS 8 native, supports HealthKit for tracking workouts & your estimated calories burned. Some features from the previous FitnessBuilder version are not yet in 5.0, such as My Stats, Client Stats and Progress Graphs. These will be re-added ASAP. In the meantime, they are currently available on the web version.\n\nSUBSCRIPTIONS\nIf you choose to get an optional in-app Plus, Pro or PT subscription, it will automatically renew each month or year and your credit card will be charged through your iTunes account. You can cancel by turning off auto-renew from your iTunes account settings.", "artistName": "PumpOne", "artworkUrl512": "http://a1739.phobos.apple.com/us/r30/Purple3/v4/f4/14/b7/f414b7d4-2ed1-23b3-a160-d7048aa91ef6/mzl.mjifmmcs.jpg", "version": "5.0.2", "primaryGenreId": 6013, "primaryGenreName": "Health & Fitness", "fileSizeBytes": "31035652", "price": 0.0, "isGameCenterEnabled": false, "trackCensoredName": "FitnessBuilder", "genreIds": ["6013", "6012"], "trackName": "FitnessBuilder", "releaseNotes": "Fixes for integrating with the Health app, emailing client logs and Facebook login crash.\n\n--For those that missed the 5.0 update--\nFitnessBuilder 5 for iOS 8 is here! Completely overhauled for larger screen devices, and including HealthKit support, the new FitnessBuilder 5 is smarter, sharper, smoother and packed with even more amazing features.\n\nWe know it took a while to get FitnessBuilder 5 out and we truly appreciate your patience. If you have questions, just tap the in-app Ask a Support Question and we’ll get right back to you. If you previously left a less than stellar review for FitnessBuilder on iTunes, we ask you to please update to FitnessBuilder 5, check it out and we are confident it will change your mind and your review. \n\nImportant: When you first login to FitnessBuilder 5, all your backed up data will sync. This should take about 5 minutes or less for most users. But for power users, Pros & PTs with a lot of data, it could much longer, so please be patient. We’ve added a sync screen with a status % so you know when all of your data is back in your account.\n\nSome features from the previous FitnessBuilder version are not yet in 5.0, such as My Stats, Client Stats and Progress Graphs. These will be re-added ASAP. In the meantime, they are currently available on the web version.", "sellerUrl": "http://www.pumpone.com", "screenshotUrls": ["http://a4.mzstatic.com/us/r30/Purple3/v4/35/88/09/358809ef-d53a-7896-5bf9-2a5af4e90dce/screen1136x1136.jpeg", "http://a3.mzstatic.com/us/r30/Purple5/v4/26/ea/5f/26ea5f7f-fbcd-ea9d-cadc-6d1aaf6bf40b/screen1136x1136.jpeg", "http://a5.mzstatic.com/us/r30/Purple5/v4/61/b6/60/61b6600f-d6dd-64bb-ed5d-608ca4e43c9f/screen1136x1136.jpeg", "http://a5.mzstatic.com/us/r30/Purple5/v4/9a/61/52/9a61522f-3f03-e6b0-4c58-a130be532ac1/screen1136x1136.jpeg", "http://a2.mzstatic.com/us/r30/Purple3/v4/f3/37/b9/f337b93b-51bd-0cf9-9a20-595df80c3062/screen1136x1136.jpeg"], "userRatingCount": 2111, "trackContentRating": "4+", "formattedPrice": "Free", "artistViewUrl": "https://itunes.apple.com/us/artist/pumpone/id291276001?uo=4", "kind": "software", "averageUserRatingForCurrentVersion": 4.0, "sellerName": "PumpOne", "supportedDevices": ["iPhone4S", "iPodTouchFifthGen", "iPhone5c", "iPad23G", "iPhone5", "iPhone5s", "iPadMini", "iPadThirdGen", "iPadFourthGen", "iPadFourthGen4G", "iPadThirdGen4G", "iPadMini4G", "iPad2Wifi"], "artworkUrl100": "http://a1739.phobos.apple.com/us/r30/Purple3/v4/f4/14/b7/f414b7d4-2ed1-23b3-a160-d7048aa91ef6/mzl.mjifmmcs.jpg", "bundleId": "com.pumpone.AllAccess1", "trackViewUrl": "https://itunes.apple.com/us/app/fitnessbuilder/id306287984?mt=8&uo=4", "minimumOsVersion": "8.0", "artworkUrl60": "http://a1506.phobos.apple.com/us/r30/Purple3/v4/0e/24/16/0e24169f-ae4a-99b2-35e4-92c88242bebb/AppIcon60x60_U00402x.png", "averageUserRating": 3.5}