{"contentAdvisoryRating": "4+", "features": [], "languageCodesISO2A": ["AR", "DA", "NL", "EN", "FR", "DE", "IT", "JA", "PT", "ZH", "ES", "ZH"], "ipadScreenshotUrls": [], "releaseDate": "2009-03-27T02:06:21Z", "currency": "USD", "artistId": 291890423, "userRatingCountForCurrentVersion": 8, "wrapperType": "software", "advisories": [], "genres": ["Navigation", "Health & Fitness"], "trackId": 307861852, "description": "Use your phone's GPS to track and log your hikes, view elevation info, and build an online hike journal. \n\nNOTE: iOS 7 users - To ensure your workout is recorded, please turn on MapMyHike in System Settings > General > Background App Refresh.\n\nAutomatically syncs with your free account at www.MapMyHike.com, fully integrated with Facebook and Twitter for sharing. \n\nLive tracking feature lets you automatically see where your hiking companions are on a map - in real time using your GPS! \n\nSearch from millions of hikes in our database at www.MapMyHike.com. Bookmark the hikes you like, then open the app and easily navigate the trails. \n\nThe new MapMyHike makes tracking your hiking and outdoor adventures easy.\n\nMapMyHike uses the built-in GPS technology of your iPhone to enable you to track your hikes and gets you closer to achieving your health and fitness goals. Step out your front door, hit the trail, and this app will effortlessly mark out your path along an interactive map and record essential metrics including duration, distance, pace, speed and elevation. Once you finish your hike, save your data and it automatically uploads to www.MapMyHike.com where you can view your route, hike data, and a comprehensive workout history. Plus, the new MapMyHike gives you the ability to easily share your hike data with friends and family via email and Twitter. \n\nThe new MapMyHike boasts all of these great features: \n\n⊕ Real-time tracking that measures and displays time, distance, pace, speed and elevation.\n⊕ An interactive map that lets you view your current location and exactly where you have traveled along your route \n⊕ Synchronization with your online 'Training Log' on www.MapMyHike.com. \n⊕ Manual entry of workout data directly from the app so you can easily record your indoor activities like gym workouts and cardio sessions on the treadmill.\n⊕ Twitter integration that enables you to tweet your hike data to friends and family.\n⊕ Now with Bluetooth Smart support: Monitor your heart rate during workouts and track results over time \n\nNOTE: Continued use of GPS running in the background can dramatically decrease battery life.\n\nGET MVP FOR PREMIUM FEATURES\nGain access to exclusive features with MVP from just USD 2.50 monthly.\n\n⊕ Reach your fitness goals with personal training plans\n⊕ Route Genius gives you route recommendations for any distance,  starting from your current location\n⊕ Customized audio coaching tells you real-time workout details as you move\n⊕ Share your real-time location with family and friends using Live Tracking\n⊕ Analyze heart rate data for every workout (requires compatible HR monitor)\n⊕ Enjoy an ad-free experience\n\nShould you choose to upgrade to MVP, payment will be charged to your iTunes account at confirmation of purchase. The monthly subscription costs USD 5.99 per month while the yearly subscription costs USD 29.99 per year or USD 2.50 per month. Subscription renews automatically unless cancelled at least 24 hours prior to the end of the current period. There is no increase in cost when renewing. \n\nSubscriptions can be managed and auto-renewal turned off in Account Settings in iTunes after purchase. Once purchased, the current period can not be cancelled. Any unused portion of a free trial period is forfeited if you choose to purchase a subscription to MVP. \n\nFind the full terms and conditions, and our privacy policy, at http://www.mapmyhike.com/terms_of_use  and http://about.mapmyfitness.com/about/user-privacy-policy/  respectively.", "artistName": "MapMyFitness", "artworkUrl512": "http://a27.phobos.apple.com/us/r30/Purple1/v4/d6/be/6f/d6be6fea-7cdb-7f43-05a3-f29bed7bcb2b/pr_source.png?downloadKey=1417126343_5a41366b5f504cc862c2c4aa6490c3de", "version": "5.7", "primaryGenreId": 6010, "primaryGenreName": "Navigation", "fileSizeBytes": "34175839", "price": 0.0, "isGameCenterEnabled": false, "trackCensoredName": "MapMyHike GPS Hiking", "genreIds": ["6010", "6013"], "trackName": "MapMyHike GPS Hiking", "releaseNotes": "• Feature optimizations\n• Bug fixes", "sellerUrl": "http://www.mapmyhike.com", "screenshotUrls": ["http://a5.mzstatic.com/us/r30/Purple5/v4/3a/10/81/3a1081dd-54f2-3d85-b341-036ac5a946e6/screen1136x1136.jpeg", "http://a2.mzstatic.com/us/r30/Purple1/v4/c4/95/c2/c495c22c-a976-a285-6f0a-ada1dc1cde1f/screen1136x1136.jpeg", "http://a4.mzstatic.com/us/r30/Purple5/v4/b6/a6/35/b6a63509-f3cc-ce88-73ca-be23159cb0a7/screen1136x1136.jpeg", "http://a2.mzstatic.com/us/r30/Purple5/v4/0c/61/dd/0c61dde3-085d-09ab-287e-d4f18badd045/screen1136x1136.jpeg", "http://a4.mzstatic.com/us/r30/Purple1/v4/88/96/9d/88969d4c-b64a-fb23-78a6-61dc223fa960/screen1136x1136.jpeg"], "userRatingCount": 2874, "trackContentRating": "4+", "formattedPrice": "Free", "artistViewUrl": "https://itunes.apple.com/us/artist/mapmyfitness/id291890423?uo=4", "kind": "software", "averageUserRatingForCurrentVersion": 4.5, "sellerName": "MapMyFitness", "supportedDevices": ["iPad23G", "iPodTouchFifthGen", "iPhone5", "iPadFourthGen", "iPhone4S", "iPadThirdGen", "iPadMini", "iPad2Wifi", "iPadFourthGen4G", "iPhone5s", "iPadThirdGen4G", "iPadMini4G", "iPhone4", "iPhone5c"], "artworkUrl100": "http://a27.phobos.apple.com/us/r30/Purple1/v4/d6/be/6f/d6be6fea-7cdb-7f43-05a3-f29bed7bcb2b/pr_source.png?downloadKey=1417126343_5a41366b5f504cc862c2c4aa6490c3de", "bundleId": "Q5AWL8WCY6.iMapMyHike", "trackViewUrl": "https://itunes.apple.com/us/app/mapmyhike-gps-hiking/id307861852?mt=8&uo=4", "minimumOsVersion": "7.0", "artworkUrl60": "http://a570.phobos.apple.com/us/r30/Purple3/v4/f8/31/d2/f831d211-e09e-4c43-192e-aa9e4c26ede1/MapMyHike_App_Icons57x57.png", "averageUserRating": 4.0}