{"contentAdvisoryRating": "4+", "features": [], "languageCodesISO2A": ["AR", "DA", "NL", "EN", "FR", "DE", "IT", "JA", "PT", "ZH", "ES", "ZH"], "ipadScreenshotUrls": [], "releaseDate": "2011-04-29T23:39:19Z", "currency": "USD", "artistId": 291890423, "userRatingCountForCurrentVersion": 1013, "wrapperType": "software", "advisories": [], "genres": ["Lifestyle", "Health & Fitness"], "trackId": 307861492, "description": "As featured by Dr. Oz - turn your iPhone into a walk tracking pedometer. Easily track route, pace, calories, distance, time with audio.\n\n-“Really helps me keep on track with building my walking up. Fun to see the journey and wonderful to see the miles totting up. Great incentive. ++++”\n– Diana L.\n\nFriendly, simple to use tracking tools to motivate walkers and help improve activity levels.  Weight loss and social tools for those who want them.\n\nTrack walking, cycling, running and over 600 types of other activities with:\n⊕ Pace (Avg, Max, Current)\n⊕ GPS Route Mapping\n⊕ Distance\n⊕ Calorie counting\n⊕ Elevation profile\n⊕ Route navigation\n⊕ Nutrition, food, diet, and weight tracking\n⊕ Real-time Stats (avg, min, max) during workout\n⊕ Voice prompts that give you updates on your progress as you go!\n⊕ Sync with heart rate, speed, cadence and power sensors from CycleOps, Wahoo, Polar, Garmin and others (Bluetooth Smart™ and ANT+™)\n⊕ Compete on local Courses: receive automatic achievements and overall rank on Leaderboards for popular local runs and rides.\n⊕ Tracks in the background so you can listen to music, take calls, and use any other feature of your phone, while still tracking\n\nBragging (optional!):\n⊕ Post your workouts to Facebook and Twitter, or keep every thing completely private\n\nVisit www.MapMyWalk.com to:\n\n⊕ Search the world’s largest database of cycling, running, walking routes.\n\n⊕ Join sponsored challenges and WIN PRIZES (i.e. trips and shoes) just for walking.\n\n⊕ Sync devices like CycleOps Joule, PowerTap, Fitbit, Nike+, Garmin, Polar, Timex, Magellan. Works with Magellan Echo smart sports watch.\n\n\n--\nGreat for tracking any of the following activities: running, cycling, cardio, jogging, walking, weight lifting, dog walking, cross country skiing, unicycling, downhill skiing, snowboarding, gym workouts, weight lifting, basketball, soccer, hockey, yard work, yoga, p90x, crossfit, insanity, interval training, hill runs, rock climing, hiking, mountain biking, road cycling, dance, inline skating, barbell curls, cross training, spinning, roller skating, endurance training, kayaking, horseback riding, rowing machine, elliptical, resistance, commuting, skateboarding, rollerblading, stairs, abs, sprints, golf, lap swimming, open water swimming, triathalon, track & field, group runs, treadmill, stairmaster, weight machines , trail runs, cross country running, and any outdoor activity \n\n--\n\nNOTE: Continued use of GPS running in the background can dramatically decrease battery life.\n\nGET MVP FOR PREMIUM FEATURES \nGain access to exclusive features with MVP from just USD 2.50 monthly. \n\n⊕ Reach your fitness goals with personal training plans \n⊕ Route Genius gives you route recommendations for any distance, starting from your current location \n⊕ Customized audio coaching tells you real-time workout details as you move \n⊕ Share your real-time location with family and friends using Live Tracking \n⊕ Analyze heart rate data for every workout (requires compatible HR monitor) \n⊕ Enjoy an ad-free experience \n\nShould you choose to upgrade to MVP, payment will be charged to your iTunes account at confirmation of purchase. The monthly subscription costs USD 5.99 per month while the yearly subscription costs USD 29.99 per year or USD 2.50 per month. Subscription renews automatically unless cancelled at least 24 hours prior to the end of the current period. There is no increase in cost when renewing. \n\nSubscriptions can be managed and auto-renewal turned off in Account Settings in iTunes after purchase. Once purchased, the current period can not be cancelled. Any unused portion of a free trial period is forfeited if you choose to purchase a subscription to MVP. \n\nFind the full terms and conditions, and our privacy policy, at http://www.mapmywalk.com/terms_of_use and http://about.mapmyfitness.com/about/user-privacy-policy/ respectively.", "artistName": "MapMyFitness", "artworkUrl512": "http://a447.phobos.apple.com/us/r30/Purple5/v4/f8/82/1c/f8821c5e-6f5c-373e-139e-c514c2e03898/mzl.wwqwdgjl.png", "version": "5.6.3", "primaryGenreId": 6012, "primaryGenreName": "Lifestyle", "fileSizeBytes": "34411595", "price": 0.0, "isGameCenterEnabled": false, "trackCensoredName": "Walk with Map My Walk - GPS Walking, Jogging, Running, Workout Tracking for Diet Weight Loss", "genreIds": ["6012", "6013"], "trackName": "Walk with Map My Walk - GPS Walking, Jogging, Running, Workout Tracking for Diet Weight Loss", "releaseNotes": "• Enhanced auto-layout design\n• Minor bug fixes", "sellerUrl": "http://www.mapmywalk.com", "screenshotUrls": ["http://a1.mzstatic.com/us/r30/Purple4/v4/4d/0e/58/4d0e58df-2557-99f9-7c5b-feedffb564f2/screen1136x1136.jpeg", "http://a4.mzstatic.com/us/r30/Purple4/v4/d6/34/55/d6345572-338e-2032-514e-a64582bc4b28/screen1136x1136.jpeg", "http://a1.mzstatic.com/us/r30/Purple5/v4/cf/35/da/cf35dad4-66f0-b891-23b5-dc48d1ebae95/screen1136x1136.jpeg", "http://a4.mzstatic.com/us/r30/Purple5/v4/ab/59/3c/ab593c46-759c-d382-c8a4-19373737d446/screen1136x1136.jpeg", "http://a5.mzstatic.com/us/r30/Purple4/v4/20/05/c4/2005c4e7-9039-edf4-3eaf-a216bd217282/screen1136x1136.jpeg"], "userRatingCount": 31668, "trackContentRating": "4+", "formattedPrice": "Free", "artistViewUrl": "https://itunes.apple.com/us/artist/mapmyfitness/id291890423?uo=4", "kind": "software", "averageUserRatingForCurrentVersion": 4.5, "sellerName": "MapMyFitness", "supportedDevices": ["iPadMini", "iPhone4S", "iPad23G", "iPhone5", "iPadThirdGen", "iPadFourthGen4G", "iPodTouchFifthGen", "iPad2Wifi", "iPadMini4G", "iPhone4", "iPadFourthGen", "iPadThirdGen4G", "iPhone5s", "iPhone5c"], "artworkUrl100": "http://a447.phobos.apple.com/us/r30/Purple5/v4/f8/82/1c/f8821c5e-6f5c-373e-139e-c514c2e03898/mzl.wwqwdgjl.png", "bundleId": "Q5AWL8WCY6.iMapMyWalkFree", "trackViewUrl": "https://itunes.apple.com/us/app/walk-map-my-walk-gps-walking/id307861492?mt=8&uo=4", "minimumOsVersion": "7.0", "artworkUrl60": "http://a1477.phobos.apple.com/us/r30/Purple3/v4/b6/6a/12/b66a121d-2ea1-2250-96c0-0925bda78831/MapMyWalk_App_Icons57x57.png", "averageUserRating": 4.5}