{"contentAdvisoryRating": "17+", "features": ["iosUniversal"], "languageCodesISO2A": ["EN"], "ipadScreenshotUrls": ["http://a5.mzstatic.com/us/r30/Purple/v4/e2/23/c0/e223c051-fb73-8842-8970-d71d2f25feb5/screen480x480.jpeg", "http://a5.mzstatic.com/us/r30/Purple/v4/c5/de/1d/c5de1d3c-5897-496d-5c7b-8000704cfc14/screen480x480.jpeg", "http://a4.mzstatic.com/us/r30/Purple/v4/e3/09/57/e30957e5-6256-63ff-5979-0c87b85cbfda/screen480x480.jpeg", "http://a2.mzstatic.com/us/r30/Purple6/v4/fb/0c/d6/fb0cd634-a134-5365-c2ad-ab8da276e777/screen480x480.jpeg"], "releaseDate": "2009-03-27T02:08:20Z", "currency": "USD", "artistId": 307930481, "userRatingCountForCurrentVersion": 13, "wrapperType": "software", "advisories": ["Infrequent/Mild Sexual Content and Nudity", "Infrequent/Mild Profanity or Crude Humor", "Frequent/Intense Mature/Suggestive Themes"], "genres": ["Lifestyle", "Social Networking"], "trackId": 307930478, "description": "As seen on: Huffington Post, Buzzfeed, Yahoo! News Washington Post, NY Post, LA Times, Mail Online, Daily Telegraph, NPR, Wall Street Journal, Cosmo, Glamour, Women's Health Magazine, Business Insider, USA Today, & Vanity Fair\n \nDating made simple.  An easy-to-use mobile dating Facebook app specifically made for grown-up singles has finally been made by AYI - Are You Interested?  See who likes you now! \n \nTry for free the only online dating app made specifically for adult singles that is fully integrated with Facebook.  It is free to browse and upload photos, free to see who likes you, and free to see who messaged you.  \n\nLooking for an easy mobile dating app?  Use AYI to chat, flirt, date or just to meet singles.  AYI is one of the largest mobile dating apps on Facebook with millions of active singles and over 70 million Facebook installs.\n\nAYI (AreYouInterested) makes it fun and easy for mature grown-ups to chat, date, and meet new people whether you are divorced, separated, a single parent, or have never been married. \n \nWith over 2 million active singles looking to date, AYI is an online community where you can meet and chat with thousands of singles in real-time, and connect with others over similar interests and mutual friends! \n\n\n* 100% free to download and see which singles like you! \n* Browse photos of local singles and connect with people you like \n* Thousands of single people online to chat with now\n* Discover new singles close by with mutual interests and mutual friends! \n* Register in seconds with Facebook or your e-mail address, and sync your Facebook account to easily build your profile. \n\nAYI.com also makes it simple to meet singles with common interests along with friends in your area. View mutual friends of potential dates. \n \nUse our advanced search to meet singles with similar interests and religions such as running, cooking, sports, jogging, country music, wine, reading, photography, hiking, movies, Turner Classic Movies, AARP, gardening, and camping.  Even find singles who like your favorite music groups including Pink Floyd and The Rolling Stones. \n\nAYI.com has singles from all over the world.  AYI has thousands of singles in our largest cities including New York, Boston, Los Angeles, Houston, Philadelphia, Seattle, Dallas, Chicago, London, Dublin, Liverpool, Leeds, Birmingham, Sheffield, Manchester, Sydney, Brisbane, Melbourne, Perth, Adelaide Montreal, Toronto, Helsinki, Stockholm, Copenhagen, and Tel Aviv.\n \nHear what our users are saying! \n\n\"It's the best app for finding friends or even a girlfriend.\" \n\"I love this app. It's really connected me where other one's haven't.\" \n\"I love meeting and socializing with people. A great way to chat and explore who you like.\" \n\"Thanks to this app I found my love. So happy now.\" \n \nTo access some advanced features, AYI subscriptions are available in 1 month, 3 month, and 6 month packages. Note that with all subscription \n \n- Payment will be charged to iTunes Account at confirmation of purchase \n- Subscriptions automatically renew unless the auto-renew is turned off at least 24 hours before the end of your current period. \n- Accounts will be charged for renewal within 24 hours prior to the end of the current period \n- Subscriptions may be managed by the user and auto-renewal may be turned off by going to the user's account settings after purchase \n- No cancellation of the current subscription is allowed during the active subscription period \n\nPrivacy policy can be found at: http://snap-interactive.com/privacy \n\nTerms of service are here: \nhttp://www.snap-interactive.com/tos \n\nAreYouInterested.com is owned and created by SNAP Interactive, Inc. SNAP Interactive develops, owns and operates online dating and social networking applications for social networking websites and mobile platforms. \n\nWE LOVE YOUR FEEDBACK ON ARE YOU INTERESTED: \nWebsite: www.ayi.com \nSNAP Interactive: www.snap-interactive.com \nTwitter: @AYI \nFacebook: https://www.facebook.com/AYI", "artistName": "SNAP Interactive, Inc.", "artworkUrl512": "http://a1357.phobos.apple.com/us/r30/Purple5/v4/ab/6a/6e/ab6a6e41-2eb5-ddb8-5fc3-7d9e5059cc8d/mzl.bhdcsisv.png", "version": "6.6.1", "primaryGenreId": 6012, "primaryGenreName": "Lifestyle", "fileSizeBytes": "7597377", "price": 0.0, "isGameCenterEnabled": false, "trackCensoredName": "AYI - Dating App for Adult Singles", "genreIds": ["6012", "6005"], "trackName": "AYI - Dating App for Adult Singles", "releaseNotes": "- Various bug fixes and performance improvements.", "sellerUrl": "http://www.snap-interactive.com/", "screenshotUrls": ["http://a1.mzstatic.com/us/r30/Purple/v4/d1/76/8b/d1768bba-92f4-fe4b-025f-71da86fa613d/screen1136x1136.jpeg", "http://a5.mzstatic.com/us/r30/Purple6/v4/97/78/85/977885e5-184a-6cf1-efc0-715a1a6b10e9/screen1136x1136.jpeg", "http://a5.mzstatic.com/us/r30/Purple6/v4/1e/63/8a/1e638a5f-c6c9-b3fd-0720-1d2614f25358/screen1136x1136.jpeg", "http://a4.mzstatic.com/us/r30/Purple6/v4/33/e5/8f/33e58f7f-bf39-dcbf-a9fb-aef42e9672b5/screen1136x1136.jpeg", "http://a2.mzstatic.com/us/r30/Purple/v4/fc/a5/2e/fca52e6c-dbda-8286-0e70-9951e5e8b1f4/screen1136x1136.jpeg"], "userRatingCount": 13087, "trackContentRating": "17+", "formattedPrice": "Free", "artistViewUrl": "https://itunes.apple.com/us/artist/snap-interactive-inc./id307930481?uo=4", "kind": "software", "averageUserRatingForCurrentVersion": 2.5, "sellerName": "SNAP Interactive, Inc.", "supportedDevices": ["iPhone-3GS", "iPadMini", "iPadFourthGen", "iPhone5s", "iPhone4", "iPhone4S", "iPadThirdGen4G", "iPadMini4G", "iPhone5c", "iPodTouchFifthGen", "iPad2Wifi", "iPhone5", "iPodTouchourthGen", "iPad23G", "iPadThirdGen", "iPadFourthGen4G"], "artworkUrl100": "http://a1357.phobos.apple.com/us/r30/Purple5/v4/ab/6a/6e/ab6a6e41-2eb5-ddb8-5fc3-7d9e5059cc8d/mzl.bhdcsisv.png", "bundleId": "com.snap-interactive.AreYouInterested", "trackViewUrl": "https://itunes.apple.com/us/app/ayi-dating-app-for-adult-singles/id307930478?mt=8&uo=4", "minimumOsVersion": "6.0", "artworkUrl60": "http://a1026.phobos.apple.com/us/r30/Purple5/v4/8b/38/09/8b3809d4-a774-9d2f-0d0b-1c4a3a30f0fd/AppIcon57x57.png", "averageUserRating": 3.0}