{"contentAdvisoryRating": "4+", "features": [], "languageCodesISO2A": ["EN"], "ipadScreenshotUrls": [], "releaseDate": "2009-07-07T07:00:00Z", "currency": "USD", "artistId": 320946373, "userRatingCountForCurrentVersion": 69, "wrapperType": "software", "advisories": [], "genres": ["Navigation", "Utilities"], "trackId": 320946370, "description": "CONGRATULATIONS, you've found it -- the best NYC subway app!  Exit Strategy NYC features the official MTA subway, bus, and street maps.  PLUS comprehensive 'exit strategies' for each subway station that LITERALLY shave minutes off every trip. It's an unbeatable combination...and all cheaper than a roundtrip subway ride!\n\nExit Strategy NYC has been praised by NY Times, NY Post, NY Mag, Gizmodo, Wired and more.  Try it and you'll quickly see why it's a MUST-HAVE for New Yorkers & savvy New York visitors. \n\n=======================================\nFull Description:\nNo more unfolding those huge awkward paper maps and looking like a tourist (even if you are one!)  And no more trying to read that map on the train that always has someone's head blocking it!  Put the subway map in your pocket!\n\nWAIT...there's more!\n\nKnow those amazing MTA neighborhood maps in each subway station?  We've got 'em!  We wove them together into a giant quilt-like STREET MAP!  Just tap a station to see a detailed map of the surrounding area (works for all stops in Manhattan and selected outer borough neighborhoods). The map even has ADDRESS RANGES to help you figure out cross streets! \n\nWe've also included BUS MAPS for ALL FIVE boroughs to help you when the subway can't.  No other app has these!\n\nAdditionally, our street maps show exactly where the ENTRANCES of each station are located at street level, getting you into and out of stations faster.  Trying to figure out where an alternate entrance to the West 4th Street station is?  Just check the map!  We like to call it 'Enter Strategy'.  \n\nLastly, the core feature that made Exit Strategy famous:\n\nEver gotten off the train and realized the staircase was at the FAR other end of the platform?  As you make that looooong walk of shame, you're thinking 'If only I had known..I could have saved myself minutes!'  Well, Exit Strategy NYC is that guide!   You'll exactly where to stand on the train (ie '3rd car, 2nd door).  Imagine pulling into each subway station DIRECTLY in front of the exit.  Imagine being the FIRST person out every time! We even show you which side of the train the doors open on! \n\nDetailed diagrams eliminate the guesswork and frustration from your ride, making your subway trip easier and faster.  Version 2.0 covers ALL stations in NYC, so you can shave minutes off EVERY trip you take!  \n\nNO PHONE SERVICE or INTERNET CONNECTION required, so you can use it on the subway!  This app will quickly take a spot on your phone's home screen (and a spot in your heart).  You'll wonder how you ever lived without it!  \n\nPlease visit www.ExitStrategyNYC.com\n\n\nSummary of Features:\n- Official MTA subway map (zoomable, scrollable and interactive!)\n- Official MTA Bus Maps for all five boroughs\n- Comprehensive MAP OF MANHATTAN showing address ranges and popular destinations created from the official MTA Neighborhood Maps.  (Works offline when other map apps don't!)\n- Exit Strategy diagrams help you plan where to stand (\"Should I be at the front or back of train?\"). Literally shaves minutes off every trip!\n- Diagrams include locations of exits, transfer spots, and elevators, in most cases down to the optimal DOOR!\n- Diagrams show the hours for exits that close. \n-NO PHONE SERVICE OR INTERNET CONNECTION REQUIRED; use it on the subway!\n=======================================\n\n(Neighborhood maps include Manhattan, Downtown Brooklyn, Park Slope, Williamsburg, Long Island City, and Jackson Heights)\n\n(Want subway directions?  The pre-installed Google 'Maps' app gives point-to-point transit subway and bus directions with schedule information too!!)\n\nAll subway, bus, and street maps are property of the MTA.", "artistName": "JWeg Ventures LLC", "artworkUrl512": "http://a1075.phobos.apple.com/us/r30/Purple4/v4/20/ac/7f/20ac7f14-98c4-6856-b4e0-b1e5a9a7072c/mzl.rgvjzhlv.png", "version": "2.5", "primaryGenreId": 6010, "primaryGenreName": "Navigation", "fileSizeBytes": "209314439", "price": 3.99, "isGameCenterEnabled": false, "trackCensoredName": "Exit Strategy NYC Subway Map", "genreIds": ["6010", "6002"], "trackName": "Exit Strategy NYC Subway Map", "releaseNotes": "Just in time for the holidays, an updated Exit Strategy!\n\n-Retina subway map and station diagrams (Whooop!)\n-Support for the iPhone 5's taller screen (Yeeeeehaw!)\n-Fixed the double-tap to zoom bug (Yippeeeee!)\n-Barclays Center, Bleecker St and lots of other station diagrams updated (Amaaaazing!)\n-Updated all maps to the latest ones available from the MTA (Huzzahhhh!)\n\nMore updates coming soon!", "sellerUrl": "http://www.exitstrategynyc.com", "screenshotUrls": ["http://a2.mzstatic.com/us/r30/Purple/v4/37/ea/02/37ea0299-b3db-8666-5138-34aa20a979b6/screen568x568.jpeg", "http://a1.mzstatic.com/us/r30/Purple/v4/84/c5/f2/84c5f229-66b1-ca9e-a86f-82d35f69f7ba/screen568x568.jpeg", "http://a5.mzstatic.com/us/r30/Purple6/v4/03/6b/64/036b6444-58b5-7847-56af-63be9117f4bc/screen568x568.jpeg", "http://a1.mzstatic.com/us/r30/Purple4/v4/fb/43/b8/fb43b88e-3503-98a4-e11c-9b25af5d3c5e/screen568x568.jpeg", "http://a3.mzstatic.com/us/r30/Purple6/v4/7b/10/43/7b104362-3eb8-b7f0-8fa5-81d33bec3c0c/screen568x568.jpeg"], "userRatingCount": 780, "trackContentRating": "4+", "formattedPrice": "$3.99", "artistViewUrl": "https://itunes.apple.com/us/artist/jweg-ventures-llc/id320946373?uo=4", "kind": "software", "averageUserRatingForCurrentVersion": 3.0, "sellerName": "JWeg Ventures, LLC", "supportedDevices": ["iPadThirdGen", "iPadMini4G", "iPhone5c", "iPodTouchFifthGen", "iPad2Wifi", "iPadFourthGen4G", "iPhone5s", "iPhone4S", "iPadFourthGen", "iPad23G", "iPadThirdGen4G", "iPadMini", "iPhone5", "iPhone4"], "artworkUrl100": "http://a1075.phobos.apple.com/us/r30/Purple4/v4/20/ac/7f/20ac7f14-98c4-6856-b4e0-b1e5a9a7072c/mzl.rgvjzhlv.png", "bundleId": "com.jwegventures.exitstrategy", "trackViewUrl": "https://itunes.apple.com/us/app/exit-strategy-nyc-subway-map/id320946370?mt=8&uo=4", "minimumOsVersion": "7.0", "artworkUrl60": "http://a78.phobos.apple.com/us/r30/Purple/v4/dd/10/b4/dd10b42b-089b-e4ca-cc33-6b421a342632/icon57.png", "averageUserRating": 3.5}