{"contentAdvisoryRating": "4+", "features": [], "languageCodesISO2A": ["EN"], "ipadScreenshotUrls": [], "releaseDate": "2009-07-13T05:02:44Z", "currency": "USD", "artistId": 321923937, "userRatingCountForCurrentVersion": 40, "wrapperType": "software", "advisories": [], "genres": ["Business", "Productivity"], "trackId": 321923934, "description": "Clock in and out as you work and watch as time accumulates and earnings grow. Easily review your past entries, grouped by day, week, month, or pay period. There’s no need to enter each pay period yourself – just set your pay schedule type and HoursTracker automatically calculates everything, even daily and weekly overtime earnings. Time entries are automatically created when you clock out. Or, add entries yourself in just a few quick taps. You can easily export your data by job, date, or selection. Choose to export as a text summary or in spreadsheet-ready CSV format.\n\n○ Apple says \"makes it easy to keep track of the hours spent on a project\" Featured on Apple.com!\n\n○ lifehacker says \"Best Time Tracking App for iPhone\"\n\nQuick and easy entry and editing makes time tracking painless, but advanced features and customization set HoursTracker above the rest: Automatic Overtime, Location Awareness, Tags and Filters, Expected Time Reached Alerts, and more.\n\nLOCATION AWARENESS\nChoose to receive notifications when you arrive or leave the area, or even let HoursTracker use your location to automatically record your time entries. Order your jobs list nearest-first to save scrolling. HoursTracker is crafted to deliver accurate results without draining your battery.\n\nCUSTOMIZE WITH TAGS AND FILTERS\nCreate tags and apply them to jobs and entries. Use Filters to control which jobs or entries are displayed. You define which tags each filter includes and excludes, then toggle Filters with a single tap.\n\nNO MORE WATCHING THE CLOCK\nHoursTracker can alert you when it’s time to go. Set up an expected number of hours per day, and you’ll get alerts as you approach those hours, even taking time rounding options into account. A notification fifteen minutes prior helps you get to a stopping point by quitting time.\n\nWith over 5,000 lifetime 5-star reviews and 5 years of service, you can be confident that HoursTracker can easily handle your time data with uncompromising performance and stability.\n\n○ Daily and weekly overtime with two thresholds and rates for each.\n\n○ Already working but forgot to clock in?  Use “Start Clock At...” and choose a time.\n\n○ Clock in to any number of jobs at a time, or change a preference and you’ll be clocked out automatically when you clock in to another job.\n\n○ Add comments, assign a special hourly rate for just one entry, and easily subtract breaks.\n\n○ Enter time manually by choosing just choose a start time and then either the end time or the duration, whichever is easier for you.\n\n○ Flexible rounding options to automatically round your time worked can be configured per-job.\n\n○ View your time and earnings by day, or by calendar week or month, or by job, on the Entries tab. Customize the day the calendar week begins on.\n\n○ Set up pay period details and view your time by weekly, bi-weekly, semi-monthly, or monthly pay period on the Pay Periods tab.\n\n○ Easily copy a job to save time.\n\n○ Tagging and filtering let you build custom views of your data. \n\n○ Passcode lock lets you keep your HoursTracker data private.\n\n○ Have a lot of jobs?  For 15+ jobs, HoursTracker will show an A-Z index, just like the Contacts app, to help you quickly find the right job.\n\n○ Export data via e-mail in text or CSV formats in the message body or attachment.\n\n○ Respects your device’s international settings.\n\nCloud data backup/restore included free (registration required). Background backups and web access available with subscription purchase. iTunes File Sharing also enabled for backup/restore.\n\nMake the most out of HoursTracker by setting up your preferences in the app. Visit our website at http://www.hourstrackerapp.com\n\nJoin us at facebook.com/HoursTracker. For support, use the Get Help button in the app (in the More tab). We cannot respond to app reviews.", "artistName": "Carlos Ribas", "artworkUrl512": "http://a752.phobos.apple.com/us/r30/Purple3/v4/9e/c0/40/9ec040d7-07bb-0534-bd6f-b19861c7ae2b/mzl.rekqnith.png", "version": "3.0.2", "primaryGenreId": 6000, "primaryGenreName": "Business", "fileSizeBytes": "3503491", "price": 8.99, "isGameCenterEnabled": false, "trackCensoredName": "HoursTracker Pro: Timesheet & Time Tracker with GPS", "genreIds": ["6000", "6007"], "trackName": "HoursTracker Pro: Timesheet & Time Tracker with GPS", "releaseNotes": "TODAY WIDGET SETTINGS\nWidget settings are available in Preferences. You can now hide the settings icon in the Today view.\n\nSCROLL TO TOP SHORTCUT\nTap the already-selected tab to quickly scroll to the top. You can tap the status bar as well.\n\nICON BADGING FIXES\nWe have found a way to restore the old icon badging behavior. Thanks you for the feedback.\n\nBUGS, BE GONE!\nFixed time calculation issue on Stop Clock At screen, some freezes, and other minor bugs.", "sellerUrl": "http://www.hourstrackerapp.com/iPhone/?s=appstore", "screenshotUrls": ["http://a2.mzstatic.com/us/r30/Purple3/v4/07/cb/1c/07cb1c87-b521-4629-f793-7b3620ac3424/screen1136x1136.jpeg", "http://a2.mzstatic.com/us/r30/Purple3/v4/63/8f/95/638f9503-e868-d1f6-d9aa-7809ace8407a/screen1136x1136.jpeg", "http://a3.mzstatic.com/us/r30/Purple5/v4/89/db/1a/89db1a19-dfb8-ca68-74f8-ef1e0cf6fa35/screen1136x1136.jpeg", "http://a5.mzstatic.com/us/r30/Purple1/v4/3a/4c/2c/3a4c2c42-7462-7f00-349b-b75b79675f7e/screen1136x1136.jpeg", "http://a5.mzstatic.com/us/r30/Purple1/v4/ae/a3/33/aea33334-9d1e-9a96-88fd-c18ea6fc534f/screen1136x1136.jpeg"], "userRatingCount": 4226, "trackContentRating": "4+", "formattedPrice": "$8.99", "artistViewUrl": "https://itunes.apple.com/us/artist/carlos-ribas/id321923937?uo=4", "kind": "software", "averageUserRatingForCurrentVersion": 5.0, "sellerName": "Carlos Ribas", "supportedDevices": ["iPhone4S", "iPhone4", "iPadFourthGen4G", "iPad2Wifi", "iPad23G", "iPadThirdGen", "iPadThirdGen4G", "iPadMini4G", "iPodTouchFifthGen", "iPhone5c", "iPhone5", "iPadFourthGen", "iPadMini", "iPhone5s"], "artworkUrl100": "http://a752.phobos.apple.com/us/r30/Purple3/v4/9e/c0/40/9ec040d7-07bb-0534-bd6f-b19861c7ae2b/mzl.rekqnith.png", "bundleId": "com.carlosribas.HoursTracker", "trackViewUrl": "https://itunes.apple.com/us/app/hourstracker-pro-timesheet/id321923934?mt=8&uo=4", "minimumOsVersion": "7.0", "artworkUrl60": "http://a993.phobos.apple.com/us/r30/Purple3/v4/8e/47/42/8e474265-4e36-7bbe-22a6-42fe4fd72adb/AppIcon60x60_U00402x.png", "averageUserRating": 4.5}