{"contentAdvisoryRating": "4+", "features": [], "languageCodesISO2A": ["EN", "FR", "DE", "IT", "JA", "KO", "PT", "ZH", "ES", "ZH"], "ipadScreenshotUrls": [], "releaseDate": "2010-06-07T01:36:13Z", "currency": "USD", "artistId": 325758143, "userRatingCountForCurrentVersion": 298, "wrapperType": "software", "advisories": [], "genres": ["Photo & Video", "Social Networking"], "trackId": 329670577, "description": "Over 10 million sold!\n\n“The Clarity filter is iPhone photography’s secret sauce—it adds pro-camera crispness to almost any shot.”\n— Kevin Sintumuang, The Wall Street Journal\n\n“If the iPhone’s standard camera is like a digital point-and-shoot, the Camera+ app is like a high-quality SLR lens.”\n— TIME: 50 Best iPhone Apps 2011\n\n“improves on almost every aspect of the built-in camera app”\n— Charlie Sorrel, Wired\n\n“tap tap tap definitely has a winner on their hands with Camera+”\n— Steven Sande, The Unofficial Apple Weblog\n\nWinner: Best Visual Design, Best Photography App\n— Best App Ever Awards\n\n\nIt’s all about one thing... great photos!\n\nWhether you’re a seasoned photographer or someone who’s barely touched a camera, Camera+ will make you love taking photos.\n\nTouch Exposure & Focus\nSet exposure separately from focus. You can now easily control how light or dark your shots come out.\n\nShooting Modes\nUse the Stabilizer to steady your iPhone and get the sharpest photos you can. There are countless uses for the Timer including taking the highest-quailty self-portraits. Capture all the action by using Burst to take rapid streams of shots.\n\nDigital Zoom\nUp to 6× zoom with advanced digital processing provides you with quality that simply blows away the competition.\n\nFront Flash\nHow many times have you wanted to take a pic of yourself in a dark room but couldn’t. Well, now you can!\n\nHorizon Level\nUse the Horizon Level to eliminate taking crooked shots.\n\nClarity\nClarity is one of the biggest breakthroughs to happen to image processing in a long time. Clarity analyzes your photos and makes several intelligent adjustments that magically bring out details and breathe life into dull photos. With Clarity, you’ll stop throwing out bad photos… you’ll be amazed to see what it can do to photos that you’d typically consider unusable, like shots that came out too dark.\n\nScene Modes\nMost modern digital cameras all have scene modes to help you get the best photos for your particular situation. With Camera+, you get to choose from several scene modes including Food, Sunset, Night, Portrait, Beach, and many more.\n\nEffects\nProfessional photographer, Lisa Bettany created a slew of stunningly beautiful effects. Make your photos shimmer with “HDR”… get down and dirty with “Grunge”… fill your pics with emotion and despair with “So Emo”. And this is just the tip of the iceberg… there are dozens of 1-touch effects for you to experiment with.\n\nLightbox\nAll the pics you take in Camera+ go in the innovative Lightbox where you can quickly and easily skim through them and get rid of bad shots. You save only the photos you’re satisfied with so that your camera roll stays neat and clean.\n\nSharing\nWhether you want to show your results to your friends and family or the whole world, Camera+ has got you covered. Proudly share your photos on Facebook, Twitter, and Flickr. Or go the more personal route and email or message them from right within the app.\n\niCloud Lightbox sync\nAutomatically sync your Camera+ photos between all of your devices. Shoot all day on your iPhone… and then edit at night on your iPad. \n\nCrops\nIf you didn’t line-up your shot perfectly when you took it, you can easily fix that with Camera+. And when you want to get a bit creative, we setup a bunch of popular crop sizes for you. With a single tap, you can make your pics square, 4×6, 8×10, and more.\n\nBorders\nWith Camera+ you get several great border designs, from simple black and white borders to more gritty designs, you’ll be able to add wonderful finishing touches.\n\nCaptions\nHave some fun with your photos by putting captions on them. It’s a great way to really personalize your favorite shots.", "artistName": "tap tap tap", "artworkUrl512": "http://a815.phobos.apple.com/us/r30/Purple3/v4/af/58/74/af587463-f6ee-1d82-a11e-bc3ca8feb18c/mzl.edlpwszd.png", "version": "6.1.1", "primaryGenreId": 6008, "primaryGenreName": "Photo & Video", "fileSizeBytes": "56322736", "price": 2.99, "isGameCenterEnabled": false, "trackCensoredName": "Camera+", "genreIds": ["6008", "6005"], "trackName": "Camera+", "releaseNotes": "EMERGENCY BUG FIX:\nThanks to all of the very diligent 1-star reviewers, we were quickly made aware of a few big bugs in Camera+ 6.1 and we worked our collective butt off to get them fixed ASAP, bringing you this 6.1.1 Update of Shame.\n\n\nWhat’s new in Camera+ 6.1: \n\nHello, everyone!\n\nIt’s been said that “you can please some of the people all of the time, you can please all of the people some of the time, but you can’t please all of the people all of the time”. Well, today, we’re very proud to continue with our mission of pleasing some of the people some of the time with this new release of Camera+!\n\nTo kick things off, we have a new Pro quality setting. For those of you who are willing to sacrifice your precious storage space for the sake of capturing and saving the absolute highest quality images you can get with your iPhone, this feature’s for you. With this setting, your photos are stored and processed in the TIFF format with lossless compression. Pro quality isn’t the kind of setting you’ll typically want to use all the time, but for those extra-special shots where you want the utmost in quality, this will definitely do the trick.\n\nNext up is a little enhancement that we’ve added to our innovative Front Flash. Before this update, you were limited to either having it on or off. But now in Camera+ 6.1, you also have an Auto setting for it so that you can let the little gnome that lives in your iPhone decide whether it should be on or off. Because gnomes know best. This, of course, leaves you with one less thing to think about when taking selfies so you can simply focus on doing your best pre-2014 Renée Zellweger impression. And yes, we want to see those, so please share!\n\nAnd lastly, this is for all of you who’ve left burning brown bags of unmentionables on our stoops for us killing iOS 7 support in Camera+ 6. You poomongers will be very happy to hear that version 6.1 works on iOS 7. Of course, you won’t have the benefit of being able to use the new manual camera controls, macro mode, and Photos extension that are only available on iOS 8, but those are just an OS upgrade away for you when you’re ready. We’ll wait patiently…\n\nThat’s it for now. We’ve got some big things coming down the pipeline for both this iPhone version of Camera+, along with a huge, long-overdue update for the iPad version. Have faith!\n\nLove,\nThe Camera+ Team", "sellerUrl": "http://taptaptap.com/camera+", "screenshotUrls": ["http://a4.mzstatic.com/us/r30/Purple1/v4/c3/88/b5/c388b571-4b1c-1bf5-3108-18d843551510/screen1136x1136.jpeg", "http://a4.mzstatic.com/us/r30/Purple1/v4/20/1a/01/201a01d3-8f18-7d1e-afe9-3a9129f9c4f1/screen1136x1136.jpeg", "http://a2.mzstatic.com/us/r30/Purple1/v4/7f/ae/72/7fae7258-8116-4f40-cb67-53f2c80a0d53/screen1136x1136.jpeg", "http://a5.mzstatic.com/us/r30/Purple1/v4/86/ed/62/86ed62cd-1744-230c-581b-2a106709af11/screen1136x1136.jpeg", "http://a4.mzstatic.com/us/r30/Purple3/v4/07/94/4e/07944e0d-506b-5e3c-624f-58c6ff3b0fbb/screen1136x1136.jpeg"], "userRatingCount": 30507, "trackContentRating": "4+", "formattedPrice": "$2.99", "artistViewUrl": "https://itunes.apple.com/us/artist/tap-tap-tap/id325758143?uo=4", "kind": "software", "averageUserRatingForCurrentVersion": 4.0, "sellerName": "tap tap tap LLC", "supportedDevices": ["iPadThirdGen", "iPodTouchFifthGen", "iPhone5", "iPhone5c", "iPad23G", "iPhone4", "iPadMini4G", "iPhone5s", "iPadThirdGen4G", "iPadFourthGen4G", "iPhone4S", "iPad2Wifi", "iPadFourthGen", "iPadMini"], "artworkUrl100": "http://a815.phobos.apple.com/us/r30/Purple3/v4/af/58/74/af587463-f6ee-1d82-a11e-bc3ca8feb18c/mzl.edlpwszd.png", "bundleId": "com.taptaptap.CameraPlus", "trackViewUrl": "https://itunes.apple.com/us/app/camera+/id329670577?mt=8&uo=4", "minimumOsVersion": "7.0", "artworkUrl60": "http://a738.phobos.apple.com/us/r30/Purple1/v4/79/0b/48/790b4803-8991-813a-c3db-8c53dab99da8/AppIcon60x60_U00402x.png", "averageUserRating": 4.0}