{"contentAdvisoryRating": "4+", "features": ["iosUniversal"], "languageCodesISO2A": ["EN"], "ipadScreenshotUrls": ["http://a4.mzstatic.com/us/r30/Purple3/v4/c6/be/59/c6be594f-0f20-8a63-fdf8-18f3e98f72bc/screen480x480.jpeg", "http://a4.mzstatic.com/us/r30/Purple4/v4/8e/2c/a2/8e2ca27e-fa0c-567f-7741-84ba02e2e79e/screen480x480.jpeg", "http://a3.mzstatic.com/us/r30/Purple1/v4/fe/5b/24/fe5b244a-a9df-f54b-e837-004e69550950/screen480x480.jpeg", "http://a5.mzstatic.com/us/r30/Purple3/v4/18/b2/16/18b2169e-66f5-cfe7-8278-97165cff3e29/screen480x480.jpeg", "http://a2.mzstatic.com/us/r30/Purple4/v4/e3/8d/16/e38d1639-e853-92ca-3da7-c68124b5e070/screen480x480.jpeg"], "releaseDate": "2009-12-16T17:38:35Z", "currency": "USD", "artistId": 283512699, "userRatingCountForCurrentVersion": 4, "wrapperType": "software", "advisories": [], "genres": ["Weather", "Navigation"], "trackId": 333252638, "description": "ForeFlight Mobile is the critically acclaimed flight planning, flight support, and electronic flight bag (\"EFB\") app for pilots. Navigation charts, Internet and in-flight weather, airport facility directory information, moving map, hazard and terrain awareness, aviation documents, and much more.\n\nBuilt with an attention to detail and backed by a dedicated, fanatical support team, ForeFlight is a best selling aviation app for iPad, iPhone, and iPod touch.\n\nContinued ForeFlight service requires a subscription, available via in-app purchase.\n\nContinued use of GPS running in the background can dramatically decrease battery life.\n\nREVIEWS AND PRAISE\n\n- Editor's Choice, Flying Magazine, January 2014\n- Editor's Choice, Flying Magazine, January 2013\n- Editor's Choice, Flying Magazine, January 2012\n- App of the Year, Aviation Consumer, July 2011\n\n- Best Selling iPad Aviation App: 2010, 2011, 2012, 2013\n\n- \"Best app for IFR\" - Aviation Consumer\n\n- \"One of the most popular and most-respected aviation apps available\" - Sporty's Pilot Shop, July 2010\n\nAIRPORT AND FACILITY DIRECTORY\n\nForeFlight's A/FD provides information about US and major international airports. Data is provided by government authorities, the AOPA, and Universal Weather and Aviation. Critical airport information is displayed elegantly and additionally provides METARs, TAFs, winds aloft, and NOTAMS.\n\nPLATES & CHARTS\n\nForeFlight provides access to US VFR and Terminal Area (TAC) charts; US and Canadian VNC/IFR en-route charts; area and gulf helicopter charts, and 15,000 US and 2,000 Canadian instrument procedures. En-route charts and over 12,000 terminal procedures are geo-referenced.\n\nWEATHER\n\nForeFlight's weather is best-in-class. 10 weather Slip Maps(TM) with route overlay, pinch and zoom support, and touch planning support deliver information about conditions along your route quickly and visually. In-flight weather is possible via Stratus ADS-B or XM. Maps include:\n\n- Flight rules\n- HD NEXRAD composite radar\n- Visible and IR satellite\n- Visibility\n- Lightning\n- Temp and dew-point spread\n- Sky coverage\n- Wind conditions\n- Global winds aloft\n\nTOUCH PLANNING & MOVING MAP\n\nPlan flights by touch to draw a route of flight, bend a route around weather, and add or drop waypoints. 'Direct To' functions get you where you want quickly.\n\nEngage the moving map and see your ship's position on top of en-route charts; use the customizable dashboard to display groundspeed and altitude, track, GPS accuracy, or one of 15 different instruments.\n\nAIRWAYS/SIDS/STARS\n\nForeFlight supports airways, SIDS, STARS, and providers cleared ATC routes. Use multi-runway SIDS, airway entrances/exits, intersections, airway identifiers, and even the most complex STARS.\n\nFUEL PRICES\n\nForeFlight provides fuel price information, visually color coded by price, for 2,300+ FBOs in Canada and the US. Pilots can also submit fuel price updates in-app.\n\nFLIGHT PLAN FILING\n\nFile flight plans from your iPhone or iPad and get confirmation in seconds. Copies are stored on our servers for safe-keeping; email confirmations and briefings are sent automatically.\n\nDOWNLOAD MANAGER\n\nSelect the regions and information you need. Download one area or the whole country from our highly reliable delivery network. Plate and chart volumes install in seconds.\n\nCOMMENTS\n\nSubmit comments directly from device, wherever you may be, and read comments from other pilots. You may just find a great place for fried pickles.\n\nCREDITS\n\n- Canadian radar coverage is provided by Environment Canada.\n- International A/FD provided by Universal Weather and Aviation.", "artistName": "ForeFlight", "artworkUrl512": "http://a138.phobos.apple.com/us/r30/Purple1/v4/1e/52/d7/1e52d751-df71-3698-1372-e7da24b824c8/mzl.arapriud.png", "version": "6.5", "primaryGenreId": 6001, "primaryGenreName": "Weather", "fileSizeBytes": "84165543", "price": 0.0, "isGameCenterEnabled": false, "trackCensoredName": "ForeFlight Mobile", "genreIds": ["6001", "6010"], "trackName": "ForeFlight Mobile", "releaseNotes": "Another great ForeFlight Mobile release including flight conditions monitoring, a new NOTAM Advisor, more FBO data, iPhone 6/6+ user interface optimizations, and more! Visit blog.foreflight.com to read all about it, then download the updated Pilot's Guide for more details.\n\nFLIGHT NOTIFICATIONS FOR WEATHER, FLIGHT INFORMATION\n\nForeFlight delivers a first in mobile flight planning capability: Flight Notifications. When you file a flight plan via ForeFlight, our systems monitor your flight, synthesize changes in flight conditions, and deliver notifications to all your devices when a change of significance is detected. For example, if a new AIRMET is detected up to and during your flight, you will receive a notification with a summary and detailed description of the condition. Since these flight notifications build upon ForeFlight Sync, all your devices are kept up to date with all notifications. With the introduction of Flight Notifications, ForeFlight is on a mission to make pilots more aware of changing conditions that affect their flight. Available to all ForeFlight Pro subscribers.\n\nNOTAM ADVISOR FOR INSTRUMENT PROCEDURES\n\nAnother first in mobile flight planning is NOTAM Advisor for Instrument Procedures. With this new feature, ForeFlight alerts you to any NOTAMS that affect or apply to the instrument procedure you are viewing. It is easy to miss procedure NOTAMS during flight planning (or in flight), and the new NOTAM Advisor will make you more aware of issues that may affect your flight plan. Be sure to Pack before every flight, as Pack will gather the NOTAMs used by the NOTAM Advisor. Use NOTAM Advisor and experience fewer NOTAM surprises! Available to all ForeFlight subscribers.\n\nAUTO-TAXI ON MAP\n\nWe previously released a feature that automatically displays the taxi diagram when you land at an airport and speed drops below 40kts. With this enhancement to auto-taxi, you have the option of having the taxi diagram automatically appear on the map. Enable this via the Settings view within ForeFlight Mobile. Requires a ForeFlight Pro subscription.\n\nEXPANDED FBO AND BUSINESS INFORMATION\n\nWith this release, we greatly expanded the FBO and other business information available via ForeFlight. You will now see more hotel, dining, transportation, and attraction information via ForeFlight, making it an expansive directory of information and services available to pilots. Available to all ForeFlight subscribers.\n\n- Additional improvements and fixes:\n- iOS 8.1 support\n- iPhone 6 and 6+ larger screen support\n- A new source of up to date airport services information\n- A few new helper messages when filing flight plans\n- Many performance improvements and other bug fixes", "sellerUrl": "http://www.foreflight.com/mobile", "screenshotUrls": ["http://a4.mzstatic.com/us/r30/Purple3/v4/d9/da/4b/d9da4baf-d672-3c8e-967d-1a2a8a70f959/screen1136x1136.jpeg", "http://a3.mzstatic.com/us/r30/Purple4/v4/1b/51/87/1b51873c-3349-5972-2933-4cb4ba60f19e/screen1136x1136.jpeg", "http://a4.mzstatic.com/us/r30/Purple1/v4/3e/5c/5f/3e5c5fdd-9eeb-a4ce-4f46-0385f6b2515c/screen1136x1136.jpeg", "http://a3.mzstatic.com/us/r30/Purple3/v4/39/03/ad/3903ad87-2815-713e-7140-2e5f91dc0557/screen1136x1136.jpeg", "http://a1.mzstatic.com/us/r30/Purple4/v4/a8/d9/09/a8d909dd-4653-32f0-55fe-5dd4c5974c9a/screen1136x1136.jpeg"], "userRatingCount": 7130, "trackContentRating": "4+", "formattedPrice": "Free", "artistViewUrl": "https://itunes.apple.com/us/artist/foreflight/id283512699?uo=4", "kind": "software", "averageUserRatingForCurrentVersion": 3.0, "sellerName": "ForeFlight, LLC", "supportedDevices": ["iPhone5", "iPadFourthGen", "iPadMini4G", "iPad2Wifi", "iPadFourthGen4G", "iPhone5s", "iPadThirdGen", "iPadThirdGen4G", "iPadMini", "iPodTouchFifthGen", "iPhone4", "iPad23G", "iPhone4S", "iPhone5c"], "artworkUrl100": "http://a138.phobos.apple.com/us/r30/Purple1/v4/1e/52/d7/1e52d751-df71-3698-1372-e7da24b824c8/mzl.arapriud.png", "bundleId": "com.foreflight.ForeFlightMobile", "trackViewUrl": "https://itunes.apple.com/us/app/foreflight-mobile/id333252638?mt=8&uo=4", "minimumOsVersion": "7.1", "artworkUrl60": "http://a20.phobos.apple.com/us/r30/Purple1/v4/47/64/35/476435a1-b0a4-0e8b-f999-950eb7e2ccd1/Icon.png", "averageUserRating": 3.5}