{"contentAdvisoryRating": "4+", "features": ["iosUniversal"], "languageCodesISO2A": ["EN"], "ipadScreenshotUrls": ["http://a5.mzstatic.com/us/r30/Purple3/v4/51/d8/bf/51d8bfb9-63df-a6d2-5e9b-5b7eebdf0f8c/screen480x480.jpeg", "http://a3.mzstatic.com/us/r30/Purple3/v4/ba/cc/6f/bacc6f1b-2adf-12f3-246c-0cd4b71bf747/screen480x480.jpeg", "http://a5.mzstatic.com/us/r30/Purple5/v4/0f/6d/0f/0f6d0f09-2787-0d7f-03d4-d37a51dc1619/screen480x480.jpeg", "http://a3.mzstatic.com/us/r30/Purple3/v4/87/bc/03/87bc0352-0014-9364-d14c-369cf9972f62/screen480x480.jpeg", "http://a4.mzstatic.com/us/r30/Purple3/v4/85/cb/2d/85cb2d54-84d9-a81c-715c-486e96612b21/screen480x480.jpeg"], "releaseDate": "2009-12-04T22:44:11Z", "currency": "USD", "artistId": 333208433, "userRatingCountForCurrentVersion": 1, "wrapperType": "software", "advisories": [], "genres": ["Photo & Video", "Travel"], "trackId": 333208430, "description": "By far the best postcard app, PhotoCard is FREE! Capture the moment and send a gorgeous personal keepsake to be treasured for years. Create unique custom-designed postcards using your own photos or Bill's expressive nature photos, and send them as eCards, or as real printed and mailed postcards. Type or dictate a message on the back, and add decorative stamps and stickers. Make your creation even more personal with custom stamps and stickers of your own images, and finish with your signature.\n\nYou can send an unlimited number of PhotoCards by email free of charge, or have us print large 8.25 x 5.5 inch cards using the highest quality color printing and mailed by USPS for a small fee.  Start by choosing one of the app's 220 built-in nature photographs or one of your own personal photos. Adjust the rotation, zoom and crop, lighten or darken your photo, and let PhotoCard analyze and automatically enhance it. With a tap, flip the card over and type or dictate a personal message on the back. For a fun touch, you can jazz up your card with decorative stickers and stamps, and sign it with your own custom signature. Email cards can even include a recorded voice note. When you've finished your creation, you can send it off to any email or postal address in the world! \n\nThis free full version can be downloaded over a WiFi connection and includes 220 of Bill’s nature photos, 220 stamp designs, and 440 fun and decorative stickers. The “Lite” version is exactly the same app, but made small enough for cellular download by including only 20 nature photos, 20 stamps, and 20 stickers. \n\nFEATURES:\n• No frustrations. Simple, intuitive, and fun graphical user interface.\n• No delays. Within minutes of thinking about a friend or family member, you can have a personalized PhotoCard on its way to their postal mailbox or sent directly to their email Inbox. \n• Make it postcard-perfect. Use one of Bill’s stunning nature photos, or resize, crop and adjust one of your own newly-taken or existing photos. \n• Write your message on the back of your card using any available font, size, and style. \n• Edit in place and get what you see with full-screen page layout. \n• Decorate PhotoCards with your choice of playful stickers and colorful stamps. \n• Record voice notes, up to 60 seconds, and include them in your emailed PhotoCards. \n• Personalize your postcard with custom stamps, custom stickers, and even a custom hand-written signature.\n• Sending PhotoCards via email is always free. \n• Sending print-and-mail cards to the USA costs as little as $1.50, including first-class postage, and as little as $2.25 to other countries.\n• Large 8.25 x 5.5 inch cards are printed with a state-of-the-art HP Indigo digital press and laminated for lasting protection.\n• Address correction makes sure your card is deliverable as addressed. \n• A graphical confirmation email informs you when your card is being printed, and another email when it has been mailed.\n• A sent card history shows you all the cards you’ve sent, and lets you open a new, editable copy to start a new card.\n• Browse a world of beauty wherever you go.  PhotoCard includes a collection of Bill's finest nature photographs and a limited license to print and mail these copyrighted photos. \n\nBrought to you by Bill Atkinson, author of Apple’s original QuickDraw, MacPaint, and HyperCard software. You can watch a video of Bill demonstrating PhotoCard at www.billatkinson.com", "artistName": "Bill Atkinson Photography", "artworkUrl512": "http://a1519.phobos.apple.com/us/r30/Purple5/v4/38/e4/64/38e46474-8d27-b41c-cc3e-88247edc0fd0/mzl.wiydgluz.png", "version": "10.0", "primaryGenreId": 6008, "primaryGenreName": "Photo & Video", "fileSizeBytes": "185165941", "price": 0.0, "isGameCenterEnabled": false, "trackCensoredName": "PhotoCard by Bill Atkinson", "genreIds": ["6008", "6003"], "trackName": "PhotoCard by Bill Atkinson", "releaseNotes": "• Updated the software to work correctly with iOS 8.\n• Adaptive layout accommodates different screen sizes.\n• Supports both landscape and portrait orientations on iPhone 6 Plus.\n• Toolbars simplified and higher resolution for iPhone 6.\n• Swipe left or right to flip between card front and back.\n• Shrink-to-fit text makes sure your message fits on the card.\n• Improved user interface for custom sticker mask editor.\n• Browser view to enjoy a gallery of nature photos without distraction.\n• Updated to the latest version of the PayPal payment module.\n• Updated the interactive user guide.\n• Bug fixes and performance enhancements.\n• PhotoCard is a universal app optimized for each different model and resolution of iPad, iPhone, and iPod touch.\n• PhotoCard 10.0 requires iOS 8.0 or later.", "sellerUrl": "http://www.billatkinson.com/aboutPhotoCard.html", "screenshotUrls": ["http://a1.mzstatic.com/us/r30/Purple1/v4/20/3d/34/203d342a-9666-efed-3b7e-be503048fc83/screen320x320.jpeg", "http://a4.mzstatic.com/us/r30/Purple5/v4/aa/ed/ef/aaedef80-29cf-2f1e-e088-f4a9f178b4fc/screen320x320.jpeg", "http://a1.mzstatic.com/us/r30/Purple3/v4/36/62/57/3662576c-5fea-7826-0b55-2b31485c805c/screen320x320.jpeg", "http://a5.mzstatic.com/us/r30/Purple1/v4/c8/52/3d/c8523d4b-f9d1-e4bd-c912-e20d6e0029c0/screen320x320.jpeg", "http://a4.mzstatic.com/us/r30/Purple3/v4/18/62/72/186272ef-03b4-a7b0-a3b4-de3dbeaa933a/screen320x320.jpeg"], "userRatingCount": 281, "trackContentRating": "4+", "formattedPrice": "Free", "artistViewUrl": "https://itunes.apple.com/us/artist/bill-atkinson-photography/id333208433?uo=4", "kind": "software", "averageUserRatingForCurrentVersion": 1.0, "sellerName": "Bill Atkinson Photography", "supportedDevices": ["iPhone5", "iPadFourthGen4G", "iPadMini4G", "iPadMini", "iPhone5c", "iPad2Wifi", "iPadThirdGen", "iPhone5s", "iPadThirdGen4G", "iPad23G", "iPodTouchFifthGen", "iPadFourthGen", "iPhone4S"], "artworkUrl100": "http://a1519.phobos.apple.com/us/r30/Purple5/v4/38/e4/64/38e46474-8d27-b41c-cc3e-88247edc0fd0/mzl.wiydgluz.png", "bundleId": "com.billatkinson.PhotoCard", "trackViewUrl": "https://itunes.apple.com/us/app/photocard-by-bill-atkinson/id333208430?mt=8&uo=4", "minimumOsVersion": "8.0", "artworkUrl60": "http://a215.phobos.apple.com/us/r30/Purple3/v4/26/ed/ee/26edee57-6040-85d0-50de-3186814a8b22/PhotoCard_Icon_120.png", "averageUserRating": 4.5}