{"contentAdvisoryRating": "4+", "features": ["iosUniversal"], "languageCodesISO2A": ["FR"], "ipadScreenshotUrls": ["http://a1.mzstatic.com/us/r30/Purple/v4/f4/b9/2a/f4b92a7c-0f30-742c-6b4a-4cbc6b2a9925/screen480x480.jpeg", "http://a5.mzstatic.com/us/r30/Purple/v4/e6/6d/35/e66d351d-8bb0-2d25-3ed0-7ceadd3e3029/screen480x480.jpeg", "http://a1.mzstatic.com/us/r30/Purple/v4/ca/e4/3d/cae43d47-0177-49ed-5e04-7e6179dc6f91/screen480x480.jpeg", "http://a3.mzstatic.com/us/r30/Purple6/v4/8a/3e/89/8a3e8964-6461-b8ba-6e58-891a843fd0d2/screen480x480.jpeg"], "releaseDate": "2009-10-20T19:57:45Z", "currency": "USD", "artistId": 334438200, "wrapperType": "software", "advisories": [], "genres": ["Travel"], "trackId": 334438197, "description": "SNCF DIRECT, l’information SNCF en temps réel\n\nRetrouvez dans votre application SNCF Direct toutes les informations nécessaires à votre voyage en temps réel, à travers une navigation fluide :\n\n• Affichez le tableau de départ ou d’arrivée de vos gares favorites en temps réel et inscrivez-vous aux alertes des trains que vous souhaitez suivre\n\n• Ajoutez vos voyages* dans l’application : \n   - Visualisez votre numéro de voiture et votre placement à bord du train ainsi que la progression de votre itinéraire (incluant les correspondances éventuelles) \n   - Recevez des alertes dès que votre quai de départ ou d’arrivée est connu ou dès qu’une perturbation est annoncée\n\n• Plus besoin de composter ! Retrouver désormais le m-billet***  ou votre carte de fidélité dans votre smartphone \n\n• Le jour de votre voyage, votre train est perturbé ? Nous vous proposons de consulter les autres trains ou correspondances depuis la page détail de votre voyage\n\n• Recherchez un train par son numéro ou par gare de départ et d’arrivée, en choisissant un trajet direct ou avec correspondance, et faites une recherche sur le trajet retour en un clic\n\n• Retrouvez dans les résultats tous les trajets possibles y compris ceux avec correspondance\n\n• Vous êtes membre du programme de fidélité SNCF ? Identifiez-vous en quelques secondes et retrouvez automatiquement tous vos voyages e-billets et votre carte de fidélité dématérialisé. Si vous avez  perdu votre mot de passe, vous pouvez en demander un nouveau depuis votre application.\n\n• Vous n’êtes pas encore membre du programme de fidélité SNCF ? Inscrivez-vous facilement grâce à cette application.\n\n• Consultez la liste des services et des commerces disponibles dans votre gare de départ et d’arrivée (parking, bus, métro, taxi, salons d’attente, toilettes, relais presse, espaces de restauration, guichets automatiques, location de voiture, services d'accessibilité) **\n\n• Affichez le plan des environs de la gare et repérez-vous dans la ville grâce au système de géolocalisation\n\n• Ecoutez SNCF La Radio qui vous informe en temps réel grâce aux flashs info-trafic et vous accompagne dans vos déplacements, avec une programmation musicale et des émissions culturelles. SNCF La Radio est disponible 24h/24 dans toute la France, avec des décrochages régionaux pour être au plus proche de vous.\n\n• Dès 14h, le lendemain de votre voyage, consultez votre heure d'arrivée, le motif du retard éventuel et vos droits à compensation grâce à la Garantie Ponctualité (une des 6 garanties de La Garantie Voyage®, valable pour TGV et Intercités uniquement)\n\n• Accédez également aux résultats Ponctualité de votre train sur les 60 derniers jours.\n\nGardez dans votre poche les informations relatives à votre prochain voyage en train. SNCF Direct est une application incontournable… et totalement gratuite !\n\nCe service est disponible actuellement au départ et à l’arrivée des principales gares Grandes Lignes.\n\n* Les consultations de voyage IDTGV ne sont pas disponibles dans la version actuelle de l'application. \n** Les informations sur les services en gare sont données à titre indicatif et sous réserve de modification\n***Le service m-billet est proposé sur une sélection de destinations et pour les clients non adhérents au programme de fidélité Voyageur. (Dans ce cas, le e-billet est automatiquement disponible via le code-barres sur la carte de fidélité).", "artistName": "SNCF", "artworkUrl512": "http://a1916.phobos.apple.com/us/r30/Purple5/v4/b2/ef/d9/b2efd96a-86ac-5c90-2510-819ea8355f2c/mzl.imduimom.png", "version": "4.2.2", "primaryGenreId": 6003, "primaryGenreName": "Travel", "fileSizeBytes": "9290783", "price": 0.0, "isGameCenterEnabled": false, "trackCensoredName": "SNCF Direct", "genreIds": ["6003"], "trackName": "SNCF Direct", "releaseNotes": "Résolution de bugs mineurs.\nNote : Nous travaillons actuellement à l'optimisation de l'application SNCF DIRECT pour les iPhone 6 et 6+.\nMerci de votre fidélité et n'hésitez pas à contacter notre support sur l'application : sncfdirect@sncf.fr", "sellerUrl": "http://www.sncf.com/fr/services/applications-mobiles", "screenshotUrls": ["http://a2.mzstatic.com/us/r30/Purple/v4/f1/b9/bd/f1b9bd17-b36e-a0a0-8b6d-1af5756d86ea/screen1136x1136.jpeg", "http://a5.mzstatic.com/us/r30/Purple6/v4/d7/d6/e2/d7d6e221-b072-bae1-713b-2aad53710a4c/screen1136x1136.jpeg", "http://a2.mzstatic.com/us/r30/Purple/v4/eb/eb/6b/ebeb6b64-9f85-789e-5e4b-d80ccc3a39ae/screen1136x1136.jpeg", "http://a4.mzstatic.com/us/r30/Purple4/v4/11/07/1e/11071ef2-ffc5-82c9-ebd9-ff08af66b98c/screen1136x1136.jpeg"], "userRatingCount": 154, "trackContentRating": "4+", "formattedPrice": "Free", "artistViewUrl": "https://itunes.apple.com/us/artist/sncf/id334438200?uo=4", "kind": "software", "sellerName": "SNCF", "supportedDevices": ["iPadFourthGen", "iPodTouchourthGen", "iPadMini", "iPodTouchFifthGen", "iPhone5s", "iPhone-3GS", "iPad2Wifi", "iPadThirdGen", "iPhone4", "iPadFourthGen4G", "iPadThirdGen4G", "iPhone4S", "iPhone5c", "iPhone5", "iPadMini4G", "iPad23G"], "artworkUrl100": "http://a1916.phobos.apple.com/us/r30/Purple5/v4/b2/ef/d9/b2efd96a-86ac-5c90-2510-819ea8355f2c/mzl.imduimom.png", "bundleId": "fr.sncf.engares", "trackViewUrl": "https://itunes.apple.com/us/app/sncf-direct/id334438197?mt=8&uo=4", "minimumOsVersion": "6.0", "artworkUrl60": "http://a1210.phobos.apple.com/us/r30/Purple5/v4/47/05/0d/47050d07-0acd-089a-c321-bee70c567cee/Icon.png", "averageUserRating": 3.0}