{"contentAdvisoryRating": "4+", "features": ["gameCenter"], "languageCodesISO2A": ["NL", "EN", "FR", "DE", "PT", "ES"], "ipadScreenshotUrls": [], "releaseDate": "2009-10-25T07:00:00Z", "currency": "USD", "artistId": 330111789, "userRatingCountForCurrentVersion": 85, "wrapperType": "software", "advisories": [], "genres": ["Games", "Entertainment", "Board", "Strategy"], "trackId": 335029050, "description": "\"Catan\", the legendary strategy game provides gaming fun anytime, anywhere.\n\nTrue to the original game, you can compete with up to four players for the most settlements, the longest roads and the largest army. You can trade with each other and claim the precious land with all its resources.\n\nUpdate 4.0 of the game allows you to challenge other Catan fans online via cross-platform multiplayer to prove your strategy skills.\nBut also various computer opponents, each with their own individual characteristics, will prove themselves worthy competitors: the pirate Jean, who knows no compromise, Vincent the merchant, who never allows himself to be cheated, Sean the knight, who takes what is rightfully his...\n\nThe popular Catan expansions \"Seafarers\" and \"Cities and Knights\" are available as In-App purchases.\n\nThe complete Seafarers expansion includes more than 10 additional scenarios with an extensive campaign. Become Harbormaster, discover new islands and extra game elements like ships, gold fields, treasures and pirates. Ahoy!\n\nThe Cities and Knights expansion introduces various new gameplay mechanics that add even more variety to Catan. Invest new trade goods in city improvements to build one of the three metropolises of Catan – but beware of the barbarians attracted by Catan’s new wealth! You’ll need your best knights to fend them off! C&K contains a short campaign and 7 challenging maps.\n\nFeatures:\n\n- Available languages: English, German, French, Dutch, Spanish, Portuguese\n- Original \"Settlers of Catan\" rule set\n- Update 4.0+: Synchronous online multiplayer games\n- Smart computer opponents with individual strategies\n- Scrollable game board including zoom option \n- Freely combinable game settings \n- Game statistics\n- Comprehensive tutorial\n- Seafarers LITE: New scenario \"The 4 Islands\" and two additional game variants\n- Cities and Knights LITE: Test the new expansion in the scenario “The first Island”\n- 3 different graphic sets to choose from\n\n\n***** \nCatan FAQ: \n\nQuestion: An expansion seems gone after an update or reinstallation of Catan or after restoring the device? \nAnswer: Don’t worry! Your initial purchase is already saved in your iTunes account. You can restore your InApp purchases by selecting the restore-option in the Catan IAP menu. \n\nQuestion: I lost my campaign progress after reinstalling, updating or restoring my device. Is there any way to restore it? \nAnswer: When saved games can’t be automatically restored, we’ve integrated a cheat code: In the campaign mode go to select player and enter „CatanWarp*“ (* = 1–15) as your player name and confirm. Exit the game via the home button and restart it. The campaign can now be continued from the specified level number (1–15). Levels up to the specified number will be unlocked in the custom game mode as well. \n\nQuestion: Are dice rolls really random? \nAnswer: Of course! All dice rolls are 100% random and not modified in any way. We’re avid Catan players ourselves. We’ve played the iOS version hundreds of times while developing the program. There have been times when we won and lost a few games in a row because of the dice - just like when playing the board game! \n\n*****\nQuestions or suggestions for improvements: \nMail to ios@usm.de \nWe are looking forward to your feedback! \n\nPlease do not ask your questions in the reviews as we do not have the possibility to respond to you there.\n\nFor more information on news and updates: www.usmgames.com \nor visit us on www.facebook.com/UnitedSoftMedia and twitter.com/USM_News \n\n*****", "artistName": "USM", "artworkUrl512": "http://a374.phobos.apple.com/us/r30/Purple1/v4/c6/c0/3b/c6c03b9f-8ae9-175c-9e65-a5d3189d4617/mzl.kadrbggs.png", "version": "4.2", "primaryGenreId": 6014, "primaryGenreName": "Games", "fileSizeBytes": "76275369", "price": 4.99, "isGameCenterEnabled": true, "trackCensoredName": "Catan", "genreIds": ["6014", "6016", "7004", "7017"], "trackName": "Catan", "releaseNotes": "Catan 4.2 adds online multiplayer mode to the Cities and Knights expansion and offers a new scenario pack (IAP) for single player games as well: Defeat Dragons in the “Enchanted Land” and help to build the “Great Canal” in these scenarios with special rules and challenges. Furthermore we’ve added a special deal including all Catan expansions to the Catan store.\n\n- Added multiplayer support for Cities and Knights expansion\n- New IAPs: Scenario pack including the “Enchanted Land” and “Great Canal” and All-In-One deal to the Catan store.\n- Added “News” screen on startup and to help menu\n- Updated and optimized network code for online games\n- Improved stability\n- Various smaller tweaks and optimizations", "sellerUrl": "http://www.usmgames.com/content-100-100/apps/", "screenshotUrls": ["http://a1.mzstatic.com/us/r30/Purple2/v4/1c/e8/85/1ce885fd-68be-5520-8ccb-6dc68ff6010f/screen320x320.jpeg", "http://a3.mzstatic.com/us/r30/Purple/v4/d4/c1/43/d4c1435b-b043-a310-7cdb-41553fc23dab/screen320x320.jpeg", "http://a3.mzstatic.com/us/r30/Purple/v4/f9/f2/12/f9f21273-cdc0-043e-3302-aaea873796ea/screen320x320.jpeg", "http://a4.mzstatic.com/us/r30/Purple/v4/f0/99/45/f0994598-7645-6540-1010-d9022f1423d8/screen320x320.jpeg", "http://a1.mzstatic.com/us/r30/Purple4/v4/31/8d/4a/318d4acd-6178-83e8-a322-7deec4a593dc/screen320x320.jpeg"], "userRatingCount": 12886, "trackContentRating": "4+", "formattedPrice": "$4.99", "artistViewUrl": "https://itunes.apple.com/us/artist/usm/id330111789?uo=4", "kind": "software", "averageUserRatingForCurrentVersion": 3.5, "sellerName": "United Soft Media Verlag GmbH", "supportedDevices": ["iPad2Wifi", "iPadFourthGen", "iPodTouchourthGen", "iPhone4S", "iPad23G", "iPadMini", "iPhone5c", "iPadThirdGen", "iPhone5", "iPodTouchFifthGen", "iPadFourthGen4G", "iPadThirdGen4G", "iPhone-3GS", "iPhone5s", "iPhone4", "iPadMini4G"], "artworkUrl100": "http://a374.phobos.apple.com/us/r30/Purple1/v4/c6/c0/3b/c6c03b9f-8ae9-175c-9e65-a5d3189d4617/mzl.kadrbggs.png", "bundleId": "com.exozet.catan", "trackViewUrl": "https://itunes.apple.com/us/app/catan/id335029050?mt=8&uo=4", "minimumOsVersion": "6.1", "artworkUrl60": "http://a957.phobos.apple.com/us/r30/Purple1/v4/02/40/76/0240762e-6b6d-39b5-a546-d859385abead/AppIcon57x57.png", "averageUserRating": 4.0}