{"contentAdvisoryRating": "12+", "features": ["iosUniversal"], "languageCodesISO2A": ["EN", "ES"], "ipadScreenshotUrls": ["http://a3.mzstatic.com/us/r30/Purple1/v4/73/6f/73/736f73da-9c4d-feb0-b158-208d4ef7334c/screen480x480.jpeg", "http://a3.mzstatic.com/us/r30/Purple3/v4/ca/27/07/ca270728-ce75-2f6a-c52f-1aedc2a6fd42/screen480x480.jpeg", "http://a3.mzstatic.com/us/r30/Purple5/v4/fe/c4/0d/fec40d29-d856-148d-b30e-992496910231/screen480x480.jpeg", "http://a2.mzstatic.com/us/r30/Purple5/v4/66/62/fe/6662febd-7e65-9af7-3b56-504a55932670/screen480x480.jpeg", "http://a5.mzstatic.com/us/r30/Purple5/v4/29/40/1a/29401a5b-a8b0-0122-3326-150887ebca43/screen480x480.jpeg"], "releaseDate": "2009-10-27T00:10:29Z", "currency": "USD", "artistId": 335364885, "userRatingCountForCurrentVersion": 441, "wrapperType": "software", "advisories": ["Infrequent/Mild Alcohol, Tobacco, or Drug Use or References", "Infrequent/Mild Medical/Treatment Information"], "genres": ["Lifestyle", "Health & Fitness"], "trackId": 335364882, "description": "Featuring Refill by Scan and QuickPrints, the Walgreens App makes life easier. Refill prescriptions faster, get photo prints in about an hour, and know the deals before you shop.\n\nUniversal app for iPhone and iPad.\n\nPHARMACY FEATURES\n• Refill by Scan* - Simply scan the barcode on your prescription bottle for instant refills\n• Points for Refills** – Balance® Rewards members get 500 points every time they refill a prescription\n• Pill Reminder – Create and manage reminders that alert you when it’s time to take your prescription, over-the-counter medications and vitamins\n• Transfer Prescription – Easily transfer your prescriptions to Walgreens\n• Refill Reminders – Get alerts when it’s time to refill your prescriptions\n• Pharmacy Chat – Chat live with a pharmacy professional to get health advice and account support\n• Healthcare Clinic – Find a Healthcare Clinic near you, search available appointment times, and easily schedule an appointment from your phone\n\nPHOTO FEATURES \n• QuickPrints – Print photos from your phone, Facebook and Instagram albums and pick up at your local Walgreens in about an hour—no log-in or account required\n• Photo Editing – Edit your photos using filters and a variety of editing tools\n• Photo Cards – Create personalized photo cards from your phone Facebook and Instagram albums. Choose from a variety of seasonal templates, add text, print to your local Walgreens, and pick up in about an hour\n• Collage – Choose from unique layouts to create a collage with photos from your phone, Facebook and Instagram albums. Print to Walgreens and pick up in about an hour\n• Posters and Canvas – Make your photos larger than life\n\nBALANCE REWARDS FEATURES\n• Create a Balance Rewards account, log in and add your Balance Rewards card to Passbook\n• Select your preferred Walgreens location and when you’re near that store, Passbook will display your Balance Rewards card\n• Scan your mobile card at checkout to earn points, check your point status and apply savings from your clipped coupons\n• View and manage your clipped coupons\n\nBALANCE REWARDS FOR HEALTHY CHOICES™\n• Become a member and get points for logging activities and setting goals\n• Set goals and log activity for Walking, Running, Frequency or Tracking Weight\n• Get exclusive product offers and other great rewards\n\nSHOPPING FEATURES\n• Weekly Ad & Coupons - Access exclusive deals and offers and find big savings in our Weekly Ad. Clip manufacturers’ coupons and coupons from the Weekly Ad straight to your Balance Rewards card and easily redeem when you shop in store\n• In-Store Experience – Easily access all the tools you need when you shop in store.\n• Store Maps – Use your Shopping List to locate items in store and map out your shopping trip \n• Promos and Offers – Find exclusive mobile deals and offers\n• Barcode Scanner - Learn more about our products by scanning product barcodes or QR codes from our paper Weekly Ads\n• Product Search – Set your preferred store and search your store’s inventory \n• Store Filters – Search for a store based on features like 24 hour locations, Drive-thru Pharmacies and more\n\nThere is no charge to download the Walgreens app, but specified rates from your wireless provider and other fees as noted in your Walgreens account agreement(s) still apply.\n\n*Requires iOS 6.0 or later.\n** Due to state and federal laws, points cannot be earned on some items. Points will not be awarded to anyone who currently is or was at any time in the 6 months prior to purchasing Pharmacy Items covered by Medicare, Medicaid, Tricare or any other government-funded healthcare program. Pharmacy Items must be purchased at participating Walgreens Drugstore, Rxpress, Duane Reade, or Walgreens Pharmacy locations (\"Participating Stores\") to earn points. Excludes Pharmacy Items purchased from AR, NJ or NY pharmacies and prescriptions transferred to a Participating Store located in AL, MS, OR or PR. See Balance Rewards terms and conditions for full details", "artistName": "Walgreen Co.", "artworkUrl512": "http://a1642.phobos.apple.com/us/r30/Purple3/v4/cf/1c/b7/cf1cb72f-af49-8f52-abfb-048fcbe55b74/mzl.yjixlscj.png", "version": "5.1", "primaryGenreId": 6012, "primaryGenreName": "Lifestyle", "fileSizeBytes": "50523887", "price": 0.0, "isGameCenterEnabled": false, "trackCensoredName": "Walgreens", "genreIds": ["6012", "6013"], "trackName": "Walgreens", "releaseNotes": "Enhancements to QuickPrints, now you can choose different sizes and quantities in the same order\n\nWe heard your feedback and landscape mode is now available on iPad", "screenshotUrls": ["http://a5.mzstatic.com/us/r30/Purple1/v4/a9/29/26/a929266f-bcf8-9b23-42ce-3f5c112b8737/screen1136x1136.jpeg", "http://a4.mzstatic.com/us/r30/Purple3/v4/77/e9/e2/77e9e2bc-a2d2-0ffb-2a54-12518f967bf1/screen1136x1136.jpeg", "http://a4.mzstatic.com/us/r30/Purple1/v4/20/86/1b/20861bde-4632-9460-c3fb-f79eb01ba641/screen1136x1136.jpeg", "http://a2.mzstatic.com/us/r30/Purple5/v4/a1/4d/ee/a14dee32-4f5a-d320-1599-81114caaa123/screen1136x1136.jpeg", "http://a3.mzstatic.com/us/r30/Purple3/v4/dc/58/67/dc586715-44de-3797-9add-31e140a9b0fd/screen1136x1136.jpeg"], "userRatingCount": 68701, "trackContentRating": "12+", "formattedPrice": "Free", "artistViewUrl": "https://itunes.apple.com/us/artist/walgreen-co./id335364885?uo=4", "kind": "software", "averageUserRatingForCurrentVersion": 4.5, "sellerName": "Walgreen Co.", "supportedDevices": ["iPadThirdGen4G", "iPhone5", "iPhone4", "iPadMini4G", "iPodTouchFifthGen", "iPadFourthGen", "iPodTouchourthGen", "iPad2Wifi", "iPad23G", "iPhone4S", "iPhone5c", "iPhone5s", "iPadThirdGen", "iPadFourthGen4G", "iPadMini", "iPhone-3GS"], "artworkUrl100": "http://a1642.phobos.apple.com/us/r30/Purple3/v4/cf/1c/b7/cf1cb72f-af49-8f52-abfb-048fcbe55b74/mzl.yjixlscj.png", "bundleId": "com.usablenet.walgreens", "trackViewUrl": "https://itunes.apple.com/us/app/walgreens/id335364882?mt=8&uo=4", "minimumOsVersion": "6.0", "artworkUrl60": "http://a559.phobos.apple.com/us/r30/Purple3/v4/a5/20/d2/a520d2b8-befb-17bc-03db-9dea2559e6fa/AppIcon57x57.png", "averageUserRating": 4.5}