{"contentAdvisoryRating": "4+", "features": ["iosUniversal"], "languageCodesISO2A": ["EN"], "ipadScreenshotUrls": ["http://a4.mzstatic.com/us/r30/Purple1/v4/30/d8/54/30d8547f-28cb-23df-09f9-1ee4a4a6c4a7/screen480x480.jpeg", "http://a3.mzstatic.com/us/r30/Purple3/v4/08/3b/bc/083bbc65-492f-4ac9-37f3-9bbc69939570/screen480x480.jpeg", "http://a5.mzstatic.com/us/r30/Purple3/v4/e4/df/c6/e4dfc6dd-ca5f-3df2-ca3a-a9fd40a26730/screen480x480.jpeg", "http://a4.mzstatic.com/us/r30/Purple3/v4/eb/d4/27/ebd42713-a4b0-a416-9370-4793c9daf2f9/screen480x480.jpeg", "http://a5.mzstatic.com/us/r30/Purple3/v4/66/1f/38/661f380d-7871-078e-0c93-c7e6205bc7de/screen480x480.jpeg"], "releaseDate": "2009-12-05T02:07:41Z", "currency": "USD", "artistId": 338380657, "userRatingCountForCurrentVersion": 19, "wrapperType": "software", "advisories": [], "genres": ["Lifestyle", "Productivity"], "trackId": 338380654, "description": "Get into the spirit of holiday shopping fun now! Try the Coupons.com mobile app and see for yourself why this is the best free coupon app you’ll ever use! \n\nFind high-value coupons, discount codes, exclusive sales, special card linked savings offers and tons of other deals and discounts for any type of purchase you make, online or in-store! \n\nFeatures you’ll love:\n\nSAVINGS ALERTS \n\n• Get handy alerts for great offers near you \u2028while you’re out shopping. Our notifications alert you about offers while you’re shopping and send you helpful reminders when deals you’ve saved are about to expire. You’ll never miss a bargain again!\n\nNEARBY OFFERS\n\n• Tap ‘Nearby’ to discover offers at stores near you, view them on a map or even view hours and store information. Unlike other apps, no sign in is required to take advantage of our amazing discount codes and savings offers. We strive to make saving easy for you!\n• Our ‘Featured’ tab will help you find the latest and greatest coupons, hand picked by our savings experts, so you know the best deals before you shop.\n\nCARD LINKED OFFERS\n\n• Easy to use card linked offers allow you to register a credit card and then add amazing offers at popular retailers like Old Navy, Petsmart and Lord & Taylor with just one tap. You’ll receive a confirmation message as soon as you checkout and a credit on your next statement. There’s no need to show anything at checkout or read a code to the cashier. Just add, swipe and save. It’s that easy! Become a Coupon Pro.\n\nCOUPON CODES\n\n• Browse thousands of coupon codes for big savings on all your online purchases. Redeem codes with a simple “drag and drop” while checking-out. It's effortless coupon shopping right from your mobile device.\n• Add offers to Apple Passbook and use them right when you check out at your favorite stores.\n\nVERIFIED GROCERY & DRUGSTORE COUPONS\n\n• Print verified grocery and drugstore coupons for your favorite brands directly from your device or email them to your computer and print from there. No log in required.\n\nLOYALTY CARDS\n\n• Add loyalty cards from a selection of grocery stores and automatically save when you use them at the register (no need to carry those cards with you).\n\nGREAT SELECTION\n\n• Your one-stop shop for savings. The best coupons available for grocery and personal care brands, discount codes for online retailers and great deals for all the stores you love. Get thousands of coupons, discounts and promo codes for nearly everywhere you shop and take them with you wherever you go. \n• For printable coupons, you can print directly from your iPhone or iPad, or email them to a computer and print from there.\n• Offers are continually being added and refreshed, and we work tirelessly to find you the best online deals as well as top-value coupons for everything you need at the grocery and drug store. Check back for our daily deals.\n\nDownload our coupons app now and start saving instantly!\n\nWE LOVE OUR CUSTOMERS\n\nHaving trouble with the app? Have a suggestion of how we could make it better? We're here to help! \u2028Contact our friendly support team and we'll get you back to saving in a snap: AppleApp-Support@coupons.com", "artistName": "Coupons.com", "artworkUrl512": "http://a1454.phobos.apple.com/us/r30/Purple3/v4/e9/80/9d/e9809d30-2232-bf09-be09-21e6e70de69c/mzl.dcdffats.png", "version": "3.0.1", "primaryGenreId": 6012, "primaryGenreName": "Lifestyle", "fileSizeBytes": "15235781", "price": 0.0, "isGameCenterEnabled": false, "trackCensoredName": "Coupon Codes, Savings & Deals", "genreIds": ["6012", "6007"], "trackName": "Coupon Codes, Savings & Deals", "releaseNotes": "Ready for holiday shopping? We’ve made some BIG improvements to our iPhone app that will make your Black Friday, Cyber Monday and holiday shopping easier and more enjoyable this year!\n \nWith version 3 of the Coupons app you’ll be able to find offers for all the brands you love in a snap. Here’s what the new app has in store for iPhone users:\n \n• NEW – a simplified, intuitive design makes it easier to find the offers that matter to you.\n• NEW – the Featured screen shows you the best offers, hand selected by our savings experts every day. \n• NEW – the Nearby screen shows you relevant deals around you.\n• NEW – enable notifications and we’ll let you know when we have a deal for a store near you while you shop!\n \nCheckout our new look and Nearby offers and take advantage of saving money every time you shop!\n \nHappy shopping and saving!\n\n- The Coupons.com Mobile Team\n\niPad user? Sorry we couldn’t get you all the great new features for this release, but don’t worry, we haven’t forgotten about you! We’re hard at work on a new version which will add all the same features (and maybe some special new ones) just for you. \n\nWe've also squished a tiny bug from the first v3 release. Enjoy your tiny bug free experience!", "sellerUrl": "http://www.coupons.com", "screenshotUrls": ["http://a3.mzstatic.com/us/r30/Purple3/v4/27/0b/4e/270b4e4b-45e1-9491-0e7e-0978a06d93ed/screen1136x1136.jpeg", "http://a2.mzstatic.com/us/r30/Purple3/v4/b3/cc/c6/b3ccc69d-6d24-7b32-bfe4-6015dbdd8531/screen1136x1136.jpeg", "http://a4.mzstatic.com/us/r30/Purple5/v4/00/12/52/001252fe-7bb8-17d8-7cf5-2d288ba37342/screen1136x1136.jpeg", "http://a2.mzstatic.com/us/r30/Purple3/v4/73/b7/1c/73b71cd1-156d-8386-2e51-1b6c0e1b0d91/screen1136x1136.jpeg", "http://a3.mzstatic.com/us/r30/Purple3/v4/16/ed/dc/16eddc1e-fc46-947f-5efa-829feeb17c81/screen1136x1136.jpeg"], "userRatingCount": 10568, "trackContentRating": "4+", "formattedPrice": "Free", "artistViewUrl": "https://itunes.apple.com/us/artist/coupons.com/id338380657?uo=4", "kind": "software", "averageUserRatingForCurrentVersion": 4.0, "sellerName": "Coupons.com Incorporated", "supportedDevices": ["iPhone4", "iPadThirdGen", "iPadFourthGen", "iPad2Wifi", "iPadThirdGen4G", "iPhone5c", "iPodTouchFifthGen", "iPadMini4G", "iPhone5s", "iPadMini", "iPhone5", "iPad23G", "iPadFourthGen4G", "iPhone4S"], "artworkUrl100": "http://a1454.phobos.apple.com/us/r30/Purple3/v4/e9/80/9d/e9809d30-2232-bf09-be09-21e6e70de69c/mzl.dcdffats.png", "bundleId": "com.coupons.coupons", "trackViewUrl": "https://itunes.apple.com/us/app/coupon-codes-savings-deals/id338380654?mt=8&uo=4", "minimumOsVersion": "7.0", "artworkUrl60": "http://a1444.phobos.apple.com/us/r30/Purple1/v4/80/0f/8e/800f8e22-8b54-1811-4c68-f6d9c11d5f1e/AppIcon60x60_U00402x.png", "averageUserRating": 2.5}