{"contentAdvisoryRating": "12+", "features": [], "languageCodesISO2A": ["EN"], "ipadScreenshotUrls": [], "releaseDate": "2009-12-02T08:00:00Z", "currency": "USD", "artistId": 340021816, "userRatingCountForCurrentVersion": 273, "wrapperType": "software", "advisories": ["Infrequent/Mild Alcohol, Tobacco, or Drug Use or References"], "genres": ["Lifestyle", "Entertainment"], "trackId": 340021813, "description": "Customer-requested enhancements! Now you can get more of what you love with the QVC for iPhone® app that anyone can download for free. The new My Account feature lets you access more order information than ever. You can track your order, edit Easy Pay options, manage your address book, and more. Plus, as always, never miss our Today's Special Value®—our best offer of the day, good for one day only.\n \nNEW FEATURES\n\n   - Touch ID fingerprint authentication support for iPhone 5S, iPhone 6, and iPhone 6 Plus devices running iOS 8\n   - Track orders\n   - Update your personal information\n   - Edit and cancel orders\n   - View and edit Easy Pay options\n   - Manage Auto-Delivery options\n   - Access and shop your Wish List\n   - Manage your address book\n\nEXISTING FEATURES\n\n   - Watch our full 16:9 HD live stream and purchase the current Item On Air.\n   - See customer ratings & reviews on our product detail pages and product listings. Plus on our enhanced product detail pages, view product images, information, sizing, color swatches, availability and delivery date estimates.\n   - Find exactly what you're looking for with our full-search capability – search over 100,000 items by category, item number, product description, brand, phrase, or word. From there, you have the ability to narrow those search results.\n   - Order both in stock and Waitlisted items.\n   - Easily navigate our enhanced homepage. Find our Today's Special Value offer, One Time Only values, and current Item on Air, plus Items Recently on Air and featured promotions.\n   - Enjoy Buy More, Save More offers, Easy Pay options, multiple ship-to address capability, and more.\n   - Narrow the Items Recently on Air product listing by show.\n   - Share items via Facebook or Twitter. Email an item to your friend or to yourself as a reminder to view a product later.\n   - Speed Buy® to purchase items quickly and confidently! New customers can easily create an account—anytime, anywhere. Our app can also save your email address for faster purchases in the future.\n   - Check your order status.\n\nIf something's not what you expected, just send it back within 30 days of receipt for an exchange (if available) or full refund of the purchase price. See the QVC Return Policy for details.\n\nAward-winning Service: We've been honored multiple times with BizRate's \"Circle of Excellence\" distinction. We've also received Shopping.com's \"Trusted Store\" Seal, a prestigious vote of customer confidence awarded to online merchants.\n\nQVC is committed to giving you quality service and treating your information responsibly. For details, please see our Privacy Statement.\n\nQVC is VeriSign Secured, so you can feel confident while shopping with us. We participate in the VeriSign Secured Seal Program. All of your personal information is encrypted by Secure Sockets Layer (SSL) software when it's transmitted to us during the checkout process, just as it is on QVC.com. Also, your QVC PIN is never stored on your device.\n\nCompatible with iPhone®, iPod touch®, and iPad® \nRequires iOS 6+ or later\n\nWatching QVC's video stream may significantly increase the data usage amount of your mobile device and may incur additional fees. Contact your carrier for more information.", "artistName": "QVC, Inc.", "artworkUrl512": "http://a1500.phobos.apple.com/us/r30/Purple5/v4/5d/31/22/5d3122f2-2073-21e7-735b-667457d8a9ac/mzl.qultgbdg.png", "version": "2.7.6", "primaryGenreId": 6012, "primaryGenreName": "Lifestyle", "fileSizeBytes": "12842817", "price": 0.0, "isGameCenterEnabled": false, "trackCensoredName": "QVC for iPhone", "genreIds": ["6012", "6016"], "trackName": "QVC for iPhone", "releaseNotes": "Thank you for using the QVC app. This update includes support for Touch ID and several bug fixes:\n   - Touch ID fingerprint authentication support for iPhone 5S, iPhone 6, and iPhone 6 Plus devices running iOS 8\n   - Now you can use Speed Buy or checkout by simply using your fingerprint! No more typing in your password every time you shop. This feature requires iOS 8.\n   - Resolved Program Guide time zone issues\n   - Bug fixes to address app crashes and some product duplication\nWe appreciate your feedback. Please continue to share your thoughts, so we can continue to enhance your experience and improve performance.", "sellerUrl": "http://www.qvc.com/iphone", "screenshotUrls": ["http://a4.mzstatic.com/us/r30/Purple5/v4/a4/62/42/a46242f8-a6f4-0a00-342a-6db639beb1a4/screen1136x1136.jpeg", "http://a5.mzstatic.com/us/r30/Purple3/v4/62/43/37/62433746-462d-24cd-befa-a93eeeea392e/screen1136x1136.jpeg", "http://a2.mzstatic.com/us/r30/Purple4/v4/b8/aa/bb/b8aabb74-3bed-afc2-75ab-d3103f12066f/screen1136x1136.jpeg", "http://a4.mzstatic.com/us/r30/Purple5/v4/2f/cc/c3/2fccc38b-3bef-9c02-f419-1ea03e6ec59e/screen320x320.jpeg", "http://a1.mzstatic.com/us/r30/Purple4/v4/eb/d9/ef/ebd9efd6-08e1-bd91-b59a-6c75951f7724/screen1136x1136.jpeg"], "userRatingCount": 7427, "trackContentRating": "12+", "formattedPrice": "Free", "artistViewUrl": "https://itunes.apple.com/us/artist/qvc-inc./id340021816?uo=4", "kind": "software", "averageUserRatingForCurrentVersion": 4.5, "sellerName": "QVC, Inc.", "supportedDevices": ["iPadThirdGen", "iPadMini4G", "iPhone4S", "iPhone-3GS", "iPad23G", "iPhone4", "iPadMini", "iPadFourthGen4G", "iPadThirdGen4G", "iPad2Wifi", "iPodTouchFifthGen", "iPadFourthGen", "iPodTouchourthGen", "iPhone5c", "iPhone5s", "iPhone5"], "artworkUrl100": "http://a1500.phobos.apple.com/us/r30/Purple5/v4/5d/31/22/5d3122f2-2073-21e7-735b-667457d8a9ac/mzl.qultgbdg.png", "bundleId": "com.qvc.iphoneapp", "trackViewUrl": "https://itunes.apple.com/us/app/qvc-for-iphone/id340021813?mt=8&uo=4", "minimumOsVersion": "6.0", "artworkUrl60": "http://a1665.phobos.apple.com/us/r30/Purple1/v4/7f/2e/3d/7f2e3da7-ab41-08d1-2771-73c62bfa3a4b/Icon.png", "averageUserRating": 3.5}