{"contentAdvisoryRating": "4+", "features": [], "languageCodesISO2A": ["EN", "DE"], "ipadScreenshotUrls": [], "releaseDate": "2009-12-09T21:53:32Z", "currency": "USD", "artistId": 317216503, "userRatingCountForCurrentVersion": 24, "wrapperType": "software", "advisories": [], "genres": ["Travel", "Navigation"], "trackId": 341585937, "description": "Are you a passionate traveler, ready to set off on your next travel adventure? Trip Journal is the ultimate travel app to track, record, document, and share your travels with friends and family.  \n\nTRIP JOURNAL FEATURES\n---------------------------------------\nWe have a new and improved version of our award-winning travel app that makes it easier than ever to create a media-rich travelogue of your travel experiences and share them with friends and family.\n\nIn version 7.1, Trip Journal continues to offer you great features to create a memorable travelogue. But now it is also iOS 5 compatible and includes support for Retina Display so you can see your trips on the screen in vivid display like never before. You asked us to make Trip Journal simpler to use so we’ve also made it much easier to create trips and understand how to use Waypoints. We went to work on this request and now there is no need to navigate through multiple menus and screens -- you can create your trip with a few simple steps in one main screen. Waypoints are now called Places and it’s much clearer how to organize all the media and notes for the Places that you’ve add on the map in your trip journal.  \n\nRecord Your Trip with GPS route tracking, and use automatic or manual positioning to add your favorite places and destinations. Trip Journal can automatically define your location and you can easily add geo-tagging to photos and videos.\n\nEveryone loves travel photos and videos. You can add them to Trip Journal from your iPhone Photo Gallery or take them in Trip Journal. The photos and videos taken with Trip Journal are also saved in the iPhone Photo Gallery at full camera resolution and can be added to previously created Places you’ve added in your journal. Say you want to add some video of you trekking the last leg of your journey at the Great Wall of China. You’d never want to forget that moment. Trip Journal gives you two quality options for recorded video. All that adds up to plenty of great photos and videos of your trip that you can later send by email, connect to Facebook and share, or upload to Picasa, Flickr, or YouTube.\n\nMaybe there are some special things you want to jot down to remember about a place you visited. You can write notes in the journal to describe your vacation experiences and you can add comments to photos and videos as well.\n\nWhen you are ready to Share Your Trip, we’ve integrated Trip Journal with your favorite social networks and content sharing portals, including Facebook, Flickr, Picasa, YouTube, and Twitter, to bring you more interactivity than ever before.\n\nWith Google Earth integration, Trip Journal allows friends and family to easily see the route you traveled, the places you found most interesting, and full screen photos, videos, and comments about the places you visited. It even includes trip stats like the distance, time and geography you traveled.\n\nWhat you get in the end with Trip Journal are one-of-a-kind travel journals handcrafted by you, rich with your travel experience and full of great travel memories captured for many years to come that you can share anytime and anywhere, with family and friends far or near.\n\nFIND US! WE’D LOVE TO HEAR FROM YOU\n---------------------------------------\nSubscribe for News on our Website: http://www.trip-journal.com\nFan Us on Facebook: https://www.facebook.com/TripJournalApp\nFollow Us on Twitter: http://twitter.com/tripjournal\nWatch Us on YouTube: http://www.youtube.com/iQapps\nGive Us Feedback: http://community.trip-journal.com/tripjournal\n\nA FEW TIPS FROM US\n---------------------------------------\nTrip Journal runs on the iPad and on iPod touch, but it is not specifically designed for these devices. Location features (Track Route, Geo-tagging and Maps) are available only in Wi-Fi spots. You can add pictures and videos to your trips from the Photo Library. \n\nContinued use of GPS running in the background can dramatically decrease battery life.", "artistName": "iQapps", "artworkUrl512": "http://a678.phobos.apple.com/us/r30/Purple2/v4/09/ae/e4/09aee475-bbe1-b60d-1b04-6448ccedfb8c/mzl.lzxxbxxm.png", "version": "7.3", "primaryGenreId": 6003, "primaryGenreName": "Travel", "fileSizeBytes": "16481320", "price": 2.99, "isGameCenterEnabled": false, "trackCensoredName": "Trip Journal", "genreIds": ["6003", "6010"], "trackName": "Trip Journal", "releaseNotes": "Various bug fixes\niPhone 5 support.", "sellerUrl": "http://www.trip-journal.com/", "screenshotUrls": ["http://a4.mzstatic.com/us/r30/Purple2/v4/f7/d8/b5/f7d8b54d-e519-4824-b59c-ced5e057eb21/screen1136x1136.jpeg", "http://a5.mzstatic.com/us/r30/Purple2/v4/8f/f8/a2/8ff8a23b-e24f-bfed-0d4f-68e514afb31f/screen1136x1136.jpeg", "http://a4.mzstatic.com/us/r30/Purple2/v4/70/95/66/7095666e-df7e-f86b-6e0b-14047e11f87c/screen1136x1136.jpeg", "http://a2.mzstatic.com/us/r30/Purple2/v4/8a/de/fc/8adefcaf-3e82-5021-d15c-d83c51d30dd8/screen1136x1136.jpeg"], "userRatingCount": 925, "trackContentRating": "4+", "formattedPrice": "$2.99", "artistViewUrl": "https://itunes.apple.com/us/artist/iqapps/id317216503?uo=4", "kind": "software", "averageUserRatingForCurrentVersion": 2.5, "sellerName": "iQuest Technologies", "supportedDevices": ["iPhone5s", "iPodTouchourthGen", "iPhone5", "iPad2Wifi", "iPhone4", "iPadMini4G", "iPhone5c", "iPhone4S", "iPad23G", "iPad3G", "iPhone-3GS", "iPadThirdGen", "iPodTouchFifthGen", "iPadMini", "iPadFourthGen", "iPadThirdGen4G", "iPodTouchThirdGen", "iPadWifi", "iPadFourthGen4G"], "artworkUrl100": "http://a678.phobos.apple.com/us/r30/Purple2/v4/09/ae/e4/09aee475-bbe1-b60d-1b04-6448ccedfb8c/mzl.lzxxbxxm.png", "bundleId": "com.iquestint.TripJournal", "trackViewUrl": "https://itunes.apple.com/us/app/trip-journal/id341585937?mt=8&uo=4", "minimumOsVersion": "5.0", "artworkUrl60": "http://a320.phobos.apple.com/us/r30/Purple/v4/c2/fd/43/c2fd4391-9169-f238-ba51-d49671d436fa/Icon.png", "averageUserRating": 3.0}