{"contentAdvisoryRating": "9+", "features": ["iosUniversal"], "languageCodesISO2A": ["EN"], "ipadScreenshotUrls": ["http://a5.mzstatic.com/us/r30/Purple3/v4/a5/3f/e2/a53fe210-b4e3-4b06-543e-3330b5e905d2/screen480x480.jpeg", "http://a5.mzstatic.com/us/r30/Purple3/v4/61/7c/4f/617c4fe0-e89c-6588-639e-cd3b8829ef5d/screen480x480.jpeg", "http://a1.mzstatic.com/us/r30/Purple5/v4/2e/d4/f6/2ed4f6d6-f138-9705-9562-fe7ca213d2df/screen480x480.jpeg", "http://a3.mzstatic.com/us/r30/Purple1/v4/8b/92/b3/8b92b3bd-63dc-4a53-1eb4-512b7278098f/screen480x480.jpeg", "http://a4.mzstatic.com/us/r30/Purple5/v4/46/ab/9e/46ab9eed-621d-7816-6dbc-142230537178/screen480x480.jpeg"], "releaseDate": "2009-12-17T20:53:10Z", "currency": "USD", "artistId": 330462895, "userRatingCountForCurrentVersion": 90, "wrapperType": "software", "advisories": ["Infrequent/Mild Profanity or Crude Humor"], "genres": ["Reference", "Education"], "trackId": 341922306, "description": "Pleco is the ultimate Chinese learning companion - an integrated dictionary / document reader / flashcard system with fullscreen handwriting input and live OCR, from a company that's been making the world's best mobile Chinese learning apps since 2001.\n\nMajor features: ($ = paid add-on)\n\n• Amazing dictionaries. We include two lovely free ones built-in: the popular open-source CC-CEDICT, with over 100,000 frequently-updated entries, and our own PLC dictionary, with 78,000 more detailed entries and over 20,000 example sentences (with Pinyin). More than two dozen other dictionaries are available as free and paid ($) add-ons, including licensed titles from well-known publishers like Oxford, Longman, FLTRP, Tuttle, SLPH, and Commercial Press.\n\n• Powerful merged search: look up words by Chinese characters, Pinyin (spaces / tones optional), or English, with support for wildcards and full-text search. And no need to tediously flip between all of those dictionaries to find a word - just type in your search term and instantly get a combined, frequency-sorted result list.\n\n• Links and cross-references: easily look up character components, break down words into individual characters, look up lists of words containing a particular character, search across all dictionaries for example sentences containing a word, and even find synonyms / antonyms using our (experimental) free thesaurus add-on.\n\n• Gorgeous typography: see it for yourself in our screenshots - we think we're one of the best-looking Chinese dictionaries around. Alternate Kai/Song/Xing-style Chinese fonts are also available ($).\n\n• Mainland/HK/Taiwan-friendly: every part of Pleco supports both traditional and simplified characters, headword pronunciations can be shown in Zhuyin as well as in Pinyin, and we even support Cantonese search and display in our PLC dictionary.\n\n• Audio: iOS 7 users can take advantage of the free built-in Mandarin and Cantonese TTS system to hear pronunciations for words and example sentences. We also offer add-ons ($) with native-speaker Mandarin and Cantonese recordings, plus higher-quality Mandarin text-to-speech system options.\n\n• Document Reader: bring in text from the clipboard and tap on words in it to instantly look them up. Upgrade ($) adds support for tap-lookups in text, HTML, DOC, DOCX, PDF, and EPUB files, and in embedded lyrics in songs and podcasts.\n\n• OCR: look up words simply by pointing your device's camera at them, or by tapping on them in a still image. ($)\n\n• Fullscreen handwriting: use your device's whole screen instead of just a little box. Extremely accurate and highly tolerant of stroke order mistakes. ($)\n\n• Flashcards: create a card from any dictionary entry with a single button tap, import premade word lists, use advanced memorization techniques like SRS, and study in a variety of modes including fill-in-the-blanks handwriting and tone drills. ($)\n\n• Stroke Order Diagrams: animations showing you how to draw each character; over 20,000 characters are covered. ($)\n\n• User dictionaries: create new dictionary entries right on your device as you encounter new words. ($)\n\n• Absolutely no ads.\n\nWe also offer famously excellent customer support and an active user community at http://www.plecoforums.com. And we're constantly working to make our products better; our sales and customer base have been growing for 12 years across 4 different mobile platforms. You can be confident that we'll still be fixing bugs and adding features for years to come.\n\nOur paid add-ons can be transferred to other devices that link to your iTunes account just like any other paid iTunes content; simply install our free app, open up the \"Add-ons\" screen, and tap on the \"Restore Purchases\" button to activate your purchase on each device.\n\nPlease contact us at support@pleco.com, via the form at http://www.pleco.com/contact.html, or using the in-app \"Contact Support\" command with any questions - we'll be delighted to hear from you.", "artistName": "Pleco Software", "artworkUrl512": "http://a605.phobos.apple.com/us/r30/Purple5/v4/83/b3/4f/83b34fa9-8681-f046-575e-bb8b44f9ea19/mzl.zfeghpaa.png", "version": "3.2.3", "primaryGenreId": 6006, "primaryGenreName": "Reference", "fileSizeBytes": "88794459", "price": 0.0, "isGameCenterEnabled": false, "trackCensoredName": "Pleco Chinese Dictionary", "genreIds": ["6006", "6017"], "trackName": "Pleco Chinese Dictionary", "releaseNotes": "3.2.3:\n\n• More bug fixes.\n• Improved tap detection for example sentence audio buttons.\n• Option to display Cantonese before a card is revealed in flashcards.\n\nPreviously in 3.2.0:\n\n• iOS 8 / iPhone 6 / 6+ optimization\n• 64-bit support\n• Cantonese flashcards\n• Auto-generated Cantonese readings (in Mandarin-only dictionaries)\n• Option to repeat incorrect cards during (instead of at the end of) flashcard tests\n• Option to add a + button next to every example sentence to efficiently add those to flashcards\n• Support for auto-filling missing parts of flashcards\n• More intelligent search breakdowns\n• Performance improvements\n• Cantonese tone coloring\n• Option to enlarge Chinese characters in dictionary entries\n• OCR focus lock option (long-press focus button)\n• Support for radical characters in handwriting recognizer\n• Easy selection of / switching between multiple items in Lyrics Reader\n• Much faster reader text selection in EPUB / DOC files\n• Option to disable two-tap handwriting clear gesture\n• More reliable free audio\n• Lots and lots of other minor tweaks / bug fixes\n\nAs always, since Apple resets our review average with every update, we'd really appreciate it if you'd leave another review - don't have to write anything, just the star button will do. We deplore the fact that other developers put up nag screens asking for reviews, and would never do that ourselves, but reviews help us show up more prominently in search results, which leads to more users / more money to improve Pleco.", "sellerUrl": "http://www.pleco.com/pleco2ip.html", "screenshotUrls": ["http://a5.mzstatic.com/us/r30/Purple3/v4/fd/a7/21/fda7215e-70db-9096-8c0d-094a8933e2ac/screen322x572.jpeg", "http://a4.mzstatic.com/us/r30/Purple5/v4/31/0c/fa/310cfad9-c389-a6e8-24cf-6e2ef5b22e1f/screen322x572.jpeg", "http://a5.mzstatic.com/us/r30/Purple3/v4/cc/c8/e5/ccc8e54c-a2d8-1824-bde8-e8013ab30b14/screen322x572.jpeg", "http://a1.mzstatic.com/us/r30/Purple3/v4/8e/f9/f0/8ef9f010-e0fa-56fd-254a-10ba37c8d6f4/screen322x572.jpeg", "http://a4.mzstatic.com/us/r30/Purple1/v4/9b/61/af/9b61af37-1c74-d3b2-2817-f8604ded48bb/screen322x572.jpeg"], "userRatingCount": 3115, "trackContentRating": "9+", "formattedPrice": "Free", "artistViewUrl": "https://itunes.apple.com/us/artist/pleco-software/id330462895?uo=4", "kind": "software", "averageUserRatingForCurrentVersion": 5.0, "sellerName": "Pleco Software", "supportedDevices": ["iPhone4", "iPodTouchFifthGen", "iPad2Wifi", "iPadMini", "iPadThirdGen", "iPadFourthGen4G", "iPhone5s", "iPadMini4G", "iPhone4S", "iPadThirdGen4G", "iPhone5c", "iPhone5", "iPadFourthGen", "iPad23G"], "artworkUrl100": "http://a605.phobos.apple.com/us/r30/Purple5/v4/83/b3/4f/83b34fa9-8681-f046-575e-bb8b44f9ea19/mzl.zfeghpaa.png", "bundleId": "com.pleco.chinesesystem", "trackViewUrl": "https://itunes.apple.com/us/app/pleco-chinese-dictionary/id341922306?mt=8&uo=4", "minimumOsVersion": "7.1", "artworkUrl60": "http://a1032.phobos.apple.com/us/r30/Purple5/v4/54/f2/22/54f22263-d97a-a3ed-1a07-19545e25f107/AppIcon57x57.png", "averageUserRating": 4.0}