{"contentAdvisoryRating": "4+", "features": [], "languageCodesISO2A": ["EN"], "ipadScreenshotUrls": [], "releaseDate": "2009-12-08T21:04:52Z", "currency": "USD", "artistId": 317856073, "userRatingCountForCurrentVersion": 14, "wrapperType": "software", "advisories": [], "genres": ["Photo & Video", "Utilities"], "trackId": 342654226, "description": "Dash of Color FREE lets you give an extra boost of color to any photo that could benefit from that \"something extra\". Giving each shot its own special artistic \"kick\" and individual feel, this simple and fun to use app brings back the joy of finger painting as you transform black and white pics into dramatic works of art.\n\nLove it! \n“I’m like seriously hooked!!!!”\n-Sweetaspepper\n\nGET IT \n“makes photos look awesome and its a free app!”\n-TheRooftopBuddy \n\nHow many times have you looked at a perfectly composed photo and thought that it would look so much better as a classic black and white shot? Or better yet, a black and white with just the right amount of color splashed in for a dramatic effect. Sadly, you have no photography experience and you just can't bring yourself to go to one of those pricey studios or buy expensive, hard to use photo editing software. \n \nWith Dash of Color FREE on your iPhone, iPod touch, or iPad, you'll be able to take the same glamorous shots that you're used to and customize the images to give them that dash of color, just like the pros. The best part is that it's easy to use and totally free of charge! Choose an image and Dash of Color will transform it into a classic black and white shot.  Consider this a canvas upon which you will create your masterpiece. Just paint with your finger to add dashes of color in all the right places.\n\nFEATURES: \n - Simple, yet refined user interface\n - NEW Zoom feature!\n - Undo (saves your every move from the very beginning)\n - Paint in color\n - Paint in black & white (to erase)\n - Twitter and email integration\n - Post your photos to our public gallery to share  \n   your work and see others!\n\nDash of Color FREE is \"goof proof.\" The controls are easy to use and the \"Undo\" feature remembers every edit you make. With unlimited \"Undo's\" you can go back as many times as needed to make changes. Dash of Color FREE offers many of the very same tools and effects that the pros use.  If you think that a certain area requires a smaller brush, just zoom in for detail. If you think that you've made a mistake, or want to see how another color would look in this one's place, no problem. Paint in either color or black and white, to continually alter your shot until you're 100% happy with the final outcome. With the new zoom feature, you can even zoom in to work on more intricate areas with ease! \n\nYou will create professional looking photographs on your iPhone, iPod touch, or iPad, and you'll do it without spending a single penny. Download Dash of Color FREE now and let everyone see the world from your point of view. \n\nFree the Apps! brings you the quality of paid apps for free. We have registered over 37 million total downloads. Your continued support allows us to bring you more updates and apps for free. If you haven't gotten a chance to try out our other top free apps, check them out and spread the word! Thanks! :D \n\nfreetheapps.com \nfacebook.com/freetheapps \ntwitter.com/freetheapps", "artistName": "John Temple Group Pty Ltd.", "artworkUrl512": "http://a211.phobos.apple.com/us/r30/Purple/v4/0d/31/99/0d3199f8-6b2d-ce9a-80d8-85c795009a24/mzl.pfxyowwf.png", "version": "5.1", "primaryGenreId": 6008, "primaryGenreName": "Photo & Video", "fileSizeBytes": "11458181", "price": 0.0, "isGameCenterEnabled": false, "trackCensoredName": "Dash of Color FREE", "genreIds": ["6008", "6002"], "trackName": "Dash of Color FREE", "releaseNotes": "This Version: \n\n- We have resolved a series of IOS 7 bugs\n\nThanks to everyone for the continued support for Dash of Color. We will continue to roll out new features based on your suggestions, so keep them coming. \n\nPlease keep us motivated by providing us a 5 star rating and leaving feedback. If you don’t like something about our app or would like to see new features, let us know and we will add these in the future releases. \n\nVisit our Facebook page to share your photo creations, with the rest of the Free The Apps community. Like our page and let us know if there is any way that we can make Dash of Color better for you!", "sellerUrl": "http://www.freetheapps.com/our-apps/dash-of-color-free", "screenshotUrls": ["http://a5.mzstatic.com/us/r30/Purple2/v4/8c/f5/6a/8cf56a7d-ffa5-8bdc-cbf0-eb6ac8333312/screen1136x1136.jpeg", "http://a1.mzstatic.com/us/r30/Purple/v4/ce/b8/99/ceb8991d-00ce-ec18-3dfd-a60b4b1958fc/screen1136x1136.jpeg", "http://a4.mzstatic.com/us/r30/Purple2/v4/cf/7c/c3/cf7cc36e-318e-9034-547a-6e485c4b8c47/screen1136x1136.jpeg"], "userRatingCount": 74190, "trackContentRating": "4+", "formattedPrice": "Free", "artistViewUrl": "https://itunes.apple.com/us/artist/john-temple-group-pty-ltd./id317856073?uo=4", "kind": "software", "averageUserRatingForCurrentVersion": 2.5, "sellerName": "John Temple Group Pty Ltd.", "supportedDevices": ["iPadMini", "iPad3G", "iPodTouchThirdGen", "iPhone5c", "iPadThirdGen4G", "iPad2Wifi", "iPhone-3GS", "iPodTouchourthGen", "iPadFourthGen4G", "iPadWifi", "iPhone4", "iPadFourthGen", "iPhone4S", "iPodTouchFifthGen", "iPadThirdGen", "iPad23G", "iPhone5s", "iPadMini4G", "iPhone5"], "artworkUrl100": "http://a211.phobos.apple.com/us/r30/Purple/v4/0d/31/99/0d3199f8-6b2d-ce9a-80d8-85c795009a24/mzl.pfxyowwf.png", "bundleId": "com.freetheapps.splashofcolor", "trackViewUrl": "https://itunes.apple.com/us/app/dash-of-color-free/id342654226?mt=8&uo=4", "minimumOsVersion": "5.0", "artworkUrl60": "http://a901.phobos.apple.com/us/r30/Purple6/v4/49/c1/8d/49c18d2a-b953-abcc-68b4-f74c961aad80/Icon.png", "averageUserRating": 2.5}