{"contentAdvisoryRating": "4+", "features": [], "languageCodesISO2A": ["EN"], "ipadScreenshotUrls": [], "releaseDate": "2009-12-29T08:00:00Z", "currency": "USD", "artistId": 289234278, "userRatingCountForCurrentVersion": 6, "wrapperType": "software", "advisories": [], "genres": ["Utilities", "Entertainment"], "trackId": 346224003, "description": "JOIN OVER 4,000,000 USERS IN DOWNLOADING THE BEST NOTES & REMINDERS APP IN THE APP STORE!\n\nNow three apps on one:\n\n√ A VERSATILE NOTES AND REMINDERS APP\nNotefuly isn't just a note taking and organizing app - it's a versatile tool to create fun and creative notes and reminders. Add alarms to the notes. Use our \"task\" notes for checklists. Select from our dozens of visual note styles. Organize your notes into an unlimited number of sortable category folders. Password protect your notes. Share and collaborate on notes with others. The list goes on! Use Notefuly to create personal reminders, shopping lists, school notes, special notes to your loved ones, and more.\n\n√ ADD NOTES ON YOUR LOCKSCREEN\nAdd notes to your lockscreen so you'll never forget a thing. How is this different from other apps? Putting notes on your lockscreen positions them up front so you don't have to unlimitedock your phone to view them.\n\n√ OVER 10,000 WALLPAPERS\nNotefuly now gives you access to over 10,000 wallpapers. Use them as your iPhone/iTouch wallpaper, or put them behind your Notefuly notes and reminders. (Upgrade required)\n\n\nWHAT PEOPLE ARE SAYING:\n\n√ Notefuly is a Top 100 Paid Utility in over 40 Regions, with over 3 years of over 3 million satisfied users\n\n√ TouchReviews.net: 41/2 out of 5 Stars - \"Notefuly is a visually stunning sticky notes app which will never let you forget anything!\"\n\n√ 148apps.com: 41/2 out of 5 Stars, Utility of the Week - \"Notefuly is extremely customizable. You can do basically anything you like with your notes. You can’t beat the price for such a useful and versatile tool.\"\n\n\nFULL FEATURE LIST:\n\n√ Dozens of styles of notes and objects you can add text to ranging from multi-colored sticky notes, a variety of scrap papers, speech bubbles, signs, calendars, task notes, and more.\n\n√ Dozens of backgrounds to choose from including beautifully designed textures such as corkboard, wood, metal, and paper, as well as solid colors, and the ability to use any photo from your Camera Roll or take a new one!  Also access a library of over 10,000 backgrounds (internet connection required).\n\n√ Full customization of your notes with numerous font styles, sizes and colors to choose from. Even scale and rotate your notes!\n\n√ (NEW) Task notes for creating checklists of to-do's (Upgrade required)\n\n√ (NEW) Add photos to your noteboard (Upgrade required)\n\n√ (NEW) Set location-based reminders to your notes (Upgrade required)\n\n√ (NEW) Add alarms to your notes, with the option to make them recurring (Upgrade required)\n\n√ (NEW) View your notes in List View for a more traditional list format (Upgrade required), or your Noteboard for a full visual experience \n\n√ Organize your notes into an unlimited number of customizable and sortable category folders (Upgrade required)\n\n√ (NEW) Share and collaborate on notes with others via Wifi or Bluetooth\n\n√ Password protect the entire app or just a category of notes (Upgrade required)\n\n√ \"Quick Note\" feature to quickly create checklist tasks while on the go (Upgrade required)\n\n√ Preview feature which allows you to preview your lockscreen with your current Notefuly layout to give you an idea of how it will look without having to leave the app\n\n√ Email your notes directly from the app\n\n√ Post your notes on Facebook directly within Notefuly\n\n√ Note Store now open!  Browse and download new styles of notes\n\n\nStay tuned, we're constantly listening and working to improve Notefuly!  Please email us with any suggestions info@tapfactoryapps.com\n\nFollow Us on Twitter (http://twitter.com/tapfactory) or Facebook (http://tiny.cc/tapfactoryapps)", "artistName": "TapFactory", "artworkUrl512": "http://a1410.phobos.apple.com/us/r30/Purple6/v4/de/8a/63/de8a630a-da1d-2837-507c-0f2a8a716855/mzl.xtweilfu.png", "version": "4.3.03", "primaryGenreId": 6002, "primaryGenreName": "Utilities", "fileSizeBytes": "42540065", "price": 0.0, "isGameCenterEnabled": false, "trackCensoredName": "Notefuly (Free) - Reminders & Notes w/ Alarms", "genreIds": ["6002", "6016"], "trackName": "Notefuly (Free) - Reminders & Notes w/ Alarms", "releaseNotes": "- Fixes", "sellerUrl": "http://tapfactoryapps.com", "screenshotUrls": ["http://a5.mzstatic.com/us/r30/Purple/v4/22/9a/31/229a3181-f17c-b873-722e-2a5529bf5884/screen1136x1136.jpeg", "http://a3.mzstatic.com/us/r30/Purple4/v4/f3/d2/fc/f3d2fcfb-e351-43d4-3e35-2b3a9d7e842e/screen1136x1136.jpeg", "http://a3.mzstatic.com/us/r30/Purple4/v4/1c/1d/32/1c1d32c1-869f-ef4e-4b06-94cbdaa819f7/screen1136x1136.jpeg", "http://a5.mzstatic.com/us/r30/Purple/v4/4d/03/28/4d0328e1-93ba-2a2c-1014-2a9a6a75addd/screen1136x1136.jpeg", "http://a5.mzstatic.com/us/r30/Purple/v4/96/5d/34/965d34e1-a207-c84b-03a2-7ce863ace87b/screen320x320.jpeg"], "userRatingCount": 27620, "trackContentRating": "4+", "formattedPrice": "Free", "artistViewUrl": "https://itunes.apple.com/us/artist/tapfactory/id289234278?uo=4", "kind": "software", "averageUserRatingForCurrentVersion": 2.0, "sellerName": "TapFactory", "supportedDevices": ["iPadMini", "iPhone4S", "iPadMini4G", "iPhone5s", "iPad23G", "iPadThirdGen4G", "iPadFourthGen4G", "iPhone4", "iPodTouchFifthGen", "iPadFourthGen", "iPad2Wifi", "iPadThirdGen", "iPhone5", "iPhone5c"], "artworkUrl100": "http://a1410.phobos.apple.com/us/r30/Purple6/v4/de/8a/63/de8a630a-da1d-2837-507c-0f2a8a716855/mzl.xtweilfu.png", "bundleId": "com.tapfactory.push", "trackViewUrl": "https://itunes.apple.com/us/app/notefuly-free-reminders-notes/id346224003?mt=8&uo=4", "minimumOsVersion": "7.0", "artworkUrl60": "http://a1949.phobos.apple.com/us/r30/Purple5/v4/23/a9/71/23a971f9-a339-535b-0702-4afbdba12440/icon.png", "averageUserRating": 3.5}