{"contentAdvisoryRating": "4+", "features": [], "languageCodesISO2A": ["DA", "EN", "FR", "DE", "IT", "JA", "KO", "NO", "PL", "PT", "RU", "ZH", "ES", "SV"], "ipadScreenshotUrls": [], "releaseDate": "2010-02-10T19:42:11Z", "currency": "USD", "artistId": 322350661, "userRatingCountForCurrentVersion": 8, "wrapperType": "software", "advisories": [], "genres": ["Social Networking", "Productivity"], "trackId": 352791835, "description": "HeyTell® is a cross-platform voice messenger that allows you to instantly talk with friends and family. No account needed—just start the app, choose a contact, and push the button to start talking!\n\n- Send and receive voice messages with other HeyTell users with the press of a single button\n\n- Voice messages are quicker than SMS—and free!\n\n- Very low data usage, no more than sending an email\n\n- PUSH NOTIFICATIONS alert you whenever a voice message is received and the app is closed\n \n* TIP: If you did not enable Pushes on initial install, open the Apple Settings app, select Notifications, ensure it's set to On, select HeyTell, and ensure that Badges and Alerts are both set to On.\n\n- Works on 3G, 4G, EDGE, 1X or WiFi (i.e., any Internet connection)\n\n- Superior audio quality: At 16 kHz, HeyTell delivers twice the frequency range of a cell phone call\n\n- Favorites: Favorite and export messages you like to email or Facebook!\n\n- Export messages you record to Facebook, Twitter, Email, and more!\n\n- Extras: Use the in-app purchase function to set alert tones, send messages to groups, change your voice, automatically expire and batch-delete messages, and add emojis to your name! \n\n- Quickly friend, unfriend, or block contacts. Adding contacts as friends ensures that you can always quickly find them by tapping the To: field and tapping \"Friends.\"\n\n- Choose from three different privacy levels to control how users can contact you without an invite:\n\n  + Low Privacy: Anyone who knows your contact information can connect with you without an invite.\n\n  + Medium Privacy: Anyone who knows your contact information and is friends with one of your HeyTell friends can connect with you. Otherwise, they must invite you to connect.\n\n  + High Privacy: No one can connect with you until you accept their invitation.\n\nNOTE: Carriers may charge you & your recipient for SMS invites, but email invites & Low privacy direct connections  should be free.\n\n- If you want to, share your location with selected contacts while you talk \n\n* TIP: To send your location information to a contact, you must have the Maps page open (tap the Target button) when you send the HeyTell message. For privacy reasons, HeyTell does not send your location unless you approve and have Maps open.\n\n- Conversations can be saved and replayed offline, or deleted on-demand \n\n* TIP: Swipe left or right on the conversation and click the DELETE button to delete messages.\n\n- All data and audio you transmit to HeyTell and your friends is encrypted in transit\n\n- Earpiece and speakerphone functionality: Press the  SPEAKER button to toggle earpiece vs. speakerphone mode (If you find earpiece sound is too low, enable the speaker)\n\n- Supports iPhone, iPad and iPod Touch devices (2G and 3G iPod Touches require external microphone)\n\n- You do not need to share personal information to connect with HeyTell contacts. See http://heytell.com/privacy and http://heytell.com/faq for more information about connecting without sharing phone numbers or email addresses!\n\nUse HeyTell as a walkie talkie, intercom, or instant voice messaging system to send quick voice messages to friends and family with iPhones or iPods. Use the integrated geolocation feature to find your friends when they've given you bad directions and you're just around the corner!\n\n\nProblems or questions? \n\n- Check out our FAQ at http://heytell.com/faq\n\n- Email us at support@heytell.com! \n\n- Follow us on Twitter @ https://twitter.com/heytell\n\n- \"Like\" us on Facebook at https://facebook.com/heytell!\n\n\n* TIP: IF YOU GET AN \"INBOX FULL\" message, there's no need to delete the app or messages: This just means that your friend has to listen or reply to the messages you sent before you can continue to send them messages. Once they listen or respond, you can keep on talking!", "artistName": "Voxilate", "artworkUrl512": "http://a279.phobos.apple.com/us/r30/Purple3/v4/e2/1f/47/e21f4757-4aa0-5210-3506-4d0b8bd07cd9/mzl.lwawdyit.png", "version": "3.2.4", "primaryGenreId": 6005, "primaryGenreName": "Social Networking", "fileSizeBytes": "13516338", "price": 0.0, "isGameCenterEnabled": false, "trackCensoredName": "HeyTell", "genreIds": ["6005", "6007"], "trackName": "HeyTell", "releaseNotes": "Fixes an issue where speaker mode does not stay selected when HeyTell is fully restarted from App Switcher.\n\nFixes email and text invite issue, where sending an invite exited the dialog but did not send.", "sellerUrl": "http://heytell.com", "screenshotUrls": ["http://a3.mzstatic.com/us/r30/Purple/v4/82/8a/30/828a30b4-b7ee-f354-4eca-0eb279588add/screen1136x1136.jpeg", "http://a4.mzstatic.com/us/r30/Purple/v4/6a/20/b4/6a20b458-ff3f-c920-e2f4-2974f733e74e/screen1136x1136.jpeg", "http://a2.mzstatic.com/us/r30/Purple/v4/02/ef/08/02ef089d-db02-cf2c-d332-bc15103a1d7b/screen1136x1136.jpeg", "http://a2.mzstatic.com/us/r30/Purple/v4/25/d5/90/25d590f9-6db0-c394-4ee5-36f5a85c394c/screen1136x1136.jpeg"], "userRatingCount": 52502, "trackContentRating": "4+", "formattedPrice": "Free", "artistViewUrl": "https://itunes.apple.com/us/artist/voxilate/id322350661?uo=4", "kind": "software", "averageUserRatingForCurrentVersion": 4.5, "sellerName": "Voxilate", "supportedDevices": ["iPhone-3GS", "iPhone4", "iPadThirdGen", "iPodTouchFifthGen", "iPad2Wifi", "iPadMini4G", "iPadFourthGen", "iPhone5", "iPad23G", "iPhone5s", "iPad3G", "iPadWifi", "iPadFourthGen4G", "iPadThirdGen4G", "iPadMini", "iPhone5c", "iPhone4S", "iPodTouchThirdGen", "iPodTouchourthGen"], "artworkUrl100": "http://a279.phobos.apple.com/us/r30/Purple3/v4/e2/1f/47/e21f4757-4aa0-5210-3506-4d0b8bd07cd9/mzl.lwawdyit.png", "bundleId": "com.voxilate.ptt", "trackViewUrl": "https://itunes.apple.com/us/app/heytell/id352791835?mt=8&uo=4", "minimumOsVersion": "4.3", "artworkUrl60": "http://a1328.phobos.apple.com/us/r30/Purple1/v4/5d/07/54/5d0754d8-b3ea-1d6c-2ca5-bcf7002aaa73/icon-ios6.png", "averageUserRating": 4.5}