{"contentAdvisoryRating": "4+", "features": [], "languageCodesISO2A": ["EN"], "ipadScreenshotUrls": ["http://a2.mzstatic.com/us/r30/Purple4/v4/b9/0c/11/b90c1182-160a-220f-d422-d0d1ea2b0a69/screen480x480.jpeg", "http://a2.mzstatic.com/us/r30/Purple/v4/d0/b3/f6/d0b3f6c2-ae40-e76f-54f2-e4d2dcc446f4/screen480x480.jpeg", "http://a4.mzstatic.com/us/r30/Purple4/v4/f7/fe/3d/f7fe3d91-c775-de08-3515-6e22c5002ffb/screen480x480.jpeg", "http://a5.mzstatic.com/us/r30/Purple2/v4/c3/00/c8/c300c865-3c70-380c-35b0-1703a52a4241/screen480x480.jpeg", "http://a2.mzstatic.com/us/r30/Purple6/v4/e0/be/87/e0be87ec-71ef-b4d2-4bf6-c62825b804a1/screen480x480.jpeg"], "releaseDate": "2010-10-09T07:00:00Z", "currency": "USD", "artistId": 315556631, "userRatingCountForCurrentVersion": 38, "wrapperType": "software", "advisories": [], "genres": ["Entertainment"], "trackId": 355460798, "description": "BLACK FRIDAY SALE OF 50% OFF FROM REGULAR PRICE $9.99 FOR A LIMITED TIME!!! \n\nAvailable only on the App Store, Inspire Pro delivers an amazing painting, drawing and sketching experience to your iPad. Our proprietary painting engine Sorcery™, based on OpenGL, takes full advantage of the GPU to render brush strokes with brilliant 64-bit color, laser-sharp sub-pixel precision and incredibly fast speed.\n\nWhile the strokes of a wet oil paint brush look beautiful on their own, the breathtaking blending effects of a dry brush will absolutely stun you. Graze the canvas with a tiny bit of pressure to add a subtle blur to your artwork or use stronger pressure to actually mix existing colors on the canvas together to create new ones! \n\nWhether you are a beginner, expert or somewhere in-between, you will enjoy the simplicity and power of Inspire Pro.\n\nBrushes\n● 70 high quality brushes to choose from, divided into 7 sets: Oil Paint, Airbrushes, Basic Shapes, Graphite Pencils, Wax Crayons, Markers and Chalk\n● 60 more brushes are available in the Inspire Pro Shop, divided into 6 sets: Complex Shapes, Paint Splatter, Spray Paint, Shape Outlines, Charcoal and Patterns\n● All brushes can be used as a Wet Brush, Dry Brush (Blending) or Eraser\n\nBrush Settings\n● Opacity\n● Size\n● Rotation\n● Pressure\n● Paint load amount\n● Automatic paint reload\n● Glaze\n● Paint blending mode\n● Spacing\n● Scatter\n● Taper size\n● Taper opacity\n● Random size\n● Random rotation\n● Surface size\n● Surface rotation\n\nPainting\n● 3 canvas sizes to choose from: Screen (4:3), Square (1:1) and Widescreen (16:9)\n● All device orientations are supported, all the time — switch from portrait to landscape painting with ease\n● 1000 levels of undo and redo are available\n● 3 finger pan gestures can be used to quickly change brush size, opacity and pressure without opening a menu\n● The eye dropper tool can be used with a touch and hold gesture to select paint colors already on the canvas\n● The canvas can be moved around, rotated and zoomed in and out up to 6400%\n● There are many different options and settings available to customize the UI to fit your painting style and workflow\n\nCanvas Playback Video Recording\n● Brush strokes are automatically recorded as you paint without any loss of speed\n● You can play the video of your artwork being created stroke-by-stroke directly in the gallery\n● A Canvas Playback video can be exported to your Photos, Email or iTunes Documents\n● Exported videos are always 1080p, regardless of the chosen canvas size or orientation\n● A 3 second intro is added to the beginning of an exported video so that you can preview the final artwork before watching it unfold\n\nColor Picker\n● Choose any paint color you can dream of right away with the natural color picker\n● Hue, saturation and brightness sliders accompany a large color circle and an extra-wide opacity slider\n● Your latest colors are saved to a palette automatically while you paint\n● You can also save your favorite colors to a palette with drag and drop\n\nPressure Sensitive Stylus Support\n● Wacom Intuos Creative\n● Adonit Jot Touch\n● Ten One Design Pogo Connect\n● HEX3 Jaja\n\nSaving, Importing and Exporting\n● Paintings are automatically saved in your gallery and easily exported to your Photos\n● Inspire Pro files include your artwork's image, video and all associated metadata, for the ultimate back-up\n● Images can be imported from your Photos, iTunes, Dropbox or the camera and positioned, rotated and scaled onto a new canvas\n● Paintings can be sent via email from within the app\n● Paintings can be uploaded directly to Dropbox, Facebook, Twitter and Flickr\n● Paintings can be printed directly from the app (AirPrint printer required) or ordered online through direct CanvasPop integration\n● Paintings can be exported at resolutions of up to 4 times the original, using the free Inspire Exporter desktop app\n\nVisit KiwiPixel.com for more screenshots, videos and paintings in the gallery.", "artistName": "KiwiPixel", "artworkUrl512": "http://a719.phobos.apple.com/us/r30/Purple3/v4/66/9f/0f/669f0f8b-1753-768e-55f0-7f372d812a42/mzl.mrhluugw.png", "version": "2.4.3", "primaryGenreId": 6016, "primaryGenreName": "Entertainment", "fileSizeBytes": "235873897", "price": 4.99, "isGameCenterEnabled": false, "trackCensoredName": "Inspire Pro — Paint, Draw & Sketch", "genreIds": ["6016"], "trackName": "Inspire Pro — Paint, Draw & Sketch", "releaseNotes": "● iOS 8 ready\n● Artwork is now uploaded directly to Twitter and embedded in a tweet instead of using Twitpic and including a link to the image in a tweet\n● Several bug fixes\n\nIf you enjoy using Inspire Pro, please consider leaving a positive review for us — you'd be surprised how much it helps a small team like ours!", "sellerUrl": "http://kiwipixel.com", "screenshotUrls": [], "userRatingCount": 3342, "trackContentRating": "4+", "formattedPrice": "$4.99", "artistViewUrl": "https://itunes.apple.com/us/artist/kiwipixel/id315556631?uo=4", "kind": "software", "averageUserRatingForCurrentVersion": 4.5, "sellerName": "KiwiPixel", "supportedDevices": ["iPadWifi", "iPad2Wifi", "iPadThirdGen4G", "iPadMini", "iPad3G", "iPadMini4G", "iPad23G", "iPadFourthGen4G", "iPadFourthGen", "iPadThirdGen"], "artworkUrl100": "http://a719.phobos.apple.com/us/r30/Purple3/v4/66/9f/0f/669f0f8b-1753-768e-55f0-7f372d812a42/mzl.mrhluugw.png", "bundleId": "com.kiwipixel.inspirePro", "trackViewUrl": "https://itunes.apple.com/us/app/inspire-pro-paint-draw-sketch/id355460798?mt=8&uo=4", "minimumOsVersion": "5.1.1", "artworkUrl60": "http://a1155.phobos.apple.com/us/r30/Purple4/v4/36/69/70/36697063-15f1-1e87-72c8-7ab9fc893b84/Icon_iOS6.png", "averageUserRating": 4.5}