{"contentAdvisoryRating": "4+", "features": [], "languageCodesISO2A": ["AR", "NB", "CA", "CS", "DA", "NL", "EN", "FI", "FR", "DE", "EL", "HE", "HU", "ID", "IT", "JA", "KO", "MS", "PL", "PT", "RO", "RU", "ZH", "SK", "ES", "SV", "TH", "ZH", "TR", "VI"], "ipadScreenshotUrls": [], "releaseDate": "2010-03-15T17:03:10Z", "currency": "USD", "artistId": 319726822, "userRatingCountForCurrentVersion": 1, "wrapperType": "software", "advisories": [], "genres": ["Navigation"], "trackId": 361273585, "description": "Plane Finder Free shows live moving planes on a worldwide map. Watch planes on the map or view with Augmented Reality mode.\n\nSimply tap a plane to see the flight number and airline. We've even included 23 different plane markers for easy identification.\n\nYou can even use Augmented Reality (AR) view to identify planes overhead using your device camera.\n\nPlane Finder has been top rated and top ranking since 2009 and covers most of the world, tracking 12,000+ planes simultaneously.\n\nIf you like this app you'll love the full version of Plane Finder.\n\nThe full version includes a huge array of additional features such as playback, logos, powerful search, unlimited free filters and alerts, route data, airport departure boards, free augmented reality view and much much more.\n\nPlane Finder has been featured by Gizmodo, CNN, GMA, BBC, Sunday Times, Mail on Sunday, CNET, Wired, GQ Magazine and many more. We have millions of happy users and Plane Finder is regularly updated with innovative new features. Our support team always listen to and reply to feedback.\n\nAt a glance our worldwide coverage includes - \n\n• Europe 95% - realtime \n• North America – 100% via slightly US delayed data – Nationwide realtime ADS-B network in place and capturing 95% of ADS-B equipped aircraft \n• Rest of World – Excellent coverage in Australia, New Zealand, Central America, Brazil, Japan, Taiwan, Dubai, India, Malaysia, Thailand, South Korea, Maldives, Mauritius, Singapore, Hong Kong and many more countries \n\nImportant Note: \nPlane Finder works by picking up real time ADS‐B signals used by aircraft to transmit positional data to land based receivers. This technology is faster than traditional radar and is used for air traffic control and navigation. ADS‐B is not used by all airlines or aircraft, however this is changing and the number of aircraft tracked by ADS‐B is increasing all of the time. Traditional radar type data in near real time is also included for North America; this is subject to a short time delay. \n\n\nDisclaimer: The use of the information presented using Plane Finder is strictly limited to pursuing enthusiast activities (i.e. for entertainment purposes), which specifically exclude any activities that might endanger yourself or the lives of others. \nUnder no circumstances will the developer of this application be held responsible for incidents resulting from the use of the data or its interpretation or its use contrary to this agreement.", "artistName": "pinkfroot limited", "artworkUrl512": "http://a1008.phobos.apple.com/us/r30/Purple5/v4/27/81/aa/2781aa77-18a1-f2b1-063b-fa21ee1f8015/mzl.ydzrnzjr.png", "version": "7.4.2", "primaryGenreId": 6010, "primaryGenreName": "Navigation", "fileSizeBytes": "24191355", "price": 0.0, "isGameCenterEnabled": false, "trackCensoredName": "Plane Finder Free", "genreIds": ["6010"], "trackName": "Plane Finder Free", "releaseNotes": "Thanks as always for all of your feedback and comments. \nWe do listen! This update includes... \n\n• Fixes for AR, no more crashing there when camera access disabled\n• iPhone 6 & 6 Plus compatibility\nThe app now looks stunning on these new devices.  No more zoomed mode for us!\n• iOS 8 enhancements and performance improvements\n• We have fixed a few bugs too - They always creep in but we try and squish them as fast as we can\n\nWe hope you've noticed that our coverage gets better and better too. Thank you to everyone that shares data and host receivers for us. Let us know if you want to be a part of our network.\n\nEach new version wipes out old reviews so please help us by leaving a new review. You should be prompted in a few days time! \n\nWe cannot reply to reviews so if you have any feedback for us please email support@pinkfroot.com - we always reply.", "sellerUrl": "http://www.pinkfroot.com", "screenshotUrls": ["http://a1.mzstatic.com/us/r30/Purple3/v4/5d/a6/23/5da62397-5de8-005b-f8ed-35f0b0457acc/screen1136x1136.jpeg", "http://a3.mzstatic.com/us/r30/Purple3/v4/b0/21/fb/b021fb6d-804e-9165-b3af-3e5674dd833f/screen1136x1136.jpeg", "http://a1.mzstatic.com/us/r30/Purple3/v4/de/44/f2/de44f2f6-2c6d-9d2b-24e8-f890999f831e/screen1136x1136.jpeg", "http://a3.mzstatic.com/us/r30/Purple3/v4/f0/b2/ec/f0b2ec9d-1808-0d2a-7c9a-c411bac7cf00/screen1136x1136.jpeg", "http://a1.mzstatic.com/us/r30/Purple5/v4/2f/31/b8/2f31b8d9-110a-6341-a898-c883ef16a39f/screen1136x1136.jpeg"], "userRatingCount": 705, "trackContentRating": "4+", "formattedPrice": "Free", "artistViewUrl": "https://itunes.apple.com/us/artist/pinkfroot-limited/id319726822?uo=4", "kind": "software", "averageUserRatingForCurrentVersion": 3.0, "sellerName": "pinkfroot limited", "supportedDevices": ["iPad23G", "iPhone5c", "iPhone5s", "iPhone4S", "iPadThirdGen", "iPadMini4G", "iPadMini", "iPadFourthGen", "iPadFourthGen4G", "iPhone4", "iPadThirdGen4G", "iPhone5", "iPad2Wifi", "iPodTouchFifthGen"], "artworkUrl100": "http://a1008.phobos.apple.com/us/r30/Purple5/v4/27/81/aa/2781aa77-18a1-f2b1-063b-fa21ee1f8015/mzl.ydzrnzjr.png", "bundleId": "uk.co.leeus.planefinderfree", "trackViewUrl": "https://itunes.apple.com/us/app/plane-finder-free/id361273585?mt=8&uo=4", "minimumOsVersion": "7.0", "artworkUrl60": "http://a1882.phobos.apple.com/us/r30/Purple5/v4/a9/f6/6f/a9f66f48-fd1e-8a23-96c7-3ec7050db36a/AppIconFree60x60_U00402x.png", "averageUserRating": 2.5}