{"contentAdvisoryRating": "4+", "features": ["gameCenter"], "languageCodesISO2A": ["NL", "EN", "FR", "DE", "IT", "ES"], "ipadScreenshotUrls": ["http://a3.mzstatic.com/us/r30/Purple/v4/9e/ab/13/9eab1310-04ef-8ed4-160a-ae0bb1dc23c2/screen480x480.jpeg", "http://a5.mzstatic.com/us/r30/Purple/v4/46/32/ce/4632ce97-29c4-38fa-66c6-b423644cb3b0/screen480x480.jpeg", "http://a2.mzstatic.com/us/r30/Purple/v4/b1/9b/93/b19b93e6-07bf-4405-56f9-c7be2ceddfb5/screen480x480.jpeg", "http://a4.mzstatic.com/us/r30/Purple/v4/6a/76/80/6a7680b2-6d9e-b2d2-5035-5219a4b2cb68/screen480x480.jpeg", "http://a1.mzstatic.com/us/r30/Purple/v4/46/6a/8c/466a8cf9-d8c3-53cb-77e9-693a3d4a79e4/screen480x480.jpeg"], "releaseDate": "2010-04-01T20:45:16Z", "currency": "USD", "artistId": 284800461, "userRatingCountForCurrentVersion": 4226, "wrapperType": "software", "advisories": [], "genres": ["Games", "Entertainment", "Action", "Racing"], "trackId": 363998989, "description": "Real Racing HD offers the most realistic racing experience available on iPad. With all the content of the iPhone version plus enhanced features, graphics and gameplay to take full advantage of what iPad and iOS4.2 are capable of, this is hand-held racing like you’ve never seen before. Are you ready for all the excitement, competition and glory that only real championship racing can deliver?\n\n★  5/5 - Appletell: “Real Racing HD is iPad racing at its best”\n★  5/5 - MacLife: “Sharp, detailed visuals with a great sense of speed. Excellent tilt controls”\n★  4/4 - Slide to Play “possibly the most visually impressive game available on the App Store”\n★   4.5/5 - Macworld: “Real Racing HD and the iPad were basically made for each other”\n★   8.5/10 – IGN: “the entire game has been bumped to the next level… Real Racing HD is simply stunning”\n\n✓  NEW ► Online multiplayer via Game Center\n✓  NEW ► Optimized for iOS4.2 including multitasking\n✓  NEW ► View achievements and leaderboards through Game Center\n✓  Optimized for iPad with awesome, realistic controls and beautiful graphics\n✓  12 stunning, unique tracks\n✓  Massive single player career mode. Win 76 events to unlock 48 cars.\n✓  Local multiplayer via Wi-Fi or Bluetooth\n✓ Time Trial mode with ‘Ghost Car’ option\n✓  Global online leagues and leaderboards via cloudcell.com\n✓ Cockpit or external camera view\n✓ Watch instant replays and auto-upload to YouTube\n✓ Touch or tilt to steer with highly realistic and intuitive controls\n✓  Customize your ride with your own images or choose from a range of car skins\n✓  Play songs from your personal music library while racing\n\nRACE IT YOUR WAY\nReal Racing HD now has 6 game modes. Get behind the wheel for a Quick Race or work your way up from rookie to world champion in the massive Career Mode. Slice off another split second in Time Trial, join an Online League or challenge friends and rivals in Local or all-new Online Multiplayer via Game Center*. However you want to play, Firemint Real Racing is the most realistic and fun iPad racer yet!\n\nREALISTIC RACING EXPERIENCE\nReal Racing HD is optimized for iPad with beautiful track environments and carefully detailed cars, as well as exceptionally smooth graphical performance and console-quality 3D sound effects. Tear through forests, seaside circuits and burning deserts, with the roar of the engine and the sound of an adoring crowd in your ears! Surface variations including asphalt, grass, gravel and chicanes affect vehicle speed, responsiveness and handling. It’s the most exhilarating and realistic racing experience on iPad!\n\nNEW ONLINE MULTIPLAYER\nLog in to Game Center to compete in real-time against friends and rivals from around the world in all-new 4-person online multiplayer* races! Invite friends to race, or be matched against other players automatically. Challenge friends to a 6-person game on your local Wi-Fi network, or go head-to head over Bluetooth. Find out who the REAL champion is…\n\nCUSTOMIZE YOUR CAR \nSelect a control scheme and adjust brake assist and auto-accelerate to suit your style. Choose an existing skin for your car or wrap your car in a picture from your Photo Album!\n\n*Game Center requires iOS4.2 and an internet connection. Online features require an internet connection.\n\nBuckle in and get set for the most exhilarating racing experience on iPad - treat yourself and buy Real Racing HD now, or surprise a friend and “Gift This App”. With Real Racing HD, the race is in your hands!\n\nⓘ For the latest inside info from Firemint, join us on our site, Facebook or Twitter! Please report bugs on our support site so we can assist you - visit www.firemint.com for links and details.", "artistName": "Electronic Arts", "artworkUrl512": "http://a1843.phobos.apple.com/us/r30/Purple/8a/9e/8f/mzi.linxtgun.png", "version": "1.04", "primaryGenreId": 6014, "primaryGenreName": "Games", "fileSizeBytes": "160492797", "price": 4.99, "isGameCenterEnabled": true, "trackCensoredName": "Real Racing HD", "genreIds": ["6014", "6016", "7001", "7013"], "trackName": "Real Racing HD", "releaseNotes": "OPTIMIZED FOR iOS4.2 - ONLINE MULTIPLAYER VIA GAME CENTER\n✓ Online multiplayer via Game Center for up to 4 players! \n✓ Invite friends with Real Racing HD to play via Game Center.\n✓ Option to be auto-matched by Game Center to random Real Racing HD players anywhere in the world.\n✓ Use any combination of invitations and auto-matching for up to 4 people.\n✓ Optimized for iOS4.2 with multitasking and improved quick save/resume.\n✓ Minor bug fixes and improvements – thanks for your feedback! To make suggestions, report problems or ask questions, please visit firemint.com/support as we can’t reply to reviews on the App Store.\n\nPlease note: Game Center requires iOS4.2 and an internet connection. \n\nFor the latest inside info from Firemint:\n★ Join us on facebook.com/realracing\n★ Follow us at twitter.com/firemint\n★ Visit our site at firemint.com\n★ Watch our game trailers at youtube.com/firemintgames \n★ Get in touch at firemint.com/support\n\nPlease remember to rate this app, we love to see your great reviews! Got a friend you want to play with? Make sure you “Tell a Friend” through the App Store - or better still, surprise them and “Gift This App”!", "sellerUrl": "http://www.firemint.com/realracinghd", "screenshotUrls": [], "userRatingCount": 5626, "trackContentRating": "4+", "formattedPrice": "$4.99", "artistViewUrl": "https://itunes.apple.com/us/artist/electronic-arts/id284800461?mt=8&uo=4", "kind": "software", "averageUserRatingForCurrentVersion": 4.5, "sellerName": "EA Swiss Sarl", "supportedDevices": ["iPad3G", "iPadMini4G", "iPadThirdGen", "iPadMini", "iPadWifi", "iPadFourthGen4G", "iPad23G", "iPad2Wifi", "iPadThirdGen4G", "iPadFourthGen"], "artworkUrl100": "http://a1843.phobos.apple.com/us/r30/Purple/8a/9e/8f/mzi.linxtgun.png", "bundleId": "com.firemint.RealRacingHD", "trackViewUrl": "https://itunes.apple.com/us/app/real-racing-hd/id363998989?mt=8&uo=4", "minimumOsVersion": "3.2", "artworkUrl60": "http://a1536.phobos.apple.com/us/r30/Purple/c8/19/fb/mzi.pzkmjkyz.png", "averageUserRating": 4.5}