{"contentAdvisoryRating": "4+", "features": [], "languageCodesISO2A": ["EN"], "ipadScreenshotUrls": ["http://a4.mzstatic.com/us/r30/Purple4/v4/8f/36/59/8f365982-e74a-d9f5-77f6-79d536bec61b/screen480x480.jpeg", "http://a2.mzstatic.com/us/r30/Purple4/v4/f1/6e/68/f16e6803-0cfd-a60f-3b89-6c393764c0c2/screen480x480.jpeg", "http://a1.mzstatic.com/us/r30/Purple6/v4/1c/49/d5/1c49d59e-6fff-6eaa-991a-afad23e310fd/screen480x480.jpeg", "http://a3.mzstatic.com/us/r30/Purple6/v4/cc/01/b5/cc01b5fa-8adf-92ab-a20e-68052db515e7/screen480x480.jpeg", "http://a3.mzstatic.com/us/r30/Purple/v4/71/01/89/7101895d-0be5-1138-1956-835f6ee6647b/screen480x480.jpeg"], "releaseDate": "2010-04-01T21:00:24Z", "currency": "USD", "artistId": 284975584, "userRatingCountForCurrentVersion": 227, "wrapperType": "software", "advisories": [], "genres": ["Productivity", "Business"], "trackId": 363998953, "description": "Use iAnnotate to read, mark up, and share PDF, DOC, PPT and image files! Join the over 1 million users worldwide who say iAnnotate is “an indispensable tool to have,” and “the reason I bought an iPad.” \n\n*Winner of the Tabby Awards for Best Productivity App and Best Collaboration App and Moxie Awards winner for Mobile App of the Year.\n\niAnnotate’s intuitive interface and customizable set of features make it the \"go-to app\" for taking notes on lecture slides, annotating important business documents, revising screenplays, grading papers, and much more. Read on to learn about the great capabilities of iAnnotate: \n\nANNOTATE: Choose from the pen, highlighter, typewriter, stamp, straight-line, note, underline, strikeout, photo, voice recording, and date stamp tools. Copy and paste annotations, even from one document to another.\n\nCUSTOMIZE: Drag and drop the exact tools you need to create custom toolbars for your specific workflow. Switch between toolbars with a swipe, or open the Toolbar Drawer to edit your toolbars. \n\nSCROLL: iAnnotate allows fast, continuous vertical scroll through an entire document. Other apps only let you view one page at a time, but iAnnotate gives you both options. \n\nSEARCH: Use keywords to search the full text or filenames of every document downloaded to your Library, or limit your search to unread, annotated, or favorited documents to refine your results. \n\nNAVIGATE: Open the Navigation Panel to explore your documents by thumbnails, bookmarks, annotations, or search results, and perform other common actions.\n\nMULTITASK: iAnnotate lets you have up to eight documents open at once, and easily navigate between them for tabbed reading. \n\nIMPORT: Connect with Box, Dropbox, Google Drive, Microsoft SkyDrive or WebDAV, use iTunes file sharing, or open PDFs directly from email or the Web. \n\nMANAGE: Arrange documents by folders and sort contents by date added, date last opened, or alphabetical order.\n\nCREATE: Create brand new PDFs with blank, lined, or graph-paper pages.\n\nMODIFY: Add, delete, rotate, and rearrange pages in your documents. \n\nFLATTEN: Compress your annotations onto the document to prevent modification. This is useful for preserving signatures or for preventing recipients from deleting or changing your annotations. \n\nSHARE: Annotations made in iAnnotate are fully integrated into the PDF and can be viewed and edited in external PDF readers like Adobe Acrobat or Mac Preview. \n\nSUMMARIZE: Forward text summaries of a document's annotations in the body of an email. Summaries include the type of each annotation, relevant page numbers, and marked-up text. \n\nSECURE: Full support for the iOS Data Protection and Keychain functions. \n\nWATCH FOR UPDATES: With frequent updates and an attentive ear to our users, we are continuously improving iAnnotate. Stay tuned for even more new features to come!", "artistName": "Branchfire, Inc.", "artworkUrl512": "http://a263.phobos.apple.com/us/r30/Purple4/v4/f7/a9/a4/f7a9a40f-d9af-da1c-2811-2b1f308923a1/mzl.thhxxxya.png", "version": "3.1.1", "primaryGenreId": 6007, "primaryGenreName": "Productivity", "fileSizeBytes": "33127002", "price": 9.99, "isGameCenterEnabled": false, "trackCensoredName": "iAnnotate PDF", "genreIds": ["6007", "6000"], "trackName": "iAnnotate PDF", "releaseNotes": "Version 3.1.1 includes the following updates\n\n- Removes the login requirement to read and convert doc, ppt and image files!\n- Minor bugfixes and improvements\n- iOS 8 ready", "sellerUrl": "http://www.branchfire.com/iannotate/", "screenshotUrls": [], "userRatingCount": 9541, "trackContentRating": "4+", "formattedPrice": "$9.99", "artistViewUrl": "https://itunes.apple.com/us/artist/branchfire-inc./id284975584?uo=4", "kind": "software", "averageUserRatingForCurrentVersion": 4.5, "sellerName": "Branchfire, Inc.", "supportedDevices": ["iPadFourthGen", "iPad23G", "iPadMini", "iPadMini4G", "iPadThirdGen4G", "iPadThirdGen", "iPadFourthGen4G", "iPad2Wifi"], "artworkUrl100": "http://a263.phobos.apple.com/us/r30/Purple4/v4/f7/a9/a4/f7a9a40f-d9af-da1c-2811-2b1f308923a1/mzl.thhxxxya.png", "bundleId": "com.ajidev.mobile.iAnnotate", "trackViewUrl": "https://itunes.apple.com/us/app/iannotate-pdf/id363998953?mt=8&uo=4", "minimumOsVersion": "6.0", "artworkUrl60": "http://a488.phobos.apple.com/us/r30/Purple4/v4/18/f7/7f/18f77fa0-a4b1-2ce9-7e78-b512c0d32752/IA_icon_72.png", "averageUserRating": 4.5}