{"contentAdvisoryRating": "4+", "features": ["iosUniversal"], "languageCodesISO2A": ["AR", "BN", "NL", "EN", "FR", "DE", "HI", "ID", "IT", "JA", "KO", "MS", "ML", "PT", "RU", "ZH", "ES", "SV", "ZH", "TR", "UR"], "ipadScreenshotUrls": ["http://a1.mzstatic.com/us/r30/Purple1/v4/8e/64/fa/8e64fa38-4165-4bc5-76c1-2627dcab8604/screen480x480.jpeg", "http://a5.mzstatic.com/us/r30/Purple5/v4/51/17/16/5117167c-5bc4-4940-e8dd-a3ba7d9774db/screen480x480.jpeg", "http://a1.mzstatic.com/us/r30/Purple4/v4/a3/39/99/a339995a-9bbf-10aa-a18a-bbcd4f7d5dcb/screen480x480.jpeg", "http://a3.mzstatic.com/us/r30/Purple1/v4/52/c3/89/52c389e9-46ff-9db9-5467-2281f1685c3d/screen480x480.jpeg", "http://a4.mzstatic.com/us/r30/Purple4/v4/5b/a0/a8/5ba0a8a5-ecb7-605c-25f8-616ff1b8ed39/screen480x480.jpeg"], "releaseDate": "2010-04-02T03:41:29Z", "currency": "USD", "artistId": 355267671, "userRatingCountForCurrentVersion": 93, "wrapperType": "software", "advisories": [], "genres": ["Reference", "Books"], "trackId": 365557665, "description": "Quran Majeed is an amazing Quran app that beautifies your life with the blessing of reading and listening to the Quran on the go. The latest version of the authentic Quran Majeed app for iPhone and iPad offers complete Quran in the elegant Uthmanic script, audio recitation, translations and English Tafsir Uthmani, proofread by a Muslim scholar ('alim).\nالقرآن المجيد هو القرآن التطبيق المدهش أن يجمل حياتك بمباركة من القراءة و الاستماع إلى القرآن أثناء التنقل. الإصدار الأخير من الحجية القرآن المجيد التطبيق ل فون وتطلب الشركة يقدم القرآن الكريم كاملا بالخط العثماني أنيقة، تلاوة الصوت والترجمات.\n\n● World famous reciters (Sheikh Abdul Basit, Sheikh As Sudays & As Shraym, Mishari Rashid, Saad Al Ghamdi, Abu Bakr Shatry, Sheikh Ahmed Ajmi, Sheikh Al-Huzaifi, Sheikh Mahir-al-Muayqali, Sheikh Minshawi, Sheikh Ayub, Khalil Husari, Mahmood AlBana, Salah Bukhatir & Sheikh Basfar). Free version contains full audio recitation by Shiekh Abu Bakr Shatry.\n● القراء الشهيرة العالمي ( الشيخ عبد الباسط والشيخ سديس وشريم، مشاري راشد، سعد الغامدي، أبوبكر الشاطري، الشيخ أحمد العجمي، الشيخ الحذيفي، الشيخ ماهر، الشيخ المنشاوي، الشيخ أيوب، خليل الحصري، البنا محمود، الشيخ صلاح بوخاطر و بصفر) . يحتوي الإصدار المجاني تلاوة صوتية كاملة من قبل الشيخ أبوبكر الشاطري.\n\n● Four English translations (Pickthal, Dr. Mohsin, Mahmood & Yusuf Ali) and forty-five language translations (AlBanian, Amazigh, Amharic, Azerbaijani, Bengali, Bosnian, Bulgarian, Chinese, Divehi, Dutch, French, German, Hausa, Hindi, Indonesian, Italian, Japanese, Korean, Malayalam, Malaysian, Norwegian, Persian, Polish, Portuguese, Romanian, Russian, Sindhi, Somali, Spanish, Swahili, Swedish, Tajik, Tamil, Tartar, Turkish, Urdu, Uyghur, Uzbek). Free version offers full English translation by Pickthal and Tafsir/commentary of the 1st Juz/para.\n\n● Option to display any translation along with full Arabic text in hi-resolution, Retina graphics in both portrait and landscape viewing. Supports pinch/zoom feature for changing font size.\n● الخيار لعرض أي الترجمة جنبا إلى جنب مع النص العربي بالكامل الرسومات الشبكية مرحبا الدقة في كل صورة، و مشاهدة المناظر الطبيعية. تدعم ميزة قرصة / التكبير لتغيير حجم الخط.\n\n● Highly advanced “Search” feature that can help with searching any word (search exact word, affixes or all roots) in the Arabic text, any of the translations and English Tafsir. (Full version shows the name of the sura in the search feature along with the option to select that aya or word that has been searched).\n● متقدمة للغاية \"بحث\" الميزة يمكن أن يساعد في البحث أي كلمة ( بالضبط البحث عن كلمة، كل اللاحقات أو الجذور) في النص العربي، أي، من الترجمات الإنجليزية و التفسير. ( النسخة الكاملة يظهر اسم السورة في ميزة البحث جنبا إلى جنب مع خيار لتحديد أو آية أن الكلمة التي تم تفتيشها-).\n\n● Advanced audio options to help with memorization (repetition of ayah, Surah, number of repetitions, interval, and recitation speed).\n● خيارات الصوت المتقدمة للمساعدة في تحفيظ ( تكرار الآية، سورة، عدد من حالات التكرار، فاصل، التلاوة و السرعة).\n\n● Bookmarking of Aya, translation and tafsir (supports iCloud synchronization that helps your bookmarks stay up to date on all your iOS devices). Upto three bookmark in Free version.\n\n● Localized user interface now in Arabic, Bengali, Dutch, English, French, German, Hindi, Indonesian, Italian, Japanese, Korean, Malayalam, Malaysian, Portuguese, Russian, Spanish, Swedish, Turkish, and Urdu. \n\n● Airplay support.\n\n● Quranic Aya and word highlighting during recitation.\n\n● Background audio recitation playback support during standby & multi-tasking with complete support for iPod remote control.\n\n● Optimized for iPhone 5.\n\n● Social media sharing. Ability to share selected aya via email, twitter & Facebook.\n\n● iPad friendly interface (iPad's native popovers).\n\n● ● ●   Also check our app 'Quran Pak' on App Store that contains Quran font for non-Arabs and Urdu tafsir in Nastaliq script   ● ● ●", "artistName": "PakData", "artworkUrl512": "http://a186.phobos.apple.com/us/r30/Purple5/v4/e0/77/6c/e0776c7e-5dec-d3f1-751f-6a7b5ce667e7/mzl.vbnzndyx.jpg", "version": "3.2.1", "primaryGenreId": 6006, "primaryGenreName": "Reference", "fileSizeBytes": "59928363", "price": 0.0, "isGameCenterEnabled": false, "trackCensoredName": "Quran Majeed Free Edition", "genreIds": ["6006", "6018"], "trackName": "Quran Majeed Free Edition", "releaseNotes": "● Crash fix for iOS 8 iPad users\n● Other bug fixes", "sellerUrl": "http://www.pakdata.com/products/quran-majeed", "screenshotUrls": ["http://a4.mzstatic.com/us/r30/Purple4/v4/fb/95/ea/fb95eaf8-de98-227a-2ea7-d3176d3dcbd6/screen1136x1136.jpeg", "http://a5.mzstatic.com/us/r30/Purple3/v4/5e/f4/35/5ef43583-ba55-2f45-8b3d-1471320fab4f/screen1136x1136.jpeg", "http://a3.mzstatic.com/us/r30/Purple3/v4/0c/89/2c/0c892c52-aef1-bdbb-f781-23bd76ace335/screen1136x1136.jpeg", "http://a1.mzstatic.com/us/r30/Purple3/v4/1c/4f/f6/1c4ff698-7938-2a1c-d7e9-b8712effa4d9/screen1136x1136.jpeg", "http://a2.mzstatic.com/us/r30/Purple4/v4/f9/ae/92/f9ae922b-4ff0-9359-02fc-8b88b707a6c1/screen1136x1136.jpeg"], "userRatingCount": 7752, "trackContentRating": "4+", "formattedPrice": "Free", "artistViewUrl": "https://itunes.apple.com/us/artist/pakdata/id355267671?uo=4", "kind": "software", "averageUserRatingForCurrentVersion": 5.0, "sellerName": "Pakistan Data Management Services", "supportedDevices": ["iPad23G", "iPadThirdGen4G", "iPad3G", "iPadWifi", "iPadMini4G", "iPodTouchFifthGen", "iPadFourthGen", "iPhone5c", "iPadMini", "iPodTouchourthGen", "iPhone4S", "iPodTouchThirdGen", "iPadThirdGen", "iPhone4", "iPhone-3GS", "iPad2Wifi", "iPadFourthGen4G", "iPhone5", "iPhone5s"], "artworkUrl100": "http://a186.phobos.apple.com/us/r30/Purple5/v4/e0/77/6c/e0776c7e-5dec-d3f1-751f-6a7b5ce667e7/mzl.vbnzndyx.jpg", "bundleId": "com.pakdata.QuranMajeedLite", "trackViewUrl": "https://itunes.apple.com/us/app/quran-majeed-free-edition/id365557665?mt=8&uo=4", "minimumOsVersion": "5.1.1", "artworkUrl60": "http://a495.phobos.apple.com/us/r30/Purple1/v4/8e/f4/8f/8ef48f5e-2797-514f-e7ce-2a83ffc41d8c/icon.png", "averageUserRating": 4.5}