{"contentAdvisoryRating": "4+", "features": ["iosUniversal"], "languageCodesISO2A": ["AR", "NB", "BG", "CA", "ZH", "HR", "CS", "DA", "NL", "EN", "ET", "FI", "FR", "DE", "EL", "HE", "HU", "IS", "ID", "IT", "JA", "KO", "LV", "LT", "MS", "PL", "PT", "RO", "RU", "SR", "ZH", "SK", "SL", "ES", "SV", "TH", "ZH", "TR", "UK", "VI"], "ipadScreenshotUrls": ["http://a4.mzstatic.com/us/r30/Purple/v4/fa/98/68/fa986815-d27e-16a2-612b-48e8e3177caa/screen480x480.jpeg", "http://a2.mzstatic.com/us/r30/Purple/v4/e2/84/ed/e284eda8-2bd0-e0f4-4964-fa98c9cb21f6/screen480x480.jpeg", "http://a4.mzstatic.com/us/r30/Purple/v4/f4/ad/ff/f4adff23-410f-1998-d5e4-d09e10146ba1/screen480x480.jpeg", "http://a1.mzstatic.com/us/r30/Purple/v4/f7/69/c5/f769c566-43d0-78ec-4ead-0b737d23ec67/screen480x480.jpeg", "http://a4.mzstatic.com/us/r30/Purple/v4/cc/17/2f/cc172f87-a8e5-7f17-244f-69f72cda3796/screen480x480.jpeg"], "releaseDate": "2010-04-14T18:30:24Z", "currency": "USD", "artistId": 367003842, "userRatingCountForCurrentVersion": 40, "wrapperType": "software", "advisories": [], "genres": ["Travel", "Lifestyle"], "trackId": 367003839, "description": "The Booking.com hotel app puts over 540,000 properties at your fingertips for simple and secure booking on your iPhone and iPad. You'll find ideal accommodations anywhere, anytime – best price guaranteed.\n\nWHY CHOOSE THE BOOKING.COM APP?\n- When you need a hotel in a hurry, in one tap you can find the best hotels closest to you for tonight, and even book participating hotels without a credit card!\n- And we don’t just have hotels: check out our range of villas, apartments, B&Bs, hostels and more in 207+ countries worldwide.\n- 39 million verified guest reviews help you find the perfect place to stay.\n- Once you’ve booked, your confirmation is stored in the app to use at check-in. It’s even available if you don’t have internet access, so you’ll never print (or forget) your confirmation again!\n- If you also use Booking.com on your computer, sign in to your account and we’ll automatically sync your bookings, recent searches, lists, account details and more to the app. Pick up where you left off, at any time.\n\nFINDING THE PERFECT PLACE TO STAY\n- Search by city, landmark, even hotel name, or just search for properties nearby in one tap.  \n- Sort by what’s important to you: best price, deals, guest review score, and more.\n- Then narrow your search results with handy filters: price range, city districts, or facilities (e.g. Swimming Pool, Free WiFi, Parking) and more.\n- Switch to map view to find hotels in your preferred neighborhood. HINT: On an iPad, you can actually draw a specific area on the map with your finger to find results there!\n- Large photos on iPad put you in the picture (and the mood) for your next trip.\n- You can also save your favorite dreamy places to personalized lists. Think of them as vacation wish lists!\n- Sign in to your Booking.com account and we’ll automatically pre-fill your details for even faster booking, including the credit cards you’ve chosen to store.\n- The app is available in 42 languages and you can view prices in 53 currencies.\n\nGET THE BEST HOTEL DEALS\nWe showcase the best deals at all kinds of amazing properties (not just cheap hotels!)\n- Secret Deals: You get first pick on great deals for hotels, apartments, resorts and more worldwide!\n- Value Deals: Book hotels with the best value for their price and location.\n- Late Deals: Find cheap hotels for last-minute hotel bookings near you.\n\nHELPING YOU ALONG EVERY STEP OF YOUR STAY\n- Save your booking confirmation to your photo gallery or access it offline in the app to check in easily, even without an internet connection.\n- Add your booking to Passbook to keep all your travel info in one place.\n- Find the way to your stay quickly and easily with maps.\n- Adding hotel bookings to your calendar makes planning multiple stays easier.\n- You can cancel or modify bookings on the move with the app.\n- Access 24/7 Customer Service by phone or email. Customer Service is available in English and 40 other languages.\n\nALREADY A BOOKING.COM USER?\n- After installing the app, sign in to the account you use on the Booking.com website. All of your hotel bookings, searches, viewed hotels, wish lists and account information will automatically be available in the app.\n- You can easily switch between devices whenever you like. So if you’re at home on your laptop, or using your phone on the go, all your searches, bookings and more will be updated automatically as long as you’re signed in.\n- If you don’t have a Booking.com account, but made a booking on the website, you can import your booking to the app. Go to “My Bookings” in the account area and import using the Booking Number and PIN from your confirmation (also sent to you by email).\n\nContinued use of GPS running in the background can dramatically decrease battery life.\n\n-------------\nSome recent awards we’re proud of:\n- 2014 Tabby Awards Winner and Users’ Choice (iPad: Travel, Navigation, Local & Weather)\n- 2014 Mobile Travel & Tourism Awards: Best Tablet App (for the Booking.com iPad app)", "artistName": "Booking.com", "artworkUrl512": "http://a1185.phobos.apple.com/us/r30/Purple3/v4/98/f5/da/98f5da43-20a7-baa4-3479-4b146cea6e8d/mzl.osltmenu.png", "version": "8.1.1", "primaryGenreId": 6003, "primaryGenreName": "Travel", "fileSizeBytes": "43537657", "price": 0.0, "isGameCenterEnabled": false, "trackCensoredName": "Booking.com Hotel Reservations Worldwide & Hotel Deals", "genreIds": ["6003", "6012"], "trackName": "Booking.com Hotel Reservations Worldwide & Hotel Deals", "releaseNotes": "Paris, France vs Paris, USA\n-You won't find the Eiffel Tower in Paris, Texas! So to make sure you're definitely booking the right place, we'll automatically populate the country as well as the city name when you type it in the search bar.\n\nFun for the whole family!\n-We've fixed a bug, which means you can now check the maximum occupancy for children on a room level. Travel with 100% confidence that you've booked the perfect family room.\n\nThe countdown has begun\n-Your next trip always appears on the homescreen of the app. From there, you can easily access your booking details. We've now added a property picture to refresh your memory at a glance.", "sellerUrl": "http://www.booking.com/apps.html?source=appstore", "screenshotUrls": ["http://a2.mzstatic.com/us/r30/Purple/v4/e2/5a/2d/e25a2d39-5c25-daf1-3f12-31598b585bfa/screen1136x1136.jpeg", "http://a3.mzstatic.com/us/r30/Purple/v4/fb/d8/15/fbd815e5-5bce-7fcb-e41b-3135c5a63b38/screen1136x1136.jpeg", "http://a5.mzstatic.com/us/r30/Purple/v4/dd/c9/d8/ddc9d85e-dcca-acec-eee0-687a0d03a96c/screen1136x1136.jpeg", "http://a5.mzstatic.com/us/r30/Purple/v4/e0/8e/fd/e08efd49-c17d-add2-0524-b908b60ca724/screen1136x1136.jpeg", "http://a4.mzstatic.com/us/r30/Purple/v4/f4/be/bc/f4bebcb6-7900-4dac-b1ba-df8df415cca6/screen1136x1136.jpeg"], "userRatingCount": 20742, "trackContentRating": "4+", "formattedPrice": "Free", "artistViewUrl": "https://itunes.apple.com/us/artist/booking.com/id367003842?uo=4", "kind": "software", "averageUserRatingForCurrentVersion": 4.5, "sellerName": "Booking.com B.V.", "supportedDevices": ["iPad23G", "iPhone4", "iPhone-3GS", "iPhone5s", "iPodTouchFifthGen", "iPadFourthGen", "iPadMini4G", "iPhone5", "iPhone5c", "iPadFourthGen4G", "iPodTouchourthGen", "iPadMini", "iPadThirdGen4G", "iPad2Wifi", "iPadThirdGen", "iPhone4S"], "artworkUrl100": "http://a1185.phobos.apple.com/us/r30/Purple3/v4/98/f5/da/98f5da43-20a7-baa4-3479-4b146cea6e8d/mzl.osltmenu.png", "bundleId": "com.booking.BookingApp", "trackViewUrl": "https://itunes.apple.com/us/app/booking.com-hotel-reservations/id367003839?mt=8&uo=4", "minimumOsVersion": "6.0", "artworkUrl60": "http://a343.phobos.apple.com/us/r30/Purple1/v4/80/aa/f3/80aaf3ba-e4ef-2e49-7095-9f7aa20990e4/AppIcon57x57.png", "averageUserRating": 4.5}