{"contentAdvisoryRating": "4+", "features": ["iosUniversal"], "languageCodesISO2A": ["NL", "EN", "FR", "DE", "IT", "JA", "PT", "ZH", "ES", "TR"], "ipadScreenshotUrls": ["http://a1.mzstatic.com/us/r30/Purple/v4/f8/b0/b3/f8b0b31b-6a4f-d3ca-966a-6736b11e4602/screen480x480.jpeg", "http://a1.mzstatic.com/us/r30/Purple/v4/c2/4e/19/c24e19d0-6b38-51ee-4b3a-82da9de679a9/screen480x480.jpeg", "http://a4.mzstatic.com/us/r30/Purple/v4/f0/72/01/f0720170-3ea5-ff27-0dec-3af08c6be446/screen480x480.jpeg", "http://a1.mzstatic.com/us/r30/Purple/v4/d2/ae/f9/d2aef92a-0180-846e-f8c1-3aef087d0376/screen480x480.jpeg"], "releaseDate": "2010-05-24T18:00:42Z", "currency": "USD", "artistId": 373065274, "userRatingCountForCurrentVersion": 139, "wrapperType": "software", "advisories": [], "genres": ["Entertainment"], "trackId": 373065271, "description": "Discover and pilot the Parrot AR.Drone and AR.Drone 2.0 from Parrot using the new application, AR.FreeFlight 2.2.\n\nINTUITIVE – Download AR.FreeFlight 2.2, the free control application, and you are ready to fly! By tilting your iPhone, iPod or iPad you control the direction of your AR.Drone. When you release control, the AR.Drone is instantly stabilized in the air. AR.FreeFlight 2.2 is compatible with the Parrot AR.Drone and the Parrot AR.Drone 2.0\n\nFLY LIKE A CHAMPION – The AR.Drone is equipped with intuitive sensors that allow it to remain stable in the air, virtually flying itself. Anyone can fly like a champion as the embedded sensors allow for easy take-off and landing. With the AR.Drone 2.0 and AR.FreeFlight 2.2, you can access the exclusive and patented Absolute Control piloting mode for beginners that can be adjusted with your growing expertise.\n\nRECORD HIGH DEFINITION VIDEO - As you fly, the HD video is recorded and sent via WiFi directly to your device after you land. With one click, upload your video from the user-friendly interface seamlessly to Youtube or share your pictures on Picasa.\n\nAR.DRONE 2.0 EXCLUSIVE… PERFORM ACROBATICS – Make your AR.Drone 2.0 flip in mid-flight using a simple control.\n\nAR.DRONE ACADEMY\nImprove your flying experience with AR.Drone Academy. See all your flights on the AR.Drone Academy map, watch your videos, enhanced with in-flight data and share them with pilots throughout the world.\n\nDIRECTOR MODE LAUNCH\nLaunch automatic movements to get stabilized and smooth trajectories. Panorama, travellings, crane and static point are available and you can change the speed during the movements to adjust it to your needs\nFront camera settings such as white balance, saturation and exposure can be adjusted to scene you want to shoot\nPost production options developed especially for the AR.Drone 2.0 videos are available to stabilize the video on your iDevice. Choose the rate of correction that fits and it creates a new additional version of the video directly visible from the app. It is also stored into the Camera Roll.\nYour video is too long? Some parts are not of interest? Thanks to the sequence edition option you can cut some parts of your video to select only the ones you want and create a new video with only the selected sequences.\n\nFLIGHT RECORDER COMPATIBILITY\nTo use all the features linked to the Flight Recorder, you need to plug it above the battery. It is extremely important that the Flight Recorder is exactly just above the battery and not elsewhere to get the best of it. Please check our videos on www.parrot.com\nA new piloting mode has been developed. When you click on the earth icon on top right corner of the piloting interface, a map appears on the screen. This is the map around your location. Choose a point on the map, set the speed, set the altitude and click “GO”. The AR.Drone 2.0 starts its flight to get to this point. The AR.Drone 2.0 stays within the Wi-Fi range from your iDevice.\nThe “Return Home” functionality helps to get his AR.Drone 2.0 back to the take-off location automatically.\nReview in 3D all your flights made with the Flight Recorder connected to your AR.Drone 2.0 on the AR.Drone Academy map.\nGet a better stabilization for the static point when you fly in high altitudes thanks to the GPS positioning of the Flight Recorder.\nThe Flight Recorder registers more than 350 different flight data.\n\nRESCUE MODE\nStuck in a tree? Just try the “Rescue mode” directly from the piloting interface to try to unblock the AR.Drone 2.0 from the branches. Even if it is upside down, the propellers will spin so you have new possibilities to make an action while your AR.Drone is not reachable.\n\nThis app is for iOS 6 and higher.\n\nEnjoy your flights", "artistName": "Parrot SA", "artworkUrl512": "http://a1358.phobos.apple.com/us/r30/Purple4/v4/b3/a5/e4/b3a5e411-1320-4a77-681c-35fd8eb3ae9c/mzl.mwdfmmvq.png", "version": "2.4.12", "primaryGenreId": 6016, "primaryGenreName": "Entertainment", "fileSizeBytes": "38327217", "price": 0.0, "isGameCenterEnabled": false, "trackCensoredName": "FreeFlight", "genreIds": ["6016"], "trackName": "FreeFlight", "releaseNotes": "iOS 7 compatibility, Flight Recorder Firmware update", "sellerUrl": "http://www.ardrone.com", "screenshotUrls": ["http://a2.mzstatic.com/us/r30/Purple2/v4/ba/cc/5d/bacc5dad-b5a5-2fa0-e1f7-8638d285b22c/screen320x320.jpeg"], "userRatingCount": 2255, "trackContentRating": "4+", "formattedPrice": "Free", "artistViewUrl": "https://itunes.apple.com/us/artist/parrot-sa/id373065274?uo=4", "kind": "software", "averageUserRatingForCurrentVersion": 3.5, "sellerName": "Parrot", "supportedDevices": ["iPad23G", "iPhone5c", "iPadThirdGen", "iPhone-3GS", "iPodTouchFifthGen", "iPadFourthGen4G", "iPadThirdGen4G", "iPhone5", "iPhone4S", "iPadFourthGen", "iPad2Wifi", "iPadMini4G", "iPadMini", "iPodTouchourthGen", "iPhone4", "iPhone5s"], "artworkUrl100": "http://a1358.phobos.apple.com/us/r30/Purple4/v4/b3/a5/e4/b3a5e411-1320-4a77-681c-35fd8eb3ae9c/mzl.mwdfmmvq.png", "bundleId": "com.parrot.freeflight", "trackViewUrl": "https://itunes.apple.com/us/app/freeflight/id373065271?mt=8&uo=4", "minimumOsVersion": "6.0", "artworkUrl60": "http://a286.phobos.apple.com/us/r30/Purple6/v4/e4/ad/81/e4ad81f7-33ea-58cb-2b42-1000855c2f49/Icon.png", "averageUserRating": 4.0}