{"contentAdvisoryRating": "4+", "features": [], "languageCodesISO2A": ["EN"], "ipadScreenshotUrls": ["http://a4.mzstatic.com/us/r30/Purple6/v4/50/f7/bc/50f7bc0a-22b9-cbac-0122-03c660aa13b6/screen480x480.jpeg"], "releaseDate": "2010-07-24T03:23:00Z", "currency": "USD", "artistId": 284937604, "userRatingCountForCurrentVersion": 4, "wrapperType": "software", "advisories": [], "genres": ["Music", "Entertainment"], "trackId": 378074598, "description": "••• As used by Gorillaz and The Flaming Lips! •••\n\nSylo Synthesiser allows you to play music, or create sound effects, using sounds you can design yourself. Sylo Synth includes a collection of pre-designed sounds which you can use as they are, tweak them to your heart's desire, or you can make new sounds from scratch.\n\nBuild sounds from basic waveforms, or capture them from the world around you using the iPad's built-in microphone. Then, tinker with Sylo Synthesiser's filters and other settings to make a sound all your own.\n\nSylo Synthesiser features live time-stretching technology based on granular synthesis and a suite of filters:\n\n• Speed up or slow down a recorded sound to use as an instrument\n\n• With a regular wavetable synthesiser, higher-pitched notes are also faster, like chipmunks, and lower-pitched notes are also slower, as though they are moving through treacle\n\n• But enable Sylo's \"Sync Speed\" feature, and lower or higher-pitched notes still play back at the same speed, keeping them in sync with each other\n\n• Fiddle with the speed control even while you're playing notes: Slow, stop or even rewind the sound in the middle of notes — without changing the pitch\n\n• Granular synthesis allows you to create instruments or  effects from a recording, that do not sound like the original, yet retain its realistic, natural sound\n\n• FX units: Frequency modulation, ring modulation, echo/delay, distortion, and a low-pass filter with resonance control\n\nSylo Synthesiser also supports Core MIDI: play music from another device via MIDI.\n\nAdditional features:\n\n• Use existing audio files as the building-blocks of your instrument: import audio from wave, aiff, mp3 and aac/m4a files\n\n• Save recordings to your iPad or to Dropbox* online storage\n\n• Save your new instruments to the preset list for quick access\n\n• Exchange audio with other apps via AudioCopy/AudioPaste or \"Open in...\" (where supported)\n\nPlease note: The microphone button in Sylo Synthesiser is for recording sound into the synth, to use as the basis for new instruments — not for making a permanent record of what you play! (We've heard from a couple of people confused about this so we thought we'd make it clear!) If you wish to record your performances, you can use the Record button in the toolbar for this purpose.\n\n\n(* Dropbox account required for these features. Available free from http://dropbox.com/)", "artistName": "Wooji Juice Ltd", "artworkUrl512": "http://a1453.phobos.apple.com/us/r30/Purple/v4/cc/15/c0/cc15c0e5-d260-8e11-388d-a430c353d234/mzl.xwkoinko.png", "version": "1.4", "primaryGenreId": 6011, "primaryGenreName": "Music", "fileSizeBytes": "10799812", "price": 0.0, "isGameCenterEnabled": false, "trackCensoredName": "Sylo Synthesiser", "genreIds": ["6011", "6016"], "trackName": "Sylo Synthesiser", "releaseNotes": "To celebrate both Sylo Synth's upcoming 4th birthday and the launch of our new app Mitosynth, this new version of Sylo Synth is now completely free — including all features that were previously \"Sylo Synth Pro\" only!\n\nI hope you enjoy the features! If you do, please take a moment to check out Wooji Juice's other synths, Grain Science and Mitosynth!", "sellerUrl": "http://www.wooji-juice.com/products/sylo-synth", "screenshotUrls": [], "userRatingCount": 1213, "trackContentRating": "4+", "formattedPrice": "Free", "artistViewUrl": "https://itunes.apple.com/us/artist/wooji-juice-ltd/id284937604?uo=4", "kind": "software", "averageUserRatingForCurrentVersion": 4.5, "sellerName": "Wooji Juice Ltd", "supportedDevices": ["iPadFourthGen", "iPad23G", "iPadThirdGen4G", "iPad2Wifi", "iPadFourthGen4G", "iPadMini", "iPadThirdGen", "iPadMini4G"], "artworkUrl100": "http://a1453.phobos.apple.com/us/r30/Purple/v4/cc/15/c0/cc15c0e5-d260-8e11-388d-a430c353d234/mzl.xwkoinko.png", "bundleId": "com.wooji-juice.sylosynth", "trackViewUrl": "https://itunes.apple.com/us/app/sylo-synthesiser/id378074598?mt=8&uo=4", "minimumOsVersion": "6.0", "artworkUrl60": "http://a1015.phobos.apple.com/us/r30/Purple4/v4/0e/cb/56/0ecb565b-2663-3a60-14d2-55af890a4b32/Icon-72.png", "averageUserRating": 2.5}