{"contentAdvisoryRating": "4+", "features": [], "languageCodesISO2A": ["EN", "DE"], "ipadScreenshotUrls": [], "releaseDate": "2010-08-10T18:15:26Z", "currency": "USD", "artistId": 382821660, "userRatingCountForCurrentVersion": 28, "wrapperType": "software", "advisories": [], "genres": ["Reference", "Lifestyle"], "trackId": 382821657, "description": "This is the innovative personalized forecast that is revolutionizing the world of astrology! Based on your full birth chart, AstroloMe gives your individual horoscope in real-time, complete with your planet transits! Read comments on your Events by top astrologers, and ask professional advice straight from you app! \n\nAstroloMe is unique, fun and intuitive. \n\nExperience astrology as it was meant to be with AstroloMe! \n\n+ Your Full Birth Chart - free! Always have your birth chart on hand, including in-depth explanations. \n+ For the first time ever!!! Ask advice from a professional astrologer. The new in-app purchase gives you the power of a personal astrologer in the palm of your hand!! Browse our directory to choose your favorite astrologer! \n+ Your free daily top transits updated live! Read expert Astrologers’ tips and comments on the events you are experiencing, and learn how to make the most of your day :)\n+ Add profiles of your loved ones! This one-time in-app purchase allows you to add as many profiles as you like. \n+ Daily Personal Forecast- sent to your email every morning, the Daily highlights your top astrological influences for the day. \n++Update to Pro with our in-app subscription and see all your events, updated live, including moon transits!\n\nYOU ARE SO MUCH MORE THAN YOUR SUN SIGN! \n\nWhat people are saying:  \n\n★★★★★Aug 14, 2012 by T~LOVE\nIntelligent and insightful. - Combining a convenient graphical interface with star charts and insightful readings, AstroloMe provides the user with an interactive and smart way to see their readings of both long and short term projections and offers other users feedback about coinciding events.\n\n★★★★★katmoney - astrology redefined! - if you follow astrology and are \"horoscope\" fanatics, i think this is the \"go to\" app. my wife and i use this app daily, as we both take horoscopes seriously, the event alerts are a nice touch to horoscopes.\n\n★★★★★Jul 27, 2012 by Miz Harlee\nNeat Astro-Meter! - Very informative, well designed. I particularly like the meter that gives you an easy to understand visual and mathematical summation of the conditions affecting you.\n\nDeepen your understanding of your daily advantages and challenges with personalized, real-time astrological event information - categorized for effortless reading and updated every minute. Get all your events with our in-app subscription.\n\nCompletely interactive, AstroloMe lets you rate and comment on your events and share them with your friends or the world. For the first time in history astrology is a fuller experience, with information not just from the astrologer but by the people who are living it! \n\nExperience astrology as it was meant to be with AstroloMe! \n\nFor any questions/features: support@astrolome.com", "artistName": "Astrolome Inc.", "artworkUrl512": "http://a452.phobos.apple.com/us/r30/Purple/v4/c2/ee/d3/c2eed3f4-8183-d207-6768-15192d29757d/mzl.vbwxsvbx.png", "version": "2.54", "primaryGenreId": 6006, "primaryGenreName": "Reference", "fileSizeBytes": "6684986", "price": 0.0, "isGameCenterEnabled": false, "trackCensoredName": "Horoscope *", "genreIds": ["6006", "6012"], "trackName": "Horoscope *", "releaseNotes": "- Reverted back to 10 events\n- small bug fixes", "sellerUrl": "http://www.astrolome.com", "screenshotUrls": ["http://a2.mzstatic.com/us/r30/Purple/v4/d3/73/e5/d373e5d1-b9d8-32e9-7829-cc622b91d317/screen1136x1136.jpeg"], "userRatingCount": 894, "trackContentRating": "4+", "formattedPrice": "Free", "artistViewUrl": "https://itunes.apple.com/us/artist/astrolome-inc./id382821660?uo=4", "kind": "software", "averageUserRatingForCurrentVersion": 1.5, "sellerName": "astrolome inc", "supportedDevices": ["iPhone5c", "iPadThirdGen4G", "iPad3G", "iPodTouchThirdGen", "iPadMini", "iPadThirdGen", "iPhone-3GS", "iPad2Wifi", "iPadWifi", "iPadFourthGen", "iPadMini4G", "iPhone4", "iPad23G", "iPadFourthGen4G", "iPodTouchourthGen", "iPhone5", "iPhone5s", "iPodTouchFifthGen", "iPhone4S"], "artworkUrl100": "http://a452.phobos.apple.com/us/r30/Purple/v4/c2/ee/d3/c2eed3f4-8183-d207-6768-15192d29757d/mzl.vbwxsvbx.png", "bundleId": "1.astrolome.com", "trackViewUrl": "https://itunes.apple.com/us/app/horoscope-*/id382821657?mt=8&uo=4", "minimumOsVersion": "5.1", "artworkUrl60": "http://a1557.phobos.apple.com/us/r30/Purple/v4/db/cb/44/dbcb4473-683b-4b56-2298-3241094e522e/Icon.png", "averageUserRating": 3.5}