{"contentAdvisoryRating": "4+", "features": ["iosUniversal"], "languageCodesISO2A": ["EN"], "ipadScreenshotUrls": ["http://a1.mzstatic.com/us/r30/Purple2/v4/7f/c9/51/7fc9510f-9c23-b3e1-a7ca-2b8564f7984e/screen480x480.jpeg", "http://a3.mzstatic.com/us/r30/Purple/v4/f9/26/e9/f926e982-c09e-0861-829f-897735163608/screen480x480.jpeg", "http://a3.mzstatic.com/us/r30/Purple/v4/f0/ee/c4/f0eec46f-a11c-b4a0-fe1f-5df6f89c56d4/screen480x480.jpeg", "http://a2.mzstatic.com/us/r30/Purple/v4/c3/92/6d/c3926d5a-5a18-8d86-731d-f812b3b6a8b2/screen480x480.jpeg", "http://a4.mzstatic.com/us/r30/Purple/v4/c5/6c/cb/c56ccb24-72eb-cca5-64b2-a29dcde3ae82/screen480x480.jpeg"], "releaseDate": "2011-07-27T07:00:00Z", "currency": "USD", "artistId": 314644038, "userRatingCountForCurrentVersion": 8, "wrapperType": "software", "advisories": [], "genres": ["Music", "Education"], "trackId": 386325076, "description": "Jam with your favorite bands…with Jammit! Isolate or remove an instrument from the mix & jam with the original multi-tracks! \n\nAnd now: Line 6 and Jammit have partnered to create the ultimate guitar jam-along experience for iPhone® and iPad®. With the Line 6 Mobile In interface and Jammit app, you can immerse yourself in your favorite artists’ original recordings—and play along with incredibly authentic guitar tones.\n\nWhat is Jammit?\nThe audio for the individual instruments and voices heard on your favorite songs was recorded separately before being blended into the final mix.  These original multi-track recordings are the building blocks for every popular song released over the past 50 years and the same authentic tracks that we use in Jammit.\nYes, Jammit actually allows you to isolate or remove an instrument from the mix, so you can jam with a band’s original master tracks! In addition to instrument isolation, Jammit’s scrolling scores, section looping, variable slow mode and onboard recorder let you experience music like never before. Whether you’d like to emulate every nuance of an incredible player or just take in the musical genius of a great performance, Jammit software allows you to find out what your favorite music is really made of.\n\nBasic Jammit Features:\n\n-True Instrument Isolation: Jammit uses the original multi-track master recordings allowing you to rebalance the mix so you can hear every detail of the original performance.  \n\n-Notation and Tablature: The elite team of Jammit transcribers use the original isolated multi-track recordings to give you transcriptions with a degree of accuracy found nowhere else but Jammit.\n\n-Advanced Tools: Use the variable slow down mode and section looping to focus on difficult musical passages.\n\n-Recording: Whether you're emulating the original part or coming up with your own, you can capture your performance using Jammit's record feature.\n-Line 6 Amp Modeling:\n\nWhen a Line 6 Mobile In is plugged into your iPad or iPhone, it unlocks the Line 6 amp modeling engine that is built in to the latest version of Jammit.  Simply plug your guitar into the Mobile In, launch Jammit and load one of the songs in your library.  There are two ways to use the amp modeling in Jammit : Auto or Manual mode.  \n\nAuto mode: On select songs (see the complete list of eligible songs below), patches have been created to automatically make your guitar sound like the guitar on the original recording. If the tone changes in the song, so does your guitar, so you can concentrate on playing your guitar, not your pedal board! \n\nManual mode: Press “manual” on the Line 6 user interface (selecting the Line 6 icon under the USER channel title), and scroll through the available preset patches. In manual mode, the sound patch that you select will remain throughout the song. \n\n\nHow to Get Started on Jammit: \n\n1) Download the free app to your iOS 5 iPad, iPhone or iPod Touch. \n2) Select the “Try It Out” button to download the 30 second demo songs or…\n3) Sign up for your FREE Jammit account. Doing this will allow you to download any purchases that you make onto a maximum of three Jammit compatible devices.\n4) Browse the In App Jammit Store or the store at Jammit.com for songs you’d like to purchase.\n5) Purchases made through In App Purchase or at Jammit.com can be downloaded instantly to your iPad, iPhone or iPod Touch when you sign into your Jammit account on your device.\n6) Load the song from the library page in the Jammit app and enjoy!", "artistName": "Jammit, Inc.", "artworkUrl512": "http://a856.phobos.apple.com/us/r30/Purple/v4/db/60/bc/db60bc27-7bf5-92b9-40a8-4c741b59c131/mzl.fkibgiyp.png", "version": "2.4.0", "primaryGenreId": 6011, "primaryGenreName": "Music", "fileSizeBytes": "14547628", "price": 0.0, "isGameCenterEnabled": false, "trackCensoredName": "Jammit", "genreIds": ["6011", "6017"], "trackName": "Jammit", "releaseNotes": "Support for iOS 8", "sellerUrl": "http://www.jammit.com", "screenshotUrls": ["http://a1.mzstatic.com/us/r30/Purple2/v4/f5/12/7c/f5127c52-ef58-2f6d-998b-f8361b1acc03/screen320x320.jpeg", "http://a2.mzstatic.com/us/r30/Purple/v4/d6/47/c8/d647c872-7649-109e-f026-e368f68406f0/screen320x320.jpeg", "http://a3.mzstatic.com/us/r30/Purple/v4/c2/35/fb/c235fb11-cdc5-5d71-7486-7ed4e2c74f17/screen320x320.jpeg"], "userRatingCount": 277, "trackContentRating": "4+", "formattedPrice": "Free", "artistViewUrl": "https://itunes.apple.com/us/artist/jammit-inc./id314644038?uo=4", "kind": "software", "averageUserRatingForCurrentVersion": 2.0, "sellerName": "Jammit, Inc.", "supportedDevices": ["iPhone5s", "iPadMini4G", "iPadThirdGen", "iPadMini", "iPhone-3GS", "iPadFourthGen4G", "iPadFourthGen", "iPhone5", "iPad23G", "iPadThirdGen4G", "iPad2Wifi", "iPodTouchourthGen", "iPodTouchFifthGen", "iPhone4", "iPhone4S", "iPhone5c"], "artworkUrl100": "http://a856.phobos.apple.com/us/r30/Purple/v4/db/60/bc/db60bc27-7bf5-92b9-40a8-4c741b59c131/mzl.fkibgiyp.png", "bundleId": "com.jammit.jammit", "trackViewUrl": "https://itunes.apple.com/us/app/jammit/id386325076?mt=8&uo=4", "minimumOsVersion": "6.1", "artworkUrl60": "http://a1639.phobos.apple.com/us/r30/Purple5/v4/37/50/0b/37500bba-c13e-63fc-fc26-65f28d246469/Icon.png", "averageUserRating": 3.0}