{"contentAdvisoryRating": "4+", "features": [], "languageCodesISO2A": ["EN", "FR"], "ipadScreenshotUrls": [], "releaseDate": "2010-08-31T07:00:00Z", "currency": "USD", "artistId": 333195245, "userRatingCountForCurrentVersion": 21, "wrapperType": "software", "advisories": [], "genres": ["Photo & Video", "Lifestyle"], "trackId": 389298844, "description": "Huge thanks to Hakeem Derres (alias itouchking) for the amazing icon! Check out his website at http://itouchking.66ghz.com/\n\nIntroducing Camera Prime, THE all-in-one camera app! Camera Prime will help you take the best possible photos by offering you its many useful features! These features include:\n\n*NEW IN 2.0* DATE & TIME STAMP: Overlay the date and time your pictures were taken onto your photos!\n\n*NEW IN 2.0* SEPARATE FOCUS AND EXPOSURE: Make your photos look more professional by changing the focus and exposure areas separately!\n\n*NEW IN 2.0* FRONT CAMERA FLASH: When taking a photo with the front Camera, simply turn the flash on to illuminate the screen so you can take photos even when it’s pitch black!\n\n*NEW IN 2.0* WHITE BALANCE CONTROL: For the photographers who want more out of their camera, you can now switch between automatic and locked white balance!\n\n*NEW IN 2.0* CUSTOM PHOTO/VIDEO SIZES: Wanting to save space on your device? You can now adjust what resolution photos and videos are taken at!\n\n*NEW IN 2.0* CAMERA BUTTON FLASH: Hold down the camera button for a second, and the flash will turn on, allowing you to line up your subject before taking the photo!\n\n*NEW IN 2.0* FACEBOOK AND TWITTER INTEGRATION: Share your photos to Facebook and Twitter straight from within the app!\n\nGEOTAGGING: Camera Prime can embed location information in your photos/videos, just like the default camera app! That means you can see where your photos/videos were taken when uploading them to Flickr, viewing them in iPhoto, viewing them in the Photos app \"Places\" tab, etc.\n\nANTISHAKE: Wait until your iPhone is still, so you no longer have to worry about pictures coming out blurry!\n\nSOUND CAPTURE: Takes a picture when a loud sound, such as someone clapping their hands, is heard!\n\nTIMER: Set a timer for 1 to 60 seconds, so you have enough time to take a great group picture, with you in it!\n\nTHREE WAYS TO USE CAPTURED PHOTOS: After you take a photo, you can do one of three things: Add it to the Prime Review, a collection of your last 10 photos taken; review every photo, so you can easily decide which to save and which not to; and automatically save each one to the Camera Roll, just like the built in Camera app!\n\nVIDEO RECORDING: If you want to record a video, no problem! Just flip the switch in the bottom right corner to switch from still capture to video capture, and back again!\n\nCOMPLETE CAMERA ROLL INTEGRATION: Tap the icon in the bottom right corner to open the Camera Roll. There, you can view your pictures, pinch-to-zoom, rotate, share them via email or MMS, copy them, or watch any of your videos!\n\n3x3 GRID: Align your photos using a grid, so you never have to worry about the rule of thirds again!\n\nFULLSCREEN BUTTON: Just tap anywhere on the screen to take a picture. No more looking for that tiny camera button! Plus, it has a second function! If you are using antishake, sound capture, or timer, and realize you just want to take the photo already, tap anywhere on the camera preview to instantly take the picture!\n\nBURST MODE: Take three photos right after one another, so you don't have to worry about missing those quick moments!\n\nZOOM: Just like the default Camera app, zoom in up to 5x, and get the highest possible quality!\n\n..and much much more!\n\n*Follow @TestutTech on Twitter for all the latest news on updates*", "artistName": "Testut Tech", "artworkUrl512": "http://a1149.phobos.apple.com/us/r30/Purple/d0/d5/f5/mzl.yegqcnzh.png", "version": "2.0", "primaryGenreId": 6008, "primaryGenreName": "Photo & Video", "fileSizeBytes": "5232340", "price": 0.0, "isGameCenterEnabled": false, "trackCensoredName": "Camera Prime", "genreIds": ["6008", "6012"], "trackName": "Camera Prime", "releaseNotes": "IMPORTANT: Make sure you have launched Camera Prime AT LEAST once. This version of Camera Prime is now free, with an option to upgrade to the full version for a small fee. Since you have already downloaded Camera Prime, you WILL get the full version for free. However, if you do not launch Camera Prime at least once before updating, you will have to pay again. So please, just launch Camera Prime now to make sure you’ll get the the full version for free.\n\nALSO: A bug in iOS will cause Camera Prime to sometimes keep updating the location even in the background. To fix this, after installing 2.0 reset Location Warnings in the settings app, and then toggle Location Services for Camera Prime off then on. This is only needed to be done once.\n\nWe’re back, with loads of new features, better looks, and of course everyone’s favorite: bug fixes! Here’s the lowdown of what’s new in this huge update:\n\nNEW FEATURES:\n\n•Date & Time Stamp: The number one most requested feature, you can now overlay the date and time your pictures were taken onto your photos!\n\n•Separate Focus and Exposure: Another highly requested feature, now you can make your photos look more professional by changing the focus and exposure areas separately!\n\n•Front Camera Flash: When taking a photo with the front Camera, simply turn the flash on to illuminate the screen so you can take photos even when it’s pitch black!\n\n•White Balance Control: For the photographers who want more out of their camera, you can switch between automatic and locked white balance.\n\n•Custom Photo/Video Sizes: Wanting to save space on your device? You can now adjust what resolution photos and videos are taken at!\n\n•Camera Button Flash: Hold down the camera button for a second, and the flash will turn on, allowing you to line up your subject before taking the photo!\n\n•Burst Timer: You can set now a customizable delay between bursts so you can have a greater variance between your photos.\n\n•Pinch-to-Zoom: Just like with the default camera, you can now pinch-to-zoom in when taking a photo.\n\n•Facebook and Twitter integration: Share your photos to Facebook and Twitter straight from within the app!\n\n•AntiShake Sensitivity: Sometimes it’s too hard to keep your hands still, or maybe your photos are still turning out blurry. You can now adjust the antishake sensitivity to your liking!\n\n•Sound Delay: When snapping a photo using Sound Capture, there’s now an optional delay so you can rearrange yourself after making a loud noise.\n\n•Photo Count: You now have the option to disable the app icon badge displaying how many photos there are left to be saved in the app.\n\n•Printing: Print your photos on either full-sized printer paper or photo paper if your printer supports it.\n\n•Rotating Photos: Take a picture the wrong way? You can now rotate photos in the Prime Review!\n\nENHANCEMENTS:\n\n•The Switch Camera and Flash Control buttons both look identical to the ones in the default camera app.\n\n•Timer now respects the mute switch.\n\n•Grid now resizes depending on whether you’re taking a photo or recording video.\n\n•Switching between cameras now has an animation.\n\n•There is now a shutter animation when taking photos.\n\n•A numbered badge now appears on the Prime Review button to show how many photos are in the Prime Review.\n\n•Another numbered badge appears on the camera roll button to show how many photos are being saved.\n\n•Burst mode is faster than before.\n\n•Review All is much faster.\n\n•Misc. other UI enhancements\n\nBUG FIXES:\n•Fixed an issue where the app would crash upon launching the camera roll.\n\n•Fixed an issue where the app would crash when using the built in browser.\n\n•Fixed an issue where the camera roll would display an image rotated the wrong way.", "screenshotUrls": ["http://a1.mzstatic.com/us/r30/Purple/v4/c5/27/a8/c527a840-03b0-8831-343b-0d682542a56c/screen320x480.jpeg", "http://a4.mzstatic.com/us/r30/Purple/v4/c0/67/6d/c0676d97-1cd4-12df-e018-aa21992991de/screen320x480.jpeg", "http://a1.mzstatic.com/us/r30/Purple/v4/c2/9f/1c/c29f1cc0-075d-a06b-e404-de3d2cd05c91/screen320x480.jpeg", "http://a2.mzstatic.com/us/r30/Purple/v4/dd/be/4f/ddbe4f55-1269-1c52-aca3-9c3044b697c0/screen320x480.jpeg"], "userRatingCount": 79, "trackContentRating": "4+", "formattedPrice": "Free", "artistViewUrl": "https://itunes.apple.com/us/artist/testut-tech/id333195245?uo=4", "kind": "software", "averageUserRatingForCurrentVersion": 3.0, "sellerName": "Yvette Testut", "supportedDevices": ["iPhone-3G", "iPodTouchFifthGen", "iPodTouchourthGen", "iPhone4", "iPad2Wifi", "iPadFourthGen4G", "iPadFourthGen", "iPhone5s", "iPhone5", "iPhone5c", "iPadMini", "iPad23G", "iPhone-3GS", "iPadThirdGen4G", "iPhone4S", "iPadThirdGen", "iPadMini4G"], "artworkUrl100": "http://a1149.phobos.apple.com/us/r30/Purple/d0/d5/f5/mzl.yegqcnzh.png", "bundleId": "com.TestutTech.CameraPrime", "trackViewUrl": "https://itunes.apple.com/us/app/camera-prime/id389298844?mt=8&uo=4", "minimumOsVersion": "4.1", "artworkUrl60": "http://a942.phobos.apple.com/us/r30/Purple/dd/20/03/mzi.aneksonw.png", "averageUserRating": 3.5}