{"contentAdvisoryRating": "4+", "features": [], "languageCodesISO2A": ["EN"], "artworkUrl512": "http://a1065.phobos.apple.com/us/r30/Purple1/v4/39/03/43/39034334-fa62-d0df-aeb8-4d8e51c97506/mzl.upttitct.jpg", "releaseDate": "2010-09-28T02:46:14Z", "currency": "USD", "artistId": 369324272, "wrapperType": "software", "description": "Kinetic is the Swiss Army knife of GPS tracking and timing: configurable, expandable and beautifully designed. The perfect iPhone app for running, cycling, hiking, walking or simply tracking where you go.\n\nThe full version, Kinetic GPS is currently on sale! Get it now.\n \n.........................................................................\n\n\" I swore by CycleTracker until I found this. That's not to disparage CycleTracker at all, which still does the job nicely. But Kinetic is by far simpler, cleaner, more intuitive, and has all the same features in a much easier to use design. It also syncs with Daily Mile, which is likewise a much smarter and simpler fitness tracker than CycleTracker has with Training Peaks. \" - Customer review by JDob\n\n.........................................................................\n\nJust tap Start\nKinetic records everything for you: Time, distance, speed, pace, altitude (Google assisted), heading, compass, live mapping and more.\n\nRoll your own Kinetic\nKinetic's unique modules allow you to build your own app. Out-of-the-box Kinetic is ready to go but you can also add as many different modules as you want, arrange them in any order and change the settings to your heart's content. You can even change the app style to suite your outfit. The possibilities are endless.\n\nLog-book\nAll your workout data is automatically saved into a comprehensive training history. You can review and share (or show-off!) your best runs with family and friends: Dailymile, Facebook, Twitter and Email.\n\nSharing\nYou can review and share (show-off!) your best runs with family and friends: Dailymile, Facebook, Twitter, Email and now RunKeeper!\n\nPersonal trainer\nKinetic comes included with running training plans: 5k, 10k, half-marathon, for all levels. Developed by a former London Marathon winner, Kinetic’s training plans harness the expertise of some of the UK's most experienced runners and coaches. More training plans to come.\n\nChallenge yourself\nSet and measure your own personal targets and track your achievements as you progress through your goals. Kinetic will keep you informed on your progress.\n\nDon't miss a beat\nMonitor your heart rate in real-time. Plug-in your Wahoo Fitness key and wear your ANT+ rate monitor. Displays current, average and target range.\n\nReady, Steady, Wait!…\nRemember to warm-up first. Use the countdown timer for a delayed start to set your own custom warm-up times.\n\nRed lights!\nAs hard as we tried we could not make the traffic lights change green for you. But we did the next best thing and added Auto pause. Perfect for cyclists or urban-runners.\n\nNot just running\nChoose from a range of Activities or add your own, and create and edit your own personal outdoor sessions. No sweat, use Kinetic just for fun. keep track of you go.\n\n.........................................................................\n\nWhen you are ready get the full version. Includes Audible alerts.\n\n.........................................................................\n\nREQUIREMENTS: Kinetic App is compatible with iPhone 3GS, iPhone 4 running iOS 4.0 or later. Some features such as sharing, Google assisted altitude data require a wireless network for full functionality. Continued use of GPS running in the background can dramatically decrease battery life.", "genres": ["Health & Fitness", "Lifestyle"], "trackId": 390946616, "artistName": "Mothership Software Limited", "advisories": [], "version": "1.41", "primaryGenreId": 6013, "primaryGenreName": "Health & Fitness", "fileSizeBytes": "7342558", "price": 0.0, "isGameCenterEnabled": false, "trackCensoredName": "Kinetic Lite GPS", "genreIds": ["6013", "6012"], "trackName": "Kinetic Lite GPS", "releaseNotes": "• Fixed possible crash in iOS 7 when launching the app.\n• Updated Google analytics text (sorry about that!)", "sellerUrl": "http://kineticgps.com", "screenshotUrls": ["http://a4.mzstatic.com/us/r30/Purple4/v4/73/61/fa/7361fa16-7855-1a36-38ed-d8a426104f1f/screen1136x1136.jpeg", "http://a5.mzstatic.com/us/r30/Purple/v4/7c/64/88/7c648846-378d-cfe5-8510-38662088178f/screen1136x1136.jpeg", "http://a1.mzstatic.com/us/r30/Purple6/v4/b3/6e/a5/b36ea520-ddcf-d3c8-17b9-1ee9803cba10/screen1136x1136.jpeg", "http://a1.mzstatic.com/us/r30/Purple6/v4/65/29/69/65296992-a629-bb98-ac5b-5e0675ab6aa0/screen1136x1136.jpeg"], "userRatingCount": 47, "trackContentRating": "4+", "formattedPrice": "Free", "ipadScreenshotUrls": [], "artistViewUrl": "https://itunes.apple.com/us/artist/mothership-software-limited/id369324272?uo=4", "kind": "software", "sellerName": "Mothership Software Limited", "supportedDevices": ["iPadFourthGen4G", "iPodTouchFifthGen", "iPad2Wifi", "iPadThirdGen4G", "iPadThirdGen", "iPadMini4G", "iPhone5", "iPhone4S", "iPhone-3GS", "iPodTouchourthGen", "iPhone4", "iPadMini", "iPad23G", "iPhone5s", "iPadFourthGen", "iPhone5c"], "artworkUrl100": "http://a1065.phobos.apple.com/us/r30/Purple1/v4/39/03/43/39034334-fa62-d0df-aeb8-4d8e51c97506/mzl.upttitct.jpg", "bundleId": "com.wearemothership.kineticlite", "trackViewUrl": "https://itunes.apple.com/us/app/kinetic-lite-gps/id390946616?mt=8&uo=4", "minimumOsVersion": "6.0", "artworkUrl60": "http://a539.phobos.apple.com/us/r30/Purple3/v4/13/e9/a6/13e9a6e3-4eae-41ee-b875-ebc42e7a01d0/Icon.png", "averageUserRating": 4.0}