{"contentAdvisoryRating": "4+", "features": [], "languageCodesISO2A": ["NB", "CS", "DA", "NL", "EN", "FR", "DE", "IT", "JA", "PT", "RU", "ZH", "ES", "SV"], "ipadScreenshotUrls": ["http://a1.mzstatic.com/us/r30/Purple4/v4/8d/92/45/8d9245c0-f19a-ce8b-8953-b31c228a7abd/screen480x480.jpeg", "http://a3.mzstatic.com/us/r30/Purple4/v4/50/fd/67/50fd672a-8e09-5a6a-c96f-3c73b29f8808/screen480x480.jpeg", "http://a5.mzstatic.com/us/r30/Purple4/v4/94/30/fe/9430fe61-2dd5-d62f-ac9e-4c56ddfc946b/screen480x480.jpeg", "http://a1.mzstatic.com/us/r30/Purple6/v4/46/9f/05/469f0549-e440-29aa-adde-f77a01c59ea1/screen480x480.jpeg", "http://a2.mzstatic.com/us/r30/Purple/v4/a9/80/20/a9802087-6eaa-29ca-dea8-a88e261c72fc/screen480x480.jpeg"], "releaseDate": "2010-11-08T20:56:24Z", "currency": "USD", "artistId": 361210853, "userRatingCountForCurrentVersion": 2, "wrapperType": "software", "advisories": [], "genres": ["Catalogs", "Reference"], "trackId": 398956931, "description": "Important Notice! This application is for managing a movie collection. You can not download or watch movies with it.\n \nMy Movies for iPad allows you to catalog your entire movie collection from our high quality online data service containing data for more than 875,000 DVD, Blu-ray and HD DVD titles from various countries. If you have one or more titles that is not in our service, you can report it and it will be created within 48 hours by our staff - a service you will not find elsewhere.\n \nYou can evaluate the full application, by downloading My Movies for iPad Free, which is a freely available identical version with the exception of being limited to 50 titles, and only 10 items in release and trailer lists.\n \nYou can use My Movies for iPad as a standalone product, or use it as a companion to our My Movies software packages for Mac OS X, allowing you to keep your movie collection synchronized between clients.\n \nMy Movies for iPad requires you to create a user account, or log on to an existing My Movies account to be able to use the program. Your collection will follow your user account through our online servers, allowing you to switch between different clients without ever losing your data - we have clients available for iPhone, iPad and Mac OS X. If you log in to an existing My Movies account, your current collection will automatically be synchronized to your device.\n \nYou can within the program activate an online collection website of your movie collection, allowing you to send friends and family a website that allows them to browse your entire collection.\n \nWith My Movies for iPad, you can keep track of movies you own, previously have owned, rented or movies you wish to purchase. Never again will you have to purchase or rent a movie twice.\n \nNotice! If you have a problem or a suggestion, please contact us on support@mymovies.dk. We are unable to help you with problems if you only leave a comment in the market. The quality and stability of the application is our top priority, and we will happily help you with any problem you might have.\n \nFeature list: \n\n- Add by barcode search, title search, manual entry or camera scan. \n- High quality barcode scanner with multi-scan function. \n- Add to different groups (Owned, Wished and more). \n- Set purchase details (price, place and more). \n- Personalize with location, tags, notes, rating and more. \n- Browse with shelf, list or CoverFlow views. \n- Detail view with synopsis, full cast list, audio tracks, subtitles and much more.\n - Configure listed actors (10, 20, 30 or all). \n- Links to IMDB. \n- High quality front and back covers. \n- Watch trailers. \n- Search collection. \n- Multiple sort options. \n- Advanced filtering. \n- Integration with Facebook and Twitter. \n- Parental control functions. \n- Shake to random select. \n- E-mail movie list as TXT or CSV. \n- Loan titles to contacts and keep track. \n- Online title collection to share with family and friends (http://c.mymovies.dk/demonstration).\n - Tabbar badge with title and/or person count. \n- Person section with photos, biographies and starring in lists. \n- Releases section with upcoming DVD and Blu-ray's. \n- Use same collection on multiple devices with automatic online sync. \n- Automatic profile update for latest and most accurate data. \n- Remote control for Windows Media Center and Dune players. \n- Report missing titles to our staff. \n- Report incorrect data to our staff. \n\n- Much MORE!", "artistName": "Binnerup Consult", "artworkUrl512": "http://a1904.phobos.apple.com/us/r30/Purple3/v4/f7/ce/1b/f7ce1b13-3602-3831-1b9a-7fcdc77a81ce/pr_source.png?downloadKey=1417126724_916077b15334ad088fe2bad2b328225f", "version": "1.95", "primaryGenreId": 6022, "primaryGenreName": "Catalogs", "fileSizeBytes": "61841573", "price": 6.99, "isGameCenterEnabled": false, "trackCensoredName": "My Movies for iPad Pro", "genreIds": ["6022", "6006"], "trackName": "My Movies for iPad Pro", "releaseNotes": "IMPORTANT! If you are having problems with your collection after an upgrade, the problems can easily be resolved by a complete synchronization with the service. Your data is always safe in our online service. Contact us on support@mymovies.dk for instructions. \n\n- Fixes various problems on iOS 8.\n- Updated Facebook API due to required changes from Facebook.\n- Added push notification option.\n\nSubscribe to our newsletter from the application settings, for information about our upcoming new 2.00 application for iPhone and iPad, which will include many new features, a full new design and native graphical support for iPhone 6 and 6 Plus.", "sellerUrl": "http://www.mymovies.dk/products/ipad.aspx", "screenshotUrls": [], "userRatingCount": 1281, "trackContentRating": "4+", "formattedPrice": "$6.99", "artistViewUrl": "https://itunes.apple.com/us/artist/binnerup-consult/id361210853?uo=4", "kind": "software", "averageUserRatingForCurrentVersion": 5.0, "sellerName": "Binnerup Consult", "supportedDevices": ["iPad2Wifi", "iPad3G", "iPadWifi", "iPadMini4G", "iPadFourthGen4G", "iPadFourthGen", "iPadThirdGen4G", "iPadMini", "iPadThirdGen", "iPad23G"], "artworkUrl100": "http://a1904.phobos.apple.com/us/r30/Purple3/v4/f7/ce/1b/f7ce1b13-3602-3831-1b9a-7fcdc77a81ce/pr_source.png?downloadKey=1417126724_916077b15334ad088fe2bad2b328225f", "bundleId": "dk.mymovies.mymoviesforipad", "trackViewUrl": "https://itunes.apple.com/us/app/my-movies-for-ipad-pro/id398956931?mt=8&uo=4", "minimumOsVersion": "5.0", "artworkUrl60": "http://a527.phobos.apple.com/us/r30/Purple3/v4/55/d2/fa/55d2fa62-492c-a67d-4b14-3aaf1f37bc45/MyMovies_iPad_App_Icon72x72_U007eipad.png", "averageUserRating": 4.5}