{"contentAdvisoryRating": "12+", "features": [], "languageCodesISO2A": ["EN"], "ipadScreenshotUrls": [], "releaseDate": "2010-10-30T18:58:11Z", "currency": "USD", "artistId": 399842589, "userRatingCountForCurrentVersion": 15, "wrapperType": "software", "advisories": ["Infrequent/Mild Medical/Treatment Information"], "genres": ["Medical", "Education"], "trackId": 399842586, "description": "The most convenient way to do continuing medical education (CME) is now on your iPhone!\n\nOver 1 million active members already rely on Epocrates mobile and online resources to make informed medical decisions and improve patient safety. \n\nNow, the innovative FREE Epocrates CME app, powered by RealCME, is available to help practitioners fulfill continuing medical education requirements (CME/CE) requirements and stay up to date with the latest medical developments -- right on your iPhone/iPod touch.\n\nEpocrates CME offers the widest variety of unique, interactive continuing medical education activities across numerous specialty topics, with new activities added frequently. Activities are accredited by AMA, ACPE, ANCC and others and supported by an advanced personal CME toolset.\n\nWhat sets Epocrates CME apart?\n\n- Wide variety of engaging activity formats, with instant built-in feedback from esteemed experts\n\nChoose from a wide variety of CME activity formats that reflect real-world experiences of health professionals. Virtual Patient Visits and Virtual Grand Rounds integrate authentic decision-making opportunities, peer-to-peer interactions, and expert discussions. You’ll have the opportunity to manage patients over multiple visits and settings, and view how your selections compare with those chosen by the faculty and other participants.\n\n- Robust personal CME toolset to help you track credits and scores, compare your scores to other learners, and set and track goals\n\nAll completed credits are tracked automatically in your personal CME toolset and copies of your certificates are directly emailed to you. In addition, you can use this app to track your mastery of a particular topic in real-time, compare your mastery levels with other learners, review scores of completed activities, review all previously answered questions and correct answers along with faculty commentary, set up and track performance goals, schedule follow-up activities, and more!\n\n- Personalized CME Portfolio Report\n\nEvery three months you’ll receive a personal report summarizing all of the CME activities you’ve completed, activities that you’ve started but not completed, your progress against CME credit goals and performance goals, and a summary of your mastery levels by topic along with comparisons to all other learners.\n\n- Convenient online/mobile access\n\nYour activities are synced on both platforms to enable you to switch between your computer and mobile device while you work on a single activity. For example, start an activity on your iPhone, and finish it on your computer. You can also access Epocrates CME directly via an Internet browser at www.epocrates.com/cme.\n\nDownload this FREE app now ->\n\nPlease note: \nEpocrates CME iPhone app requires an Internet connection to view and complete activities. \nThe app is not compatible with iPhone 1st generation or iPod touch 1st generation. However, if you use one of those devices, you can still use our online CME resource at epocrates.com/cme.", "artistName": "RealCME, Inc.", "artworkUrl512": "http://a996.phobos.apple.com/us/r30/Purple5/v4/b8/54/05/b854057e-0b05-10b0-b0fe-ef29f3a435fd/mzl.ugndwbkt.png", "version": "2.2", "primaryGenreId": 6020, "primaryGenreName": "Medical", "fileSizeBytes": "3849113", "price": 0.0, "isGameCenterEnabled": false, "trackCensoredName": "Epocrates CME", "genreIds": ["6020", "6017"], "trackName": "Epocrates CME", "releaseNotes": "Bug fixes", "sellerUrl": "http://www.epocrates.com/cme/", "screenshotUrls": ["http://a1.mzstatic.com/us/r30/Purple/v4/17/35/33/17353315-a4e5-c51f-52dc-91ed3b230804/screen1136x1136.jpeg", "http://a5.mzstatic.com/us/r30/Purple6/v4/ed/88/b4/ed88b4ac-37ba-125c-b30f-aec376f5f4b9/screen1136x1136.jpeg", "http://a2.mzstatic.com/us/r30/Purple4/v4/c5/fd/40/c5fd4004-05c4-ca20-ce0e-96709d5e2c4b/screen1136x1136.jpeg", "http://a5.mzstatic.com/us/r30/Purple2/v4/a2/17/7a/a2177a3a-1040-fa50-85a0-5b9a18e6f839/screen1136x1136.jpeg", "http://a2.mzstatic.com/us/r30/Purple4/v4/c8/7b/c6/c87bc634-57f8-a1fc-d5e2-7c446953bbba/screen1136x1136.jpeg"], "userRatingCount": 1326, "trackContentRating": "12+", "formattedPrice": "Free", "artistViewUrl": "https://itunes.apple.com/us/artist/realcme-inc./id399842589?uo=4", "kind": "software", "averageUserRatingForCurrentVersion": 4.5, "sellerName": "RealCME, Inc.", "supportedDevices": ["iPadMini4G", "iPadFourthGen4G", "iPadThirdGen4G", "iPodTouchourthGen", "iPodTouchFifthGen", "iPadFourthGen", "iPhone4", "iPhone4S", "iPad2Wifi", "iPhone5c", "iPhone5s", "iPad23G", "iPhone-3GS", "iPadMini", "iPadThirdGen", "iPhone5"], "artworkUrl100": "http://a996.phobos.apple.com/us/r30/Purple5/v4/b8/54/05/b854057e-0b05-10b0-b0fe-ef29f3a435fd/mzl.ugndwbkt.png", "bundleId": "com.realcme.cme", "trackViewUrl": "https://itunes.apple.com/us/app/epocrates-cme/id399842586?mt=8&uo=4", "minimumOsVersion": "6.0", "artworkUrl60": "http://a382.phobos.apple.com/us/r30/Purple3/v4/50/51/08/50510871-8110-4530-f375-1bf4c566cc37/EpocrateCME57x57.png", "averageUserRating": 4.5}