{"contentAdvisoryRating": "4+", "features": ["iosUniversal"], "languageCodesISO2A": ["EN"], "ipadScreenshotUrls": ["http://a4.mzstatic.com/us/r30/Purple4/v4/e0/eb/59/e0eb5918-c21c-f3e1-e64e-b17a156ed7a2/screen480x480.jpeg", "http://a5.mzstatic.com/us/r30/Purple/v4/fa/70/18/fa70183d-79cd-8d67-eed8-15d8ec13d071/screen480x480.jpeg", "http://a2.mzstatic.com/us/r30/Purple/v4/c5/9e/85/c59e8520-442a-86a2-bc25-540d71a4039a/screen480x480.jpeg", "http://a1.mzstatic.com/us/r30/Purple/v4/ff/48/3e/ff483efd-3ea5-8c89-c58c-d8d410ed6a85/screen480x480.jpeg", "http://a4.mzstatic.com/us/r30/Purple4/v4/e0/85/d1/e085d1ae-edbe-103f-4a06-bf45ca61d61d/screen480x480.jpeg"], "releaseDate": "2011-01-18T08:00:00Z", "currency": "USD", "artistId": 401673979, "userRatingCountForCurrentVersion": 27, "wrapperType": "software", "advisories": [], "genres": ["Entertainment", "Utilities"], "trackId": 401673976, "description": "The free TiVo App for iOS is the ultimate entertainment app serving up control, discovery and a mobile place for viewing. Watch live or recorded TV via your TiVo, find shows and schedule recordings and browse content via the guide, by genre or category, explore the cast and crew, and even see where the content is available whether it be through cable TV, Netflix, Hulu PlusTM, YouTube, Amazon Instant Video, through VOD in certain markets and more. \u2028\u2028\n\n“What to Watch Now” combines real-time viewing data, recommendations and personal preferences to create a custom dashboard presenting the exact content you want most every time you sit down to watch TV.  This feature allows you to categorize by content that is on TV now, starting within the next 30 minutes, or on later tonight. The TiVo app also allows you to watch content from your favorite Social Media feeds like Facebook and YouTube from the “What to Watch Now” screen.  Categories include: Popular on TV, Sports on Now, Powered by Thuuz, Movies on TV, Kids, Favorite Channels, Viewer’s recorded TV, Shared by Friends, Popular on YouTube, and My YouTube Channels.\n\nTiVo Roamio Plus and TiVo Roamio Pro users can seamlessly stream live or recorded programming to their iOS devices from anywhere there is a WiFi signal. Download recordings while at home or away via WiFi or cellular to watch when you have no connection. TiVo Stream users can stream live or recorded content to iOS devices within their home network and download shows to go. \u2028\u2028\u2028\n\nFeatures of the TiVo app (some features are only available to TiVo Premiere or TiVo Roamio DVR customers): \u2028\u2028\n\n> Out-of-home & in-home streaming: watch your live or recorded shows remotely anywhere you have Wi-Fi \u2028\u2028\n\n> Out-of-home and in-home downloading: download your content to enjoy anywhere so that low bandwidth or lack of a Wi-Fi connection never slows you down \u2028\u2028\n\n> What to Watch Now: no matter where you are, TiVo’s second screen dashboard provides instantaneous personalized recommendations the second you pull up your TiVo app, providing you with available content options to watch now, in the next 30 minutes, or tonight.  \u2028\u2028\n\n> Remote scheduling: browse and view the programming guide, manage recordings, check your To-Do List or set a Season Pass® any time – no matter where you are \u2028\u2028\n\n> Mobile Search & discovery: figure out what’s on whether you’re in the office or a hotel and enjoy the same browsing tools you have with your TiVo at home (including the TiVo editorial Collections and show, cast and actor information) \u2028\u2028\n\n> Use a TiVo remote control replica or our intuitive, gesture-based remote control \u2028\u2028\n\n> Search across TV, Netflix, Amazon Instant Video & Hulu Plus – and get integrated results on what you’re looking for \u2028\u2028\n\n> Explore cast and crew while watching a show \u2028\u2028\n\n> And much more \u2028\u2028\n\nHaving troubles finding or connecting to your TiVo DVR? Try one or more of these steps:\u2028\u2028\n* Restart your network router by unplugging it, waiting 30 seconds, and plugging it back in \u2028\u2028\n\n* Restart your TiVo DVR by following the instructions in the TiVo menus under Settings & Messages > Help > Restart or Reset System > Restart the TiVo Box", "artistName": "TiVo Inc.", "artworkUrl512": "http://a1650.phobos.apple.com/us/r30/Purple3/v4/eb/5d/8e/eb5d8e4a-3733-8729-3b12-bc77498bed7a/pr_source.png?downloadKey=1417126427_982b7b857f9e637ede5118d06c84c6dd", "version": "3.4.1", "primaryGenreId": 6016, "primaryGenreName": "Entertainment", "fileSizeBytes": "20650825", "price": 0.0, "isGameCenterEnabled": false, "trackCensoredName": "TiVo", "genreIds": ["6016", "6002"], "trackName": "TiVo", "releaseNotes": "- We’ve addressed a network discovery issue that resulted in a crash at startup when running iOS 8.\n\n- We’ve fixed the To Do List and Season Pass Manager for Series 3 DVR users.\n\n-We’ve also worked on our login and password reset flows to make sure that we could help those of you that could not convert from the MAK login. If you were to still have issues with the login functionality in this update or did not receive a temporary password within 15 minutes of your request, please refer to our Support team (http://support.tivo.com/app/answers/detail/a_id/1279/session/L3NpZC9BX25Jb1E3bQ%3D%3D).\n\n- Our Winter update (20.4.5) of TiVo Roamio Plus, Roamio Pro and TiVo Stream brings enhancements to our streaming feature that we hope will get you to enjoy streaming your favorite shows at home and away more than ever.\n\nThis update should already be available on your TiVo Roamio Plus, TiVo Roamio Pro or TiVo Stream. You can confirm it is installed on your TiVo DVR/Stream unit by checking the “Software Version” in “Settings->Streaming\\System Information” menu in your TiVo iOS App.", "sellerUrl": "http://www.tivo.com/discover/mobile", "screenshotUrls": ["http://a4.mzstatic.com/us/r30/Purple/v4/e1/54/51/e154511c-e5f1-ac38-1306-777d1c7cacf5/screen1136x1136.jpeg", "http://a1.mzstatic.com/us/r30/Purple3/v4/67/bd/1f/67bd1f28-39fa-326d-078c-2fdff06ace79/screen1136x1136.jpeg", "http://a5.mzstatic.com/us/r30/Purple4/v4/f7/83/13/f783133b-f8c4-888f-c9db-e324d9259fe9/screen320x320.jpeg", "http://a4.mzstatic.com/us/r30/Purple/v4/e2/f6/8c/e2f68c5f-36e1-cec9-8ff9-4e4fc06c360e/screen1136x1136.jpeg"], "userRatingCount": 6214, "trackContentRating": "4+", "formattedPrice": "Free", "artistViewUrl": "https://itunes.apple.com/us/artist/tivo-inc./id401673979?uo=4", "kind": "software", "averageUserRatingForCurrentVersion": 3.0, "sellerName": "TiVo, Inc", "supportedDevices": ["iPadMini", "iPadThirdGen4G", "iPad23G", "iPhone4", "iPad2Wifi", "iPadMini4G", "iPhone4S", "iPadThirdGen", "iPadFourthGen", "iPhone5s", "iPhone5", "iPodTouchFifthGen", "iPadFourthGen4G", "iPhone5c"], "artworkUrl100": "http://a1650.phobos.apple.com/us/r30/Purple3/v4/eb/5d/8e/eb5d8e4a-3733-8729-3b12-bc77498bed7a/pr_source.png?downloadKey=1417126427_982b7b857f9e637ede5118d06c84c6dd", "bundleId": "com.tivo.quicksilver", "trackViewUrl": "https://itunes.apple.com/us/app/tivo/id401673976?mt=8&uo=4", "minimumOsVersion": "7.0", "artworkUrl60": "http://a939.phobos.apple.com/us/r30/Purple5/v4/e7/e0/e7/e7e0e73c-f48c-3816-6a68-8b33c3541a56/Icon.png", "averageUserRating": 4.0}