{"contentAdvisoryRating": "4+", "features": [], "languageCodesISO2A": ["EN"], "ipadScreenshotUrls": [], "releaseDate": "2010-12-12T08:00:00Z", "currency": "USD", "artistId": 403598971, "userRatingCountForCurrentVersion": 6, "wrapperType": "software", "advisories": [], "genres": ["Finance"], "trackId": 403598968, "description": "Stay on top of your finances, while keeping up with your busy schedule with Comerica Mobile Banking®.\n\nComerica Mobile Banking lets you control where and when you bank. (1)\n\n•Check account balances and activity\n\n•Transfer funds between your Comerica accounts \n\n•Pay Bills and eBills\n\n•Deposit checks\n\n•Send money to another person by using their mobile phone number or email address\n\n•Receive immediate text or email notifications on your account\n\n•Find Comerica banking centers and ATMs \n\nSecurity\nComerica is committed to mobile banking security.  To protect your personal information from unauthorized access and use, we use security measures that comply with federal law.  These measures include computer safeguards and secured files and buildings.\n\nDisclosures\nComerica Bank. Member FDIC.\n\n1 Comerica Mobile Banking is available to Comerica Web Banking® customers. Balances and transaction details are only available for certain Comerica accounts. Bill payment can only be done with existing billers set up through Comerica Web Bill Pay®.  Comerica will bear the responsibility for any late-payment related charges (up to $50) should a payment arrive after its due date, as long as your payment was scheduled in accordance with Comerica Web Banking Terms and Conditions. To view the Comerica Web Banking Terms and Conditions, log into Comerica Web Banking and click on the Self Service tab. Standard text and data rates may apply.  Check with your mobile service provider for details on specific fees and charges. \n\n2 Comerica Click&Capture Deposit(SM) is available to customers that have both Comerica Web Banking® and Comerica Mobile Banking®.  Deposits are subject to verification and not available for immediate withdrawal. Please keep your mobile deposited paper check(s) in a safe place until the funds are posted to your account, then securely destroy them. Regular deposit fees may apply, see your Account Fee brochure for fee information.  Deposit limits and other restrictions may apply per deposit. For additional details and deposit limit amounts, please refer to the Comerica Mobile Banking Terms and Conditions.  To view the Comerica Mobile Banking Terms and Conditions, log into Comerica Web Banking and click on the Self Service tab. Standard message and data rates may apply. Check with your mobile service provider for details on specific fees and charges.   \n\n3 Must be enrolled in Comerica Web Banking® and in the Comerica Person to Person Transfer service. Refer to the user addendum for Comerica Person to Person Transfer Service, which supplements the Comerica Web Banking® Terms and Conditions, for details. Both you and the other person need a United States bank account; only one person is required to have a Comerica deposit account. The Request Money function is not available through Comerica Mobile Banking. To view the Comerica Web Banking Terms and Conditions, and the applicable user addendum, log into Comerica Web Banking and click on the Self Service tab. Additional fees and limitations may apply.\nComerica Mobile App is available for Apple® iPhone® and iPad®. Apple iPhone and iPad are registered trademarks of Apple, Inc. Comerica is not endorsed, sponsored, affiliated with or otherwise authorized by Apple, Inc.", "artistName": "Comerica Bank", "artworkUrl512": "http://a715.phobos.apple.com/us/r30/Purple3/v4/c3/37/5f/c3375f63-38a8-4b72-8e87-3f7b86e7412a/mzl.djuujkxy.png", "version": "2.0.2", "primaryGenreId": 6015, "primaryGenreName": "Finance", "fileSizeBytes": "2664789", "price": 0.0, "isGameCenterEnabled": false, "trackCensoredName": "Comerica Mobile Banking®", "genreIds": ["6015"], "trackName": "Comerica Mobile Banking®", "releaseNotes": "Newest Features (v2.0.2): \n•iOS 8 updates", "sellerUrl": "http://www.comerica.com/mobile", "screenshotUrls": ["http://a3.mzstatic.com/us/r30/Purple6/v4/26/be/3f/26be3f6b-75e0-5c59-7c6f-a10d25e4c25a/screen322x572.jpeg", "http://a3.mzstatic.com/us/r30/Purple2/v4/1b/2b/37/1b2b3750-718b-baf8-ec8d-a5beb94fb36e/screen322x572.jpeg", "http://a2.mzstatic.com/us/r30/Purple2/v4/f5/8c/bb/f58cbbea-68b4-bc4c-c9ee-aecf863345c3/screen322x572.jpeg", "http://a3.mzstatic.com/us/r30/Purple/v4/c4/86/1e/c4861efc-0e95-2371-9c9c-12f3e1234151/screen322x572.jpeg", "http://a5.mzstatic.com/us/r30/Purple/v4/d0/44/f9/d044f90f-c984-0b59-1d8d-3e7ba6bcc272/screen322x572.jpeg"], "userRatingCount": 189, "trackContentRating": "4+", "formattedPrice": "Free", "artistViewUrl": "https://itunes.apple.com/us/artist/comerica-bank/id403598971?uo=4", "kind": "software", "averageUserRatingForCurrentVersion": 3.0, "sellerName": "Comerica Bank", "supportedDevices": ["iPad3G", "iPadThirdGen", "iPhone5", "iPad23G", "iPhone5c", "iPadWifi", "iPhone5s", "iPodTouchourthGen", "iPadMini", "iPadMini4G", "iPadFourthGen", "iPhone4S", "iPodTouchThirdGen", "iPodTouchFifthGen", "iPhone-3GS", "iPad2Wifi", "iPadFourthGen4G", "iPhone4", "iPadThirdGen4G"], "artworkUrl100": "http://a715.phobos.apple.com/us/r30/Purple3/v4/c3/37/5f/c3375f63-38a8-4b72-8e87-3f7b86e7412a/mzl.djuujkxy.png", "bundleId": "com.comerica.mobilebanking", "trackViewUrl": "https://itunes.apple.com/us/app/comerica-mobile-banking/id403598968?mt=8&uo=4", "minimumOsVersion": "4.3", "artworkUrl60": "http://a1898.phobos.apple.com/us/r30/Purple3/v4/75/e0/cb/75e0cb59-a7e6-b1cc-1aa5-6f45520f1013/icon.png", "averageUserRating": 3.0}