{"contentAdvisoryRating": "4+", "features": [], "languageCodesISO2A": ["EN", "FR", "DE", "IT", "JA", "PT", "ZH", "ES", "ZH"], "ipadScreenshotUrls": [], "releaseDate": "2010-11-25T18:28:25Z", "currency": "USD", "artistId": 404849390, "userRatingCountForCurrentVersion": 5, "wrapperType": "software", "advisories": [], "genres": ["Lifestyle", "Health & Fitness"], "trackId": 404849387, "description": "Keep REI close at hand wherever your adventures take you. More than just another clothing app, the REI Shopping App gives you quick access to a huge selection of top-brand outdoor gear and clothing. What other shopping app can help you find everything you need for camping, backpacking, cycling, climbing, kayaking, skiing, snowboarding, fitness and more? Whether you’re looking for men’s clothing, kids’ shoes, women’s apparel, or nearly any other outdoor gear, use our shopping app to purchase right from your phone or check product availability at your local REI store.\n\nFeatures\nSEARCH: Easily find outdoor gear and apparel on our shopping app. Check out product information, specs and customer reviews. \n\nSHOP OUTDOOR GEAR: Buy the gear you love right from your phone. The REI shopping app makes it a snap. Enjoy crisp product images, access customer reviews, easily shop by size and color, watch product videos, and see what other customers viewed and purchased. \n\nCHECK STORE AVAILABILITY: Find the products you want at a nearby REI store, straight from your iPhone. Whether you’re looking at small item like a piece of men’s clothing, or large outdoor gear like a kayak or tent, remember that you can ship it for free to an REI store near you. \n\nSCAN REI PRODUCTS: From inside an REI store, use our shopping app to scan product barcodes to view product information and customer reviews, and to add your dream outdoor gear and apparel to your wish list.\n\nLOCATE A STORE: Need gear or apparel while you're on the go? Use the store locator on our shopping app to find the closest REI store.\n\nSHARE WHAT YOU LIKE: Let your friends know about your favorite REI outdoor gear and apparel through Facebook, Twitter, and email. \n\nCONNECT WITH CUSTOMER SERVICE: Have questions? Use your phone as a phone! Call a friendly REI customer service representative with the touch of a button. \n\nGET EASY ACCESS TO YOUR REI MEMBERSHIP INFO: Check your dividend, look up your member number and save it for easy retrieval. Even brag about your dividend balance via Facebook and Twitter to make your friends jealous. Add your REI membership number to Passbook for easier access. \n\nSTAY IN TOUCH: Our shopping app can deliver notifications on REI sales events and other happenings to a special REI message center on your phone.\n\nSEE OUR DEAL OF THE DAY: You can save 50% or more on the best names in outdoor gear and apparel—but only if you know about these deals and act fast! Whether you’re looking for camping gear, men’s clothing or women’s apparel, mere clothing apps don’t offer the variety of outdoor gear and clothing that we do.\n\nWe recommend keeping your device updated with the latest iOS firmware to ensure the best REI experience. The REI shopping app currently supports iOS 7.0 and higher.", "artistName": "Recreational Equipment, Inc", "artworkUrl512": "http://a542.phobos.apple.com/us/r30/Purple3/v4/9d/48/43/9d4843ef-2ef8-6912-78bb-81d25ae44b50/pr_source.png?downloadKey=1417125762_323ddef1146949d1310d7a5d0a551af2", "version": "3.6.1", "primaryGenreId": 6012, "primaryGenreName": "Lifestyle", "fileSizeBytes": "19979809", "price": 0.0, "isGameCenterEnabled": false, "trackCensoredName": "REI – Shop Outdoor Gear", "genreIds": ["6012", "6013"], "trackName": "REI – Shop Outdoor Gear", "releaseNotes": "• Log-in woes? We hear you! The app now stores the last username entered to save you typing fun at log in. Stay tuned for more log-in improvements.\n• Add your membership to Passbook without that annoying, endless spinner. (Just turn location services on when you’re prompted in the app.)\n• Going big or going home? So are we! Layout updates support larger iPhone 6 and 6 Plus formats.\n• Credit card entry improvements. Enjoy easier entry of your CVV and 4-digit AmEx support.", "sellerUrl": "http://www.rei.com/mobile", "screenshotUrls": ["http://a2.mzstatic.com/us/r30/Purple1/v4/56/43/4b/56434b21-e629-2f66-c2f0-5407192f0177/screen1136x1136.jpeg", "http://a1.mzstatic.com/us/r30/Purple5/v4/11/a3/07/11a307b8-8acf-27da-956a-d44b2fc348b0/screen1136x1136.jpeg", "http://a3.mzstatic.com/us/r30/Purple5/v4/f4/dc/2c/f4dc2c66-1cc5-23ae-efe2-7420ae94ea48/screen1136x1136.jpeg", "http://a1.mzstatic.com/us/r30/Purple3/v4/e3/d5/59/e3d559e7-5111-6e60-e01c-9519b4c05d9b/screen1136x1136.jpeg", "http://a2.mzstatic.com/us/r30/Purple3/v4/44/cc/c3/44ccc33f-f4ac-e918-4d5e-48e7c21fe53b/screen1136x1136.jpeg"], "userRatingCount": 4928, "trackContentRating": "4+", "formattedPrice": "Free", "artistViewUrl": "https://itunes.apple.com/us/artist/recreational-equipment-inc/id404849390?uo=4", "kind": "software", "averageUserRatingForCurrentVersion": 1.5, "sellerName": "Recreational Equipment, Inc", "supportedDevices": ["iPadThirdGen4G", "iPad2Wifi", "iPadFourthGen4G", "iPadThirdGen", "iPhone4", "iPad23G", "iPhone5c", "iPadMini4G", "iPadMini", "iPadFourthGen", "iPhone4S", "iPhone5", "iPhone5s", "iPodTouchFifthGen"], "artworkUrl100": "http://a542.phobos.apple.com/us/r30/Purple3/v4/9d/48/43/9d4843ef-2ef8-6912-78bb-81d25ae44b50/pr_source.png?downloadKey=1417125762_323ddef1146949d1310d7a5d0a551af2", "bundleId": "com.rei.eCommerce", "trackViewUrl": "https://itunes.apple.com/us/app/rei-shop-outdoor-gear/id404849387?mt=8&uo=4", "minimumOsVersion": "7.0", "artworkUrl60": "http://a543.phobos.apple.com/us/r30/Purple5/v4/b8/93/7e/b8937e3f-57cb-38eb-6fad-92703d0d5fdd/AppIcon60x60_U00402x.png", "averageUserRating": 4.5}