{"contentAdvisoryRating": "4+", "features": ["iosUniversal"], "languageCodesISO2A": ["EN"], "ipadScreenshotUrls": ["http://a1.mzstatic.com/us/r30/Purple/v4/cc/4d/c3/cc4dc351-458e-43ee-a3e9-9dfc7d7eed24/screen480x480.jpeg", "http://a5.mzstatic.com/us/r30/Purple/v4/e4/57/90/e457909e-c62e-3fdd-cac1-8376196835eb/screen480x480.jpeg", "http://a2.mzstatic.com/us/r30/Purple/v4/43/a4/e0/43a4e052-34c3-fa5f-0df8-02351946f84e/screen480x480.jpeg"], "releaseDate": "2011-07-12T23:33:43Z", "currency": "USD", "artistId": 409370681, "userRatingCountForCurrentVersion": 16, "wrapperType": "software", "advisories": [], "genres": ["Books", "Education"], "trackId": 409370678, "description": "Download Blio, a FREE app for iPhone and iPad that will have you reading eBooks as never before. \n\nBlio is smart. Smart enough to know that books are more than just words: there’s style, presentation, and a world of color. And smart enough to know all of that enhances your reading experience.  That’s what you love about books. So books in Blio have the same layout, fonts, and full-color images that you enjoy in the print version of your favorite titles.  Finally there’s an eBook reader that brings not only novels but cookbooks, travel guides, how-to manuals, textbooks, and children’s books to life.  \n\nBut eBooks are intended to be different… that’s why they put that little “e” in front of “book”. eBooks should do more: they should leverage everything that the device you’re reading on is capable of. Blio does just that. Many books can read aloud by a text-to-speech voice (purchase required) or audiobook, with words highlighted as they are spoken. You can look up words you might not be familiar with or get more information on a topic by searching Google, Wikipedia, and more without ever leaving your book. \n\nReading eBooks should be enjoyable and easy, no matter where you are, and no matter what device you’re reading on. So Blio offers ReadLogic, a feature that knows to automatically zoom and navigate to the next logical place for you to read, whether it’s the next paragraph, a caption, or a sidebar.  Then there’s the Blio Bookvault, a virtual library that you can access from anywhere.  So you can read a book on any of your devices. \n\nBlio lets you choose which way to view a book, including single page, dual page, flowed view, or speed reading view, all kept in sync as you read the book.  You can go to the next page by tapping or swiping, with a three-dimensional effect that will astound you.\n\nBecause eBooks should be for everybody, Blio is.  Synchronized highlighting of words and a serial presentation view can assist those with reading disabilities.  On iOS 5.0 and above, Blio empowers the visually impaired to do anything that fully sighted users can do, including reading in any of the available views.\n\nYou can download books you've bought from the Blio Bookstore, where you’ll find the latest titles from over a hundred top publishers.  You can add as many free books as you like, in EPUB, PDF, or XPS formats, via iTunes or the web.\n\nTry a whole new eBook experience with Blio, where books are more than words.\n        \n\nTop Features:\n        \nDisplays books in full color, with fonts, pictures, and layout as the publisher intended. \n\nSupport for the visually impaired and those with reading disabilities.\n\nSync up to five devices so your books can go wherever you go.\n\nAccess all of your content, and download it to your device from anywhere you have an internet connection. \n\nBlock navigation mode intelligently zooms to the next logical text block to simplify reading, even on small devices.\n\nMultiple reading views, including fixed layout view, single page, dual page, flowed view, or fast reading view*, all kept in sync as you read the book.\n\nAdd notes and highlights to a page, with five color options, saved across your reading sessions.\n\nLook up phrases or topics in the included browser, without ever leaving the context of your book \n\nHave Blio read to you, highlighting each word as it does.**  \n\nAdd free books in PDF, EPUB, or XPS format from iTunes or Safari.  \n\n\n\nRequirements:\n\niPhone 5s, iPhone 5c, iPhone 5, iPhone 4s, iPhone 4, iPhone 3Gs, any iPad, iPod Touch 3rd generation or higher\n\niOS 4.3 or higher\niOS 3.2 no longer supported\n\n* iPhone only\n\n** for audiobooks, or rights-enabled books when TTS voice is purchased.", "artistName": "K-NFB Reading Technology, Inc.", "artworkUrl512": "http://a1669.phobos.apple.com/us/r30/Purple4/v4/87/5b/41/875b410d-a91c-833f-f7f8-ea9d627b36b2/mzl.aprvgdqr.png", "version": "4.2", "primaryGenreId": 6018, "primaryGenreName": "Book", "fileSizeBytes": "31145404", "price": 0.0, "isGameCenterEnabled": false, "trackCensoredName": "Blio", "genreIds": ["6018", "6017"], "trackName": "Blio", "releaseNotes": "bug fixes", "sellerUrl": "http://www.blio.com", "screenshotUrls": ["http://a3.mzstatic.com/us/r30/Purple/v4/ca/3b/78/ca3b78a6-74ed-2381-5274-170c4c60b9c0/screen1136x1136.jpeg", "http://a1.mzstatic.com/us/r30/Purple/v4/7d/78/fd/7d78fd6d-38ab-d68e-6afd-a640daded7e9/screen1136x1136.jpeg", "http://a1.mzstatic.com/us/r30/Purple/v4/8f/46/8a/8f468a84-f189-3220-df13-3e50ffbc9f54/screen1136x1136.jpeg", "http://a5.mzstatic.com/us/r30/Purple/v4/89/7f/d5/897fd506-c166-04ed-d8d6-6f4dddc71e96/screen1136x1136.jpeg"], "userRatingCount": 219, "trackContentRating": "4+", "formattedPrice": "Free", "artistViewUrl": "https://itunes.apple.com/us/artist/k-nfb-reading-technology-inc./id409370681?uo=4", "kind": "software", "averageUserRatingForCurrentVersion": 3.0, "sellerName": "K-NFB Reading Technology Inc.", "supportedDevices": ["iPodTouchourthGen", "iPhone5", "iPodTouchThirdGen", "iPadWifi", "iPhone4", "iPhone4S", "iPadThirdGen4G", "iPodTouchFifthGen", "iPadFourthGen", "iPadMini", "iPhone-3GS", "iPhone5s", "iPadFourthGen4G", "iPhone5c", "iPadThirdGen", "iPad3G", "iPad23G", "iPad2Wifi", "iPadMini4G"], "artworkUrl100": "http://a1669.phobos.apple.com/us/r30/Purple4/v4/87/5b/41/875b410d-a91c-833f-f7f8-ea9d627b36b2/mzl.aprvgdqr.png", "bundleId": "com.knfbreading.Blio", "trackViewUrl": "https://itunes.apple.com/us/app/blio/id409370678?mt=8&uo=4", "minimumOsVersion": "4.0", "artworkUrl60": "http://a1240.phobos.apple.com/us/r30/Purple4/v4/ec/c5/e2/ecc5e2c6-8625-1502-282f-e77d46abae20/Icon.png", "averageUserRating": 2.5}