{"contentAdvisoryRating": "9+", "features": ["gameCenter", "iosUniversal"], "languageCodesISO2A": ["EN", "PL"], "ipadScreenshotUrls": ["http://a5.mzstatic.com/us/r30/Purple6/v4/78/cb/10/78cb1078-cda7-e332-7319-1c473a59e87e/screen480x480.jpeg", "http://a1.mzstatic.com/us/r30/Purple6/v4/65/a8/36/65a836e6-9638-8169-0f05-91b088f9ae5a/screen480x480.jpeg", "http://a1.mzstatic.com/us/r30/Purple/v4/ea/47/11/ea471191-557d-c452-f610-cfe7c3a3a9d9/screen480x480.jpeg", "http://a1.mzstatic.com/us/r30/Purple4/v4/cf/19/eb/cf19ebed-cd39-9b54-2795-36808b79cc76/screen480x480.jpeg", "http://a1.mzstatic.com/us/r30/Purple6/v4/31/7d/3d/317d3dca-fceb-7afc-9f66-2cdf35bcecf3/screen480x480.jpeg"], "releaseDate": "2011-01-06T14:20:50Z", "currency": "USD", "artistId": 412797641, "userRatingCountForCurrentVersion": 239, "wrapperType": "software", "advisories": ["Infrequent/Mild Cartoon or Fantasy Violence"], "genres": ["Reference", "Utilities"], "trackId": 412798013, "description": "iMtG is probably the most advanced and innovative Magic: the Gathering toolbox app in the App Store. It has camera Scan function linked to Card Database with pricing, beautiful coverflow views of card lists and decks, unique Magic Binders collection management, Facebook deck sharing and in-app Gathering community forum.\n\nLife Counter is easy to use, yet fully functional. It supports portrait and landscape modes. It has multiplayer support with Commander damage tracking and separate poison counters for 2-Headed Giant team. Multiple iMtG Life Counters can be linked over Bluetooth or Game Center, which is really cool.\n\nDeck Builder includes sample play / fish tool, mana statistics, export by Email and sharing on Facebook. You can use Import from iTunes or Dropbox to upgrade from other MTG deck builders which support .dec file format.\n\nCard Database has up to date pricing and advanced collection management. You can set how many you need, own and want to trade of each card. It will add the card to the appropriate report in the Main Menu. As soon as a new expansion is released, you can update your database in Settings -> Tools.\n\nMagic Binders are digital reflection of your physical binders, allowing you to keep your collection data always with you, on the move and in the net. Mark your cards as foils, signed, set condition and language version, make notes. Post your collection's trading part online with a press of a button as Private Page on Gathering.\n\nGathering is our thriving MTG community forum and it's linked to Multiverse, a geolocation feature.\n\nTrade module contains quick Price Check and Trading tool, together with Needed and Trade Binder. Needed list is especially handy when you are heading for your local shop to do some trading, and you are guaranteed to wow your friends when you show them what you need in a stunning landscape coverflow view. Prices are courtesy of TCGplayer.com, displayed in configurable currency and multiplied by configurable factor, so you can adjust for your local market. Trading is integrated with Potential Trades, an automatic trade matching system for Gathering users.\n\nWhile iMtG is mostly free, in the built-in Shop you can pay to unlock optional functionality. Offline cache enables foil prices, mass update tool and background price fetching on card lists. You can also unlock unlimited decks maintenance and add handy Clone function to test different versions of the same deck, in-app access to card rulings, unlimited scanning, unlimited binders, advanced trading functions and card translations.\n\nPlease note the Support and Feedback option, the use of which I greatly appreciate.\n\nFor the latest news and development updates follow me on twitter @iMtGApp\n\nYou can also contact us on Gathering, where we discuss life and magic in general.\n\n\n\nWizards of the Coast, Magic: The Gathering, and their logos are trademarks of Wizards of the Coast LLC in the United States and other countries. Copyright 2009 Wizards. All Rights Reserved.\n\niMtG is owned by Farbiszewski.com and is not affiliated with, endorsed, sponsored, specifically approved or authorized by Wizards of the Coast LLC. \n\nWe do endorse WotC's Magic 2014 though, we think it is the most advanced and innovative Magic: the Gathering non-toolbox app in the App Store. ;)", "artistName": "PIOTR FARBISZEWSKI", "artworkUrl512": "http://a43.phobos.apple.com/us/r30/Purple6/v4/ce/bc/78/cebc78cf-72cf-bbf9-d3b2-31c816497897/mzl.ixkmbuph.png", "version": "4.6.2", "primaryGenreId": 6006, "primaryGenreName": "Reference", "fileSizeBytes": "17910760", "price": 0.0, "isGameCenterEnabled": true, "trackCensoredName": "iMtG", "genreIds": ["6006", "6002"], "trackName": "iMtG", "releaseNotes": "Updated UI.\nLogical AND, OR and NOT in selections when filtering card lists.\nMulti add in Deck Builder.", "sellerUrl": "http://imtgapp.com", "screenshotUrls": ["http://a3.mzstatic.com/us/r30/Purple/v4/4a/fa/58/4afa5819-6fa4-1fe8-c230-2230b8782999/screen1136x1136.jpeg", "http://a5.mzstatic.com/us/r30/Purple/v4/26/8b/c6/268bc6ab-dd11-9467-2002-1865822af714/screen1136x1136.jpeg", "http://a5.mzstatic.com/us/r30/Purple4/v4/c3/93/7f/c3937f20-e555-a613-29d2-eb78b95494d2/screen1136x1136.jpeg", "http://a5.mzstatic.com/us/r30/Purple4/v4/b1/28/57/b12857ee-ae69-d747-869f-4422754cae59/screen1136x1136.jpeg", "http://a1.mzstatic.com/us/r30/Purple/v4/b1/c4/99/b1c49982-1c62-edcb-6609-5e99f5a8acc0/screen1136x1136.jpeg"], "userRatingCount": 3274, "trackContentRating": "9+", "formattedPrice": "Free", "artistViewUrl": "https://itunes.apple.com/us/artist/piotr-farbiszewski/id412797641?uo=4", "kind": "software", "averageUserRatingForCurrentVersion": 4.5, "sellerName": "PIOTR FARBISZEWSKI", "supportedDevices": ["iPhone-3GS", "iPadFourthGen4G", "iPhone4S", "iPhone5c", "iPhone4", "iPadFourthGen", "iPhone5", "iPad2Wifi", "iPadThirdGen4G", "iPadThirdGen", "iPodTouchFifthGen", "iPadMini", "iPhone5s", "iPad23G", "iPodTouchourthGen", "iPadMini4G"], "artworkUrl100": "http://a43.phobos.apple.com/us/r30/Purple6/v4/ce/bc/78/cebc78cf-72cf-bbf9-d3b2-31c816497897/mzl.ixkmbuph.png", "bundleId": "com.chattyhome.iMtG", "trackViewUrl": "https://itunes.apple.com/us/app/imtg/id412798013?mt=8&uo=4", "minimumOsVersion": "6.1", "artworkUrl60": "http://a409.phobos.apple.com/us/r30/Purple4/v4/61/79/46/6179462d-eedf-df32-4c9f-e2af03be757b/AppIcon57x57.png", "averageUserRating": 4.5}