{"contentAdvisoryRating": "4+", "features": ["gameCenter", "iosUniversal"], "languageCodesISO2A": ["EN", "PT", "ES"], "ipadScreenshotUrls": ["http://a1.mzstatic.com/us/r30/Purple3/v4/6d/66/6f/6d666f52-e0c2-30ab-02b1-f9cade7f65a7/screen480x480.jpeg", "http://a1.mzstatic.com/us/r30/Purple4/v4/1b/93/d0/1b93d01b-3175-6fce-11bd-83496f737e72/screen480x480.jpeg", "http://a5.mzstatic.com/us/r30/Purple3/v4/a4/4c/b0/a44cb085-0fab-e8a6-0a6c-1e51af177c49/screen480x480.jpeg", "http://a1.mzstatic.com/us/r30/Purple4/v4/9f/d2/d7/9fd2d75e-89c8-e796-5b3c-caf798474ef8/screen480x480.jpeg"], "releaseDate": "2011-03-11T13:37:15Z", "currency": "USD", "artistId": 417348704, "userRatingCountForCurrentVersion": 28, "wrapperType": "software", "advisories": [], "genres": ["Health & Fitness", "Lifestyle"], "trackId": 417348701, "description": "Featured on CBS, “The Doctors” talk show as the best fitness tracker for weight loss\n\nCompete with friends & coworkers, earn rewards, get support, lose weight, and track your progress on the largest fitness mobile interactive game of its kind. \n\nWe are a proud TechStars 2013 company! \n\nHere is what the press says:\n\nShape Magazine:    One of “9 Ways to Use Your Smartphone to Stay Motivated”\nMashable:    A “Top Health and Fitness App”\nJetSet Magazine:    A “Workout Gadget to Whip You Back Into Shape”\nHuffington Post:    “A true Fitness App For Lazy People”\nWashingtonian:    “The Next Generation of Exercise”\nReuters:    “Need motivation to hit the gym? Perhaps some free merchandise will work”\n\nThe list goes on…. See what the rave is all about. \n\nHere's what people are saying (5 star reviews): \n\n“Best app ever.  This is one of the best motivation apps to date. I am constantly trying to get more xp then my friends and I got to say, It's fun! Since I have been using this app I have lost a total of 24+ pounds and only need to lose about 20 more pounds! If you are having trouble losing weight than this app is great for you!”\n\n“I lost 35 pounds in the past 11 months and this app kept me motivated to keep going!! What are you waiting for... Trim that butt and that belly and go tell a friend!”\n\n\"I lost my fitbit, which was connected to LoseIt... Then I found this app, which keeps me motivated and requires less logging!\"\n\n“I was looking for an app to help motivate me in my fitness goals, and this is perfect. Everyone is so encouraging and within a short time I had new friends motivating me and encouraging me to be fit! It's this type of support that I needed. Now I'm looking forward to 'compete' and push myself to reach my goals.”\n\n“Internal motivation wasn't working for me… This time last year, I was happy to get two workouts in a week… Now, I can't imagine going a day without exercise… This app works for me. I hadn't been able to make the lifestyle changes I needed to make without it!”\n\n\"I have never worked out before downloading this app, it makes working out fun and makes me want to do it everyday. This app has been amazing to my physical and mental attributes, my friends have made remarks noticing the difference and I tell them it's all because of this app!\" \n\n“I NEVER have bothered writing a review before- but this app is worth it. It is fun, motivating, and challenges you to move up levels... Psyched! Lost 3.8 pounds in a week with the help of this app! Awesome!”\n\n\"After trying many devices (some medical grade ;) that cost an arm and a leg this application works seamlessly with no actual money invested! Five stars!!!\" \n\n\"I read about this app in Shape magazine and decided to try first during a a workout at the gym. Before I knew it I was Nexercising daily (not just at the gym) when walking, cycling on my bike route to work, and even while doing housework. Who wouldn't love a simple way to journal activity and win stuff!??\"\n\n\"Whether you are strength training, doing intensive cardio, or just taking a simple walk - this app turns routine ho-hum into play. Plus the community provides better motivation than apps with detailed nutrition support or calorie burning information!\"\n\n\"I stumbled across this mPoint app while searching for star diets in the livestrong MyPlate app. I love being able to earn rewards for exercising by going for a run with my trainer. I combine this with RunKeeper and it's goal setting while prepping for my race - it's like a fitness buddy who hands out prizes ( Kiip and mPoints :) !\"\n\nWith almost 200 activities, Nexercise is the perfect community based motivational coach and training tool for any diet or weight loss program. \n\nRequired Disclaimers: \n- Continued use of GPS running in the background can dramatically decrease battery life. Challenges by Nexercise uses GPS in the background only during exercise to validate activity and record routes. \n- Apple is not a sponsor any promotion", "artistName": "Nexercise", "artworkUrl512": "http://a1349.phobos.apple.com/us/r30/Purple5/v4/a0/4e/99/a04e99d5-0c16-e0ba-cca0-9edce805ca9c/mzl.kingizen.png", "version": "2.5.3", "primaryGenreId": 6013, "primaryGenreName": "Health & Fitness", "fileSizeBytes": "13640055", "price": 0.0, "isGameCenterEnabled": true, "trackCensoredName": "Challenges by Nexercise - health & fitness tracker for motivation to lose weight", "genreIds": ["6013", "6012"], "trackName": "Challenges by Nexercise - health & fitness tracker for motivation to lose weight", "releaseNotes": "We changed our product name! Nexercise is a brand that builds mobile apps to help people live healthier. This was our first product. \n\nAfter studying the people who have been the most successful with our product, we found that those were the ones who \"Challenged\" themselves with other individuals like their friends, even their coworkers, and some who just challenged themselves to log something no matter how small every day. \n\nWith that we decided to rename our first product \"Challenges by Nexercise\".\n\nWe encourage you to raise your bar and challenge yourself to be the best you can be.\n\nPlus we fixed some bugs!\n\nBest,\nBenjamin Young\nCEO of Nexercise", "sellerUrl": "http://www.nexercise.com", "screenshotUrls": ["http://a3.mzstatic.com/us/r30/Purple5/v4/16/a8/c6/16a8c622-3c27-c9b6-f0ea-b23266f26c97/screen1136x1136.jpeg", "http://a4.mzstatic.com/us/r30/Purple4/v4/e5/13/90/e51390ac-905e-6030-50ed-82b7de619253/screen1136x1136.jpeg", "http://a5.mzstatic.com/us/r30/Purple5/v4/2a/fe/91/2afe91fe-c9aa-6b1b-99bd-5be9e30fc883/screen1136x1136.jpeg", "http://a3.mzstatic.com/us/r30/Purple5/v4/9d/a1/85/9da185ae-840f-fbe6-ce83-c287103fad5b/screen1136x1136.jpeg", "http://a4.mzstatic.com/us/r30/Purple3/v4/8b/38/6e/8b386e69-a354-d672-cc65-2b1d408bf13c/screen1136x1136.jpeg"], "userRatingCount": 14030, "trackContentRating": "4+", "formattedPrice": "Free", "artistViewUrl": "https://itunes.apple.com/us/artist/nexercise/id417348704?uo=4", "kind": "software", "averageUserRatingForCurrentVersion": 4.5, "sellerName": "Nexercise, Inc.", "supportedDevices": ["iPad23G", "iPadFourthGen4G", "iPadMini", "iPadThirdGen4G", "iPhone5c", "iPadThirdGen", "iPhone4", "iPadMini4G", "iPhone5s", "iPad2Wifi", "iPhone4S", "iPhone5", "iPodTouchFifthGen", "iPadFourthGen"], "artworkUrl100": "http://a1349.phobos.apple.com/us/r30/Purple5/v4/a0/4e/99/a04e99d5-0c16-e0ba-cca0-9edce805ca9c/mzl.kingizen.png", "bundleId": "com.nexercise.client.iOS", "trackViewUrl": "https://itunes.apple.com/us/app/challenges-by-nexercise-health/id417348701?mt=8&uo=4", "minimumOsVersion": "7.1", "artworkUrl60": "http://a30.phobos.apple.com/us/r30/Purple3/v4/b5/f4/6f/b5f46f5c-fc14-1b2f-8187-54b65f82a6ac/AppIcon60x60_U00402x.png", "averageUserRating": 4.5}