{"contentAdvisoryRating": "12+", "features": [], "languageCodesISO2A": ["NB", "DA", "NL", "EN", "DE", "IT", "NN", "PT", "ES"], "ipadScreenshotUrls": [], "releaseDate": "2011-03-08T02:53:57Z", "currency": "USD", "artistId": 418075938, "userRatingCountForCurrentVersion": 9, "wrapperType": "software", "advisories": ["Infrequent/Mild Alcohol, Tobacco, or Drug Use or References", "Infrequent/Mild Profanity or Crude Humor"], "genres": ["Sports", "News"], "trackId": 418075935, "description": "Your Team's News First! \n\nGet all your team's news and scores from across the web in one easy place with personalized streams that sends alerts as soon as stories break. Be the first to know all your team's news!\n\nAllow Push Notifications To Get News Alerts! \n\n • Pick the teams you love and get real-time streams with hand-picked alerts so you know your team's news first. \n\n • Open a stream for scores, stories, videos, and pictures from all the best sources across the web – local papers, national websites, blogs, Twitter, & Bleacher Report\n\n • Break news to your friends with Facebook, Twitter, groups, email, or text message\n\n--\n\nSee what real fans have said in our 5-star app reviews: \n\n • \"This app is great, 9 times out of 10 I get updates from BR before the ESPN app.\"\n\n • “Wow - I'm just blown away by how good this is! The stream is awesome, and the breaking news is dead on. So much better than trying to follow multiple teams on ESPN. NICE JOB FELLAS!” \n\n • “SIMPLY THE BEST!!!!! - As soon as I got the app and added my local team, I got breaking news from my team before they broke the news on a local sports talk radio that I listen at work every day. From that moment I fell in love with the app!!! Awesome app, I recommend it to every sports fan!!!!!” \n\n • “Great app - Instead of having to go to multiple sites, I get a quick fix on my favorite teams with just this one.” \n\n • Awesome! - Best sports app there is! I love the team feature. I used to watch espn daily but now with this app I haven't watched in over two weeks. All the news is fast and to the minute. Bye-bye espn.\n\n • “Perfect - Get all your local teams big news in your notification center. How awesome!!!!!” \n\n • “Great App!! - This app is very useful for breaking news and interesting tidbits from my teams. Being separated from home sports city makes it tough to get a ton of info on just a couple teams I want to follow, better than twitter only sports related updates.”\n\n--\nFeedback? Email teamstream@bleacherreport.com\n\nTerms of Use: http://bleacherreport.com/pages/terms\n\nPrivacy Policy: http://bleacherreport.com/pages/privacy", "artistName": "Bleacher Report", "artworkUrl512": "http://a407.phobos.apple.com/us/r30/Purple5/v4/79/f8/53/79f85312-7f13-e7ee-773e-55304e05c95f/mzl.vnquztzd.png", "version": "4.1.1", "primaryGenreId": 6004, "primaryGenreName": "Sports", "fileSizeBytes": "24144372", "price": 0.0, "isGameCenterEnabled": false, "trackCensoredName": "Team Stream", "genreIds": ["6004", "6009"], "trackName": "Team Stream", "releaseNotes": "Version 4.1-4.1.1\n• Alternate Uni's for the Homescreen! Thanks to your feedback, simplified the homescreen look and added shortcuts to your teams\n• Caught more bugs #thingsodellcancatch\n\nWe're continuing to work on the homescreen thanks to your feedback and still have plenty more coming, so thank you for your patience at the plate/in the pocket!\n\n--\n\nVersion 4.0-4.0.3\n• Homescreen Redux! Home[screen] is where the heart is. Scroll through the latest stories across sports and from your teams. Jump into a stream or open My Teams. No matter how much you love change, try it out for a week before you tell us how much you love the ch-ch-ch-changes. \n• Fantasy Football Live Play-by-Play and My Box Score! Add your fantasy players to My Fantasy Stream to get all their news, plus live plays and a box score for just your players. Warning: Avoiding the Sacko Bowl not guaranteed \n• NFL and College Football Live Play-by-Play! Open your team's stream during games to see live play-by-play. You'll want to dunk on the FG posts after every scoring play (then open your checkbook). \n• Put even more bugs on IR – Designated Never to Return list for iOS 8, including faster scrolling and crash [not Davis] bugs for some users\n\nVersion 3.4.4 \n• New(new) streams: Trending, Sports Lists, Video Games, Uni Watch, Longform. Swagger fans, you'll now find all the great stories you love in Sports Lists and Trending \n• College Football and Premier League updates \n• Share stories more easily via Facebook, Facebook Messenger, or WhatsApp (Coming soon! Yo) \n• Saved almost as many bugs as Timmy #ThingsTimHowardCouldSave \n\nVersion 3.4.1-3.4.2 \n• World Cup stream will make you feel so close to Brazil you can practically hear the caxirolas (vuvuzelas are so 2010) \n• Follow your favorite footballers at the World Cup and add them to My Soccer Players (EDIT > ADD TEAMS > Soccer Players) \n• Improved soccer scoreboard experience provides all the detail you could want on every match from the tournament (Match fixing not included) \n• New standings and schedule data for more streams \n• Cut remaining bugs to reach 23-man roster \n\nVersion 3.4 \n• Add MLB and Soccer players to follow them on the field, off the field, at the club, etc. \n• Live NBA play-by-play in stream. Catch every Hibbert comeback player of the year score \n• Instagram posts in streams for your #TBT fix (Coming soon! Food pic filter) \n• Sharing is caring – updated sharing, including WhatsApp (Groups are retiring) \n• Cut more bugs from the team \n\nVersion 3.3 \n• Cut down the nets! Follow March Madness with play-by-play for college basketball (bracket tearing insurance not included) \n• Spot a 12-5 upset in progress! Find scores for your teams and top games on your homescreen \n• 'NSYNC! Sign in to sync your teams with your B/R account (iPad & Android coming soon) \n• Added streams for NASCAR & F1 drivers, NBA Rumors, MLB Prospects/Rumors, College Basketball Recruiting, and more \n• Tore up some buggy brackets \n\nVersion 3.2 -3.2.1 \n• Follow Sochi by adding Olympic News or My Olympics events (Olympics > Winter Olympics) from Curling to Gnar Shredding \n• Search for any stream from the homescreen (just pull down). \n• Recent scores in the stream \n• Alternate jerseys (sliiightly updated look) \n• Cut more bugs from the team for not plugging in their guitars during the halftime show", "sellerUrl": "http://bleacherreport.com/mobile", "screenshotUrls": ["http://a5.mzstatic.com/us/r30/Purple1/v4/a4/d6/72/a4d6729c-d0c0-c93f-1773-7e373849a202/screen1136x1136.jpeg", "http://a1.mzstatic.com/us/r30/Purple5/v4/ab/d2/b6/abd2b627-8608-1a1a-0a14-079cade96b75/screen1136x1136.jpeg", "http://a4.mzstatic.com/us/r30/Purple1/v4/88/22/70/882270f6-4f21-6d91-4151-1648a2b78def/screen1136x1136.jpeg", "http://a1.mzstatic.com/us/r30/Purple3/v4/d9/7a/69/d97a6902-b38e-2222-6a22-f33941ae8ace/screen1136x1136.jpeg", "http://a3.mzstatic.com/us/r30/Purple3/v4/6a/b7/cf/6ab7cf07-eec8-f341-168e-3bcb6c8e47c4/screen1136x1136.jpeg"], "userRatingCount": 14590, "trackContentRating": "12+", "formattedPrice": "Free", "artistViewUrl": "https://itunes.apple.com/us/artist/bleacher-report/id418075938?uo=4", "kind": "software", "averageUserRatingForCurrentVersion": 4.5, "sellerName": "Bleacher Report", "supportedDevices": ["iPadFourthGen4G", "iPhone4S", "iPodTouchFifthGen", "iPhone5c", "iPhone5s", "iPad23G", "iPadMini4G", "iPadThirdGen4G", "iPadMini", "iPadFourthGen", "iPadThirdGen", "iPhone4", "iPad2Wifi", "iPhone5"], "artworkUrl100": "http://a407.phobos.apple.com/us/r30/Purple5/v4/79/f8/53/79f85312-7f13-e7ee-773e-55304e05c95f/mzl.vnquztzd.png", "bundleId": "com.bleacherreport.TeamStream", "trackViewUrl": "https://itunes.apple.com/us/app/team-stream/id418075935?mt=8&uo=4", "minimumOsVersion": "7.0", "artworkUrl60": "http://a1342.phobos.apple.com/us/r30/Purple3/v4/fa/16/d8/fa16d817-b0ab-5278-a5ae-694f8370c1a7/Icon-57.png", "averageUserRating": 4.5}