{"contentAdvisoryRating": "17+", "features": [], "languageCodesISO2A": ["EN", "FR", "DE", "JA", "KO", "RU", "ZH", "ES"], "ipadScreenshotUrls": ["http://a3.mzstatic.com/us/r30/Purple3/v4/c9/ac/27/c9ac27a5-f95c-6a53-c1f8-ef35b54adf17/screen480x480.jpeg", "http://a4.mzstatic.com/us/r30/Purple1/v4/05/70/12/057012b8-a055-3f13-1cd7-8146bc96b8ca/screen480x480.jpeg", "http://a5.mzstatic.com/us/r30/Purple3/v4/6d/5f/58/6d5f5844-41f6-0422-5ed9-716a0e052ee6/screen480x480.jpeg", "http://a1.mzstatic.com/us/r30/Purple1/v4/e9/d4/78/e9d4783b-8666-67ad-2909-90e48eb4c75f/screen480x480.jpeg", "http://a2.mzstatic.com/us/r30/Purple3/v4/06/8c/84/068c8410-da15-b4ba-2b63-95d2ef648085/screen480x480.jpeg"], "releaseDate": "2011-05-30T21:06:39Z", "currency": "USD", "artistId": 418861665, "wrapperType": "software", "advisories": ["Unrestricted Web Access"], "genres": ["Productivity", "Business"], "trackId": 418861662, "description": "You can now design for the new iPhone 6 and iPhone 6 Plus!\n\nThe #1 iOS Prototyping App on iPad — \"A hot new iPad app that makes sure other apps have the right ingredients in place before any development begins\" — Mashable\n\nMockup + wireframe iPhone & iPad Apps. Share clickable prototypes through AppTaster, the free companion.\n\n- Full-functioned mockup editor with all the iOS 7 UI widgets \n- Overall screen view with connections, export PDF Map.\n- Portrait & landscape editions\n- Add notes to any of the screens.\n- Link the screens with various type of inputs and transitions\n- Bitmap drawing, vector shapes and text tool \n- Use solid colours, gradients, strokes and shadows \n- Import images through Dropbox and Box \n- Export backups, playable mockups (AppTaster), Jpeg, PNG and PDF \n- Dropbox + Box integration\n- App icon editor\n- App idea planner \n- Store info section \n- App pricing tool\n- Notepad\n\n- THE (TRUE) STORY OF APPCOOKER -\nAt the crossroads between creation and technology, AppCooker makes a synthesis between those two worlds often kept apart, thus delivering a complete, mobile and accessible solution. The goal: to be able to test an idea for a mobile application in all of its aspects — concept, graphic design, interactive mockup, business plan —, quickly and without coding. AppCooker celebrated its first anniversary on May 31, 2012. \n\n- An app born out of a void - \nA few years ago, the founders of AppCooker decided to create an iPhone game. The graphic designer made graphic mockups, which the software developer translated to code. However, very soon they were confronted with what was coming next: marketing their app meant a heap of tasks to fulfill, which they weren’t prepared for. They started looking for a dedicated solution to their issues. Finding none, they decided to create it themselves... \n\n- A bet on the future - \nAppCooker was born from the idea that single task oriented software — i.e. word-processing, spreadsheet or design programs — is bound to step aside in favor of multitask programs, more efficient and better adapted to the objectives of specialized users, whose projects are binding in terms of time, money, marketing strategies. \n\n- The user at the heart - \nWhile gathering all the actions necessary to conceive mobile apps in one single place, the designers kept in mind every experience they’d had as users, in order to correct them. Everything they hadn’t been able to do whilst passing from one program to another would be possible, all the wasted time would be spared! Today, the users — who amount up to thousands — are still those who contribute to improving AppCooker through its updates, thanks to their suggestions and constructive feedback. \n\n- Impressive results without coding - \nAppCooker’s mockup editor gathers all major graphic design tools: vector shapes, text, bitmap drawing, icon library, images, and all of the UI elements for iPhone and iPad (bars, buttons, objects, etc.). Screens can be linked together with the usual mobile apps linking tools. All of these features allow professionals as well as eager amateurs to end up with an interactive mockup that is visually very close to the final application, in little time and without having to type a single line of code. \n\n- Luxury lies in anticipation - \nWhile the mockup editor is AppCooker’s star, the other fields aiming at refining the original idea, the icon, the business plan and the presence on the App store are not anecdotal. They are easier to use than mainstream programs (i.e. Word or Excel) because they are made especially for the creation of mobile applications: they integrate all of its peculiar constraints. The objective being that, with a global vision of the project, the user has the means never to be taken by surprise.", "artistName": "Hot Apps Factory", "artworkUrl512": "http://a798.phobos.apple.com/us/r30/Purple5/v4/7c/f8/28/7cf8280b-09c9-f18e-25a2-bd7c46cfad53/mzl.peuzbwib.png", "version": "3.0", "primaryGenreId": 6007, "primaryGenreName": "Productivity", "fileSizeBytes": "41972804", "price": 19.99, "isGameCenterEnabled": false, "trackCensoredName": "AppCooker - Mockup and Prototype Apps like a Chef!", "genreIds": ["6007", "6000"], "trackName": "AppCooker - Mockup and Prototype Apps like a Chef!", "releaseNotes": "This version lets you to design for iPhone 6 and 6 Plus.\nYou can also use the iOS8 document picker to import and export projects and images. So you can now use any of your third parties cloud (iCloud, Google Drive, Dropbox, etc...).\n\nBugs fixes\nPerformances improvements", "sellerUrl": "http://www.appcooker.com", "screenshotUrls": [], "userRatingCount": 498, "trackContentRating": "17+", "formattedPrice": "$19.99", "artistViewUrl": "https://itunes.apple.com/us/artist/hot-apps-factory/id418861665?uo=4", "kind": "software", "sellerName": "Hot Apps Factory SARL", "supportedDevices": ["iPad2Wifi", "iPad23G", "iPadThirdGen4G", "iPadMini4G", "iPadMini", "iPadThirdGen", "iPadFourthGen", "iPadFourthGen4G"], "artworkUrl100": "http://a798.phobos.apple.com/us/r30/Purple5/v4/7c/f8/28/7cf8280b-09c9-f18e-25a2-bd7c46cfad53/mzl.peuzbwib.png", "bundleId": "com.appcooker.appcooker", "trackViewUrl": "https://itunes.apple.com/us/app/appcooker-mockup-prototype/id418861662?mt=8&uo=4", "minimumOsVersion": "7.0", "artworkUrl60": "http://a1296.phobos.apple.com/us/r30/Purple3/v4/c4/19/8a/c4198ac5-3f22-68b4-8acb-5ff81ba80802/AppIcon76x76_U007eipad.png", "averageUserRating": 4.5}