{"contentAdvisoryRating": "4+", "features": [], "languageCodesISO2A": ["NB", "CA", "HR", "CS", "DA", "NL", "EN", "FI", "FR", "DE", "EL", "HU", "ID", "IT", "JA", "KO", "MS", "PL", "PT", "RO", "RU", "ZH", "SK", "ES", "SV", "TH", "ZH", "TR", "UK", "VI"], "ipadScreenshotUrls": [], "releaseDate": "2011-03-01T08:00:00Z", "currency": "USD", "artistId": 322561665, "wrapperType": "software", "advisories": [], "genres": ["Navigation", "Health & Fitness"], "trackId": 419269554, "description": "Backpacker GPS Trails Lite doubles as a portable trip database and personal navigation device for your outdoor lifestyle: hiking, backpacking, camping, mountaineering, or for just basic trail navigation. GPS Trails Lite works in remote places like national parks, wilderness areas, and backcountry spots without relying on data & cell signals.\n\nPlease Note: Continued use of GPS running in the background can dramatically decrease battery life.\n\n-----\nUPGRADE TO PRO\nTry the free app then upgrade to GPS Trails Pro for even more features, including:\n\n* Create map packs to store maps on your phone. This app allows you to save topos (MyTopo), aerials (Bing), streets (OSM), and terrain (OCM) map types.\n* Get worldwide aerial images on your iPhone. Our app gives you rare access to view and store offine aerial imagery from Bing maps. \n* Shoot video and geotag it to an exact location on a map. Save videos to YouTube account.\n* Convert lat/long coordinates to UTM and NAD 27 map datum to sync with paper maps for advanced navigation in the field.\n* No ads. Say goodbye to advertisements that occupy valuable screen space for navigating.\n\n--------\nWith GPS Trails Lite, you can:\n\nTurn your phone into a GPS: Navigate via precise satellite signals in and out of cell network.\n\nCapture waypoints: Mark campsites, trailheads, water sources, and more.\n\nTrack every step: Record or follow your tracks and routes. See compass essentials.\n\nShare your trip: Post adventures to trimbleoutdoors.com and Facebook.\n\nView maps: See street maps, aerial photos, hybrid street/aerial maps, and topo maps provided by MyTopo. Please note: Upgrade to GPS Trails Pro to store offline maps on your iPhone.\n\nView stats: See 10 stats, including elevation, speed, and distance.\n\nDownload Pro Trips: Follow our step-by-step trail guides of popular trails and lesser-known routes in national parks, national forests, and local parks, including Yellowstone, Yosemite, Grand Canyon, Great Smoky Mountains, Glacier, Rocky Mountain, White Mountains, Adirondacks, Catskills, Zion, Arches, Canyonlands, Acadia, Mount Rainier, Everglades, Olympic, and more. Find hikes near major cities: New York City, Seattle, Portland, LA, Denver, Chicago, Boston, Atlanta, and more.  Plus find section hikes on the Appalachian Trail, Pacific Crest Trail, and the Continental Divide Trail.   \n\nSearch trips: Find thousands of trips shared by the Backpacker editors and trimbleoutdoors.com community.\n\nPlan trips: Draw routes, mark points, print maps, and import GPS files with the web-based Trip Planner at trimbleoutdoors.com (membership required). All the trips you plan at trimbleoutdoors.com can be accessed in the GPS Trails app.\n\nGet published: Every month the editors at Backpacker handpick adventures shared by its online community to be published in the magazine. \n\nMORE INFO\nNote: Backpacker GPS Trails is designed and optimized for the iPhone 4S, 4, 3GS and 3G. The 1st generation models lack a GPS chip required to run the application. It also does not work on the iPod touch and the design isn’t optimized for the iPad. \n\nFollow Us: We’ve created a Facebook page for our mobile apps. Your feedback helps us create a better app. Go to: facebook.com/backpackergpstrails.\n\nBackpacker brings the outdoors straight to the reader's doorstep, inspiring and enabling them to go more places and enjoy nature more often. The authority on active adventure, Backpacker is the world's first GPS-enabled™ magazine and website, and the only outdoor media whose editors and network of map contributors personally map the hiking trails they publish.", "artistName": "Trimble Navigation Limited", "artworkUrl512": "http://a1926.phobos.apple.com/us/r30/Purple3/v4/a8/7a/b9/a87ab912-f2dd-5bf5-bc44-6b2b9652c1e5/mzl.klyzdttm.png", "version": "5.6.9", "primaryGenreId": 6010, "primaryGenreName": "Navigation", "fileSizeBytes": "26175041", "price": 0.0, "isGameCenterEnabled": false, "trackCensoredName": "BACKPACKER GPS Trails Lite", "genreIds": ["6010", "6013"], "trackName": "BACKPACKER GPS Trails Lite", "releaseNotes": "• USNG support added\n• Charts screen added to Stats screen.\n• Ability to delete Mega Offline Maps within the app.\n• Offline Maps added to the Jump menu for fast switching.\n• Fixed a crash that was causing iOS 5 to crash when entering to any screen.\n• Fixed an issue that was preventing Private Lands not to show up for some counties.\n• Fixed an issue that was preventing pro trips to download correctly.\n• Fix an issue that was causing total distance to not update when downloading new tracks from the website.", "sellerUrl": "http://backpacker.com/iphone/", "screenshotUrls": ["http://a4.mzstatic.com/us/r30/Purple/v4/16/93/17/16931771-a742-9ab0-02cc-6f640228dc73/screen1136x1136.jpeg", "http://a5.mzstatic.com/us/r30/Purple/v4/ed/a7/35/eda735a8-98b2-d19e-3a36-86b7aaea8ec2/screen1136x1136.jpeg", "http://a1.mzstatic.com/us/r30/Purple/v4/66/1e/0c/661e0c70-c50d-1d95-4696-db667c3aa348/screen1136x1136.jpeg", "http://a5.mzstatic.com/us/r30/Purple/v4/df/08/4c/df084c0c-08f3-e6b4-be24-53008692fba0/screen1136x1136.jpeg", "http://a2.mzstatic.com/us/r30/Purple/v4/d2/07/2e/d2072e72-763b-eebd-f53f-55f09114a5a9/screen1136x1136.jpeg"], "userRatingCount": 216, "trackContentRating": "4+", "formattedPrice": "Free", "artistViewUrl": "https://itunes.apple.com/us/artist/trimble-navigation-limited/id322561665?uo=4", "kind": "software", "sellerName": "Trimble Navigation Limited", "supportedDevices": ["iPadThirdGen", "iPhone5s", "iPodTouchFifthGen", "iPad2Wifi", "iPodTouchourthGen", "iPad23G", "iPadMini4G", "iPadFourthGen", "iPhone5", "iPhone-3GS", "iPadWifi", "iPadFourthGen4G", "iPhone4", "iPadThirdGen4G", "iPad3G", "iPhone5c", "iPodTouchThirdGen", "iPadMini", "iPhone4S"], "artworkUrl100": "http://a1926.phobos.apple.com/us/r30/Purple3/v4/a8/7a/b9/a87ab912-f2dd-5bf5-bc44-6b2b9652c1e5/mzl.klyzdttm.png", "bundleId": "com.TrimbleOutdoors.GPSTrailsLE", "trackViewUrl": "https://itunes.apple.com/us/app/backpacker-gps-trails-lite/id419269554?mt=8&uo=4", "minimumOsVersion": "5.0", "artworkUrl60": "http://a541.phobos.apple.com/us/r30/Purple3/v4/ab/13/8f/ab138f9f-4092-2479-37e7-9ef75e6651c0/Icon.png", "averageUserRating": 3.0}