{"contentAdvisoryRating": "4+", "features": [], "languageCodesISO2A": ["EN"], "ipadScreenshotUrls": ["http://a1.mzstatic.com/us/r30/Purple/v4/62/e4/c1/62e4c187-755d-f440-b9f1-80bcb5c6e7dd/screen480x480.jpeg", "http://a5.mzstatic.com/us/r30/Purple/v4/74/c8/62/74c862e1-7b4b-9dbe-da9d-51349d248153/screen480x480.jpeg", "http://a3.mzstatic.com/us/r30/Purple/v4/54/6c/78/546c7895-8790-2269-f31d-93108784b769/screen480x480.jpeg", "http://a1.mzstatic.com/us/r30/Purple/v4/1f/a8/6d/1fa86def-1920-5806-7922-3dd494a7f816/screen480x480.jpeg", "http://a3.mzstatic.com/us/r30/Purple/v4/97/39/7f/97397f69-b460-2b1d-286c-3b44836d32ef/screen480x480.jpeg"], "releaseDate": "2011-03-11T19:14:25Z", "currency": "USD", "artistId": 393955899, "userRatingCountForCurrentVersion": 4, "wrapperType": "software", "advisories": [], "genres": ["Food & Drink", "Lifestyle"], "trackId": 424086704, "description": "From the people who have delivered premium steaks, red meats and other gourmet foods to your doorstep for nearly a century, now comes Steak Time HD, an iPad application born and bred to make mouths water.\n\nChock full of more than 100 tempting recipes, Steak Time HD is bursting with meal ideas, tips, tools and facts galore that are sure to make any seasoned steak chef swoon. This application is built for steak lovers, by steak lovers, to bring all the best resources into one streamlined and intuitive tool. Can you hear the sizzle?\n\nBROWSE the seemingly endless selection of bold, flavorful recipes complete with color photos and carefully composed directions. You’ll love the interactive homepage that leads you through your search for the perfect meal. Check boxes and a line guide help make reading recipes easier than ever.\n\nSEARCH recipes by category, ingredient or title. Additional filtering includes prep times, total times and most popular recipes.\n\nADD recipes to your favorites list so you can find your top go-to meals in seconds.\n\nTAKE NOTES on your recipes and attach them to the recipes via email.\n\nTIME your meals perfectly with the convenient steak grilling timer. This tool ensures all your steaks will come off the grill at precisely the same time, regardless of your guests’ doneness preferences or steak cuts. Plus, you can set timers directly from a recipe and view your active times from anywhere in the app.\n\nWATCH helpful how-to videos ranging in subjects from “The Perfect Grill Marks” to “Steak Prep” and share your favorites through Facebook, Twitter or email.\n\nSHOP for Omaha Steaks products through direct links from recipes and grocery lists, and search the online store via the in-app browser.\n\nCREATE grocery lists automatically for all recipes. You just add recipes to your list and bring it with you to the store when you shop. You can even check off ingredients as you go, email the lists to yourself or your friends, and sort ingredients by Omaha Steaks products and grocery categories.\n\nLEARN anything and everything about steak in the Steak 101 section, which includes cooking charts, steak facts and health information.\n\nCONNECT directly to Omaha Steaks with your questions, comments and personal posts via email, Twitter and Facebook.\n\nPLAY an engaging game of Conversation Cards with your family and friends as you enjoy your meal. You can even bring the conversation to your social network through Facebook, Twitter and email.\n\n\n\nProduced by rabble+rouser, inc.", "artistName": "Omaha Steaks International, Inc.", "artworkUrl512": "http://a618.phobos.apple.com/us/r30/Purple/v4/a3/17/3b/a3173b47-e046-151d-89ba-c00500bdd8c5/mzl.dkkkpbcm.png", "version": "2.1.0", "primaryGenreId": 6023, "primaryGenreName": "Food & Drink", "fileSizeBytes": "35821345", "price": 0.0, "isGameCenterEnabled": false, "trackCensoredName": "Omaha Steaks Steak Time HD", "genreIds": ["6023", "6012"], "trackName": "Omaha Steaks Steak Time HD", "releaseNotes": "- Over 150 new recipes, including seafood, poultry, and dessert \n- Optimized Steak Time for iOS 7", "sellerUrl": "http://www.omahasteaks.com", "screenshotUrls": [], "userRatingCount": 140, "trackContentRating": "4+", "formattedPrice": "Free", "artistViewUrl": "https://itunes.apple.com/us/artist/omaha-steaks-international/id393955899?uo=4", "kind": "software", "averageUserRatingForCurrentVersion": 5.0, "sellerName": "Omaha Steaks International, Inc", "supportedDevices": ["iPadThirdGen", "iPadMini4G", "iPadFourthGen", "iPadMini", "iPad23G", "iPadThirdGen4G", "iPad2Wifi", "iPadFourthGen4G"], "artworkUrl100": "http://a618.phobos.apple.com/us/r30/Purple/v4/a3/17/3b/a3173b47-e046-151d-89ba-c00500bdd8c5/mzl.dkkkpbcm.png", "bundleId": "com.omahasteaks.steaktime-ipad", "trackViewUrl": "https://itunes.apple.com/us/app/omaha-steaks-steak-time-hd/id424086704?mt=8&uo=4", "minimumOsVersion": "6.0", "artworkUrl60": "http://a635.phobos.apple.com/us/r30/Purple/v4/80/b1/fa/80b1fa68-617b-d820-410d-a9fb228b44b2/icon.png", "averageUserRating": 3.5}