{"contentAdvisoryRating": "4+", "features": [], "languageCodesISO2A": ["EN", "FI", "FR", "DE", "ES"], "ipadScreenshotUrls": [], "releaseDate": "2011-06-08T14:54:32Z", "currency": "USD", "artistId": 426684876, "userRatingCountForCurrentVersion": 11, "wrapperType": "software", "advisories": [], "genres": ["Health & Fitness", "Sports"], "trackId": 426684873, "description": "Turn your iPhone into a professional sports computer with Sports Tracker!\n\nTrack and analyze your performance, share workout data and photos with your friends, and most important of all – get fit and stay healthier! Wherever you move, Sports Tracker measures the route, speed and heart rate information and follows your progress.\n\nTop 5 health and fitness app in 25 countries with millions of downloads and users from more than 200 countries. Sports Tracker is the social sports tracking application and service that started it all. Try our great free features or go for more with a Premium subscription that helps you stay motivated and active.\n\n\nFEATURES\n\nSports Tracker for iPhone comes with powerful social features in addition to the award-winning tracking capabilities, making it the most feature-packed and professional sports tracker app for the iPhone:\n\n• Track and analyze your workouts, monitor your progress\n\n• Keep track of everything from calories burned to average speed and altitude\n\n• Dedicated Indoor mode with Heart Rate features\n\n• Use Heart Rate data and Zone alarms for better training results (HR Monitor required - available separately from shop.sports-tracker.com)\n\n• Store all training data in your workout diary and back it up to the Sports Tracker online service\n\n• Browse your friends' profiles and comment their workouts and photos\n\n• You can choose to share workout data and photos on Sports Tracker, Facebook and Twitter, or keep your workouts private and only visible for your own viewing\n\n• Explore the globe to discover new routes, trails and adventures worldwide\n\n• Fully translated versions in Spanish, French, German and Finnish\n\nOnce you have registered as a Sports Tracker user, your training data will always remain safe. When you change your phone, or your phone is restored, your training history will transfer automatically to the new phone.\n\nWith the full-featured online service at www.sports-tracker.com Sports Tracker is the most powerful social sports tracking solution available for the iPhone.\n\nJoin the growing global Sports Tracker community and have fun getting fit!\n\n\nSPORTS TRACKER PREMIUM\n\nGet Premium in the app and use the same subscription on any compatible phone or tablet! \n\nAs a Sports Tracker Premium user:\n\n• You can track progress by setting weekly, monthly and yearly goals. Count your weekly calories, measure the total duration of outdoor activities each month, or cycle 1,000 miles this season – the goal statistics view makes it easy to see the big picture or drill in to the details.\n\n• More maps! Enjoy detailed foot and bike paths with four new maps: OpenStreetMap standard, landscape, outdoors and cycling (OpenCycleMap).\n\n• Set a Ghost Target to boost your motivation. Race against any targeted workout you aim to overcome and receive constant voice feedback based on your real-time performance. \n\n• With Custom Ghost Target you can plan your exercises in your own way. Select a route and set the type of target you want to focus your training on, choose from distance, duration, energy or pace. \n\n• Bored of the same routine? Visiting a new town? Shake up your training with your friends’ top picks or get out there and discover new local tracks.\n\n• Ahead-Behind Graph is a great tool for evaluating how you performed against your target. It gives you an easy understanding and a wide comparison between your workouts, shown in a graph. \n\n• Customizable Voice Feedback makes it possible to choose for each activity the kind of information you want to hear in your audio feedback (distance, energy, pace, heart rate, etc.) and how often to receive it.\n\n\nFollow & Like Sports Tracker on:\n\nwww.facebook.com/sportstracking \nwww.twitter.com/sportstracking \nwww.instagram.com/sportstracking\n\nGet the latest news at http://www.sport-tracker.com/blog \n\nFor support & our development community head to http://support.sports-tracker.com", "artistName": "Sports Tracking Technologies Ltd", "artworkUrl512": "http://a45.phobos.apple.com/us/r30/Purple3/v4/f3/be/f1/f3bef136-3117-9015-d107-412732492e69/mzl.jkwdrwyh.png", "version": "3.5.1", "primaryGenreId": 6013, "primaryGenreName": "Health & Fitness", "fileSizeBytes": "35820985", "price": 0.0, "isGameCenterEnabled": false, "trackCensoredName": "Sports Tracker", "genreIds": ["6013", "6004"], "trackName": "Sports Tracker", "releaseNotes": "Maintenance update for release 3.5:\n\nMajor update to both Premium and free users!\n\n• Ghost Target: Race against any workout now with voice feedback! (Premium)\n• Ahead-Behind Graph: See how you performed against target workout (Premium)\n• Custom Ghost Target: Keep up with constant speed target (Premium)\n• Fully customizable audio feedback for each activity (Premium)\n• New improved audio feedback using iOS speech synthesis for all supported languages (Free)\n• Easy audio feedback setting also during tracking (Free)\n• Change auto-lap intervals quickly in the audio feedback settings (Free)\n• Note also: Heart rate alarm moved into the audio feedback settings", "sellerUrl": "http://www.sports-tracker.com", "screenshotUrls": ["http://a2.mzstatic.com/us/r30/Purple4/v4/6c/bd/80/6cbd807c-77b0-41f6-bbbb-7ca939786212/screen1136x1136.jpeg", "http://a5.mzstatic.com/us/r30/Purple4/v4/8c/4d/34/8c4d3455-01e8-74c0-1267-52e67d55ed74/screen1136x1136.jpeg", "http://a5.mzstatic.com/us/r30/Purple/v4/d2/99/54/d2995405-bd75-824a-4b41-68c3bd6cee65/screen1136x1136.jpeg", "http://a5.mzstatic.com/us/r30/Purple4/v4/d8/30/35/d830354e-6277-f270-b0dc-f58b222cba21/screen1136x1136.jpeg", "http://a4.mzstatic.com/us/r30/Purple/v4/d4/55/ff/d455ff4a-df7c-05bc-75df-d81fc1071b54/screen1136x1136.jpeg"], "userRatingCount": 2910, "trackContentRating": "4+", "formattedPrice": "Free", "artistViewUrl": "https://itunes.apple.com/us/artist/sports-tracking-technologies/id426684876?uo=4", "kind": "software", "averageUserRatingForCurrentVersion": 3.5, "sellerName": "Sports Tracking Technologies Oy", "supportedDevices": ["iPad3G", "iPadMini4G", "iPhone-3GS", "iPhone5", "iPadFourthGen4G", "iPadWifi", "iPhone4", "iPodTouchThirdGen", "iPadMini", "iPadThirdGen", "iPhone5s", "iPhone4S", "iPadFourthGen", "iPad2Wifi", "iPad23G", "iPodTouchourthGen", "iPhone5c", "iPadThirdGen4G", "iPodTouchFifthGen"], "artworkUrl100": "http://a45.phobos.apple.com/us/r30/Purple3/v4/f3/be/f1/f3bef136-3117-9015-d107-412732492e69/mzl.jkwdrwyh.png", "bundleId": "com.sports-tracker.iphone", "trackViewUrl": "https://itunes.apple.com/us/app/sports-tracker/id426684873?mt=8&uo=4", "minimumOsVersion": "5.0", "artworkUrl60": "http://a12.phobos.apple.com/us/r30/Purple1/v4/36/26/58/3626586e-255f-4a39-bc01-0f1b3213c728/st-touch-icon-iphone-57.png", "averageUserRating": 4.5}