{"contentAdvisoryRating": "4+", "features": [], "languageCodesISO2A": ["NL", "EN", "FR", "DE", "IT", "JA", "KO", "PT", "RU", "ES", "ZH"], "ipadScreenshotUrls": [], "releaseDate": "2011-03-24T07:00:00Z", "currency": "USD", "artistId": 426826312, "userRatingCountForCurrentVersion": 144, "wrapperType": "software", "advisories": [], "genres": ["Health & Fitness", "Sports"], "trackId": 426826309, "description": "“The World’s Top 10 Most Innovative Companies in Fitness” -Fast Company\nTrack your runs and rides with GPS, join Challenges and see how your running and riding compares with friends.\n\nTRACK YOUR RUNS AND RIDES WITH GPS\n• Follow routes you’ve created or found and view your activity map as you record\n• Get key stats like distance, pace, speed, elevation gained and calories burned\n• Collect heart rate, power and cadence data from ANT+ and Bluetooth LE sensors\n\nCLIMB THE LEADERBOARDS\n• Set personal records and see how you stack up against friends, locals and pros\n• Join monthly Challenges designed to push you further\n\nFOLLOW FRIENDS\n• Find your friends and motivate them with kudos and and comments\n• Share your activities on Facebook and Twitter\n• Share Instagram photos from your activities on your Strava profile\n\nFIND PLACES TO RUN AND RIDE\n• Explore the most popular segments anywhere you go\n\nGO PREMIUM\n• Filtered leaderboards by age and weight to see where you stack up\n• Set weekly mileage or time-based goals and keep track of your daily progress\n• Train more effectively with detailed heart rate analysis and see your Suffer Score\n• Get your performance results immediately after completing a segment\n• See which of your friends are currently out riding or running\n• Stay on top of your game throughout the year with training videos\n• Visualize your training with Power Zone and Pace Distribution analysis\n• Access to exclusive Premium gear, Shop discounts, and extra rewards all year\n• These Premium features are available through in-app purchasing\n\nStrava Premium is available for $5.99/month or $59.99/year.  You can subscribe and pay through your iTunes account.  Your subscription will automatically renew unless cancelled at least 24 hours before the end of the current period.  Auto-renew may be turned off by going to your Account Settings after purchase.\n\nVisit www.strava.com to access even more features.\n\niOS 8 Health Integration: Strava can now sync data with the new iOS 8 Health app as well as other health and fitness apps that are participating. This service is optional.\n\nNote: Recording activities with iPod Touch and iPad version 1 will produce inaccurate location results.  Additional hardware required to collect information from ANT+ sensors.\n\nContinued use of GPS running in the background can dramatically decrease battery life.", "artistName": "Strava, Inc.", "artworkUrl512": "http://a570.phobos.apple.com/us/r30/Purple3/v4/da/29/ac/da29aced-fa4c-13d4-6241-ff062ba59ab3/mzl.unxtlejr.png", "version": "4.2.3", "primaryGenreId": 6013, "primaryGenreName": "Health & Fitness", "fileSizeBytes": "43689277", "price": 0.0, "isGameCenterEnabled": false, "trackCensoredName": "Strava Running and Cycling - GPS Run and Ride Tracker", "genreIds": ["6013", "6004"], "trackName": "Strava Running and Cycling - GPS Run and Ride Tracker", "releaseNotes": "Additional Bug Fixes: We fixed the Facebook login issue, a crash on launch which could happen sometimes for iOS Health app users, as well as a number of minor issues to make the app even better.\n\nAlso in the 4.2 release:\n\nSwipeable Progress Goals: See your day by day progress for past weeks by swiping your Progress Goals on your profile.\n\nWeekly Progress Summary: See your day by day progress for the week in your Feed.\n\nDaily Widget: The Daily Widget, a new feature of the iOS 8 Notification Center, helps you keep track of your daily progress trends for the week. It also makes it easy to start and stop your activity and displays your most important stats while recording.\n\niOS 8 Health Integration: Strava can now sync data with the new iOS 8 Health app as well as other health and fitness apps that are participating. This service is optional.\n\nRedesigned Profile Page: The Profile page is now cleaner and highlights weekly and daily training progress.\n\nAuto-pause: Auto-pause uses GPS and accelerometer data to pause your activity during stops and start it again when you resume.\n\nProgress Goals: Premium members can now set weekly mileage or time-based goals for running and cycling and monitor progress and consistency.", "sellerUrl": "http://www.strava.com/iphone", "screenshotUrls": ["http://a3.mzstatic.com/us/r30/Purple3/v4/43/bf/85/43bf8513-2f3f-56f9-8761-eb7880029235/screen1136x1136.jpeg", "http://a4.mzstatic.com/us/r30/Purple5/v4/00/fd/32/00fd32e8-5a96-921a-b4dc-665e4e4f563e/screen1136x1136.jpeg", "http://a4.mzstatic.com/us/r30/Purple3/v4/22/ca/b1/22cab1bc-1d1a-bd8c-9682-23bcede8fd2b/screen1136x1136.jpeg", "http://a1.mzstatic.com/us/r30/Purple3/v4/d7/a1/b4/d7a1b4ed-9b83-d34b-9263-86ebfffd553b/screen1136x1136.jpeg", "http://a4.mzstatic.com/us/r30/Purple1/v4/00/b3/3b/00b33b65-64dc-b8a0-a68a-eea3f6e46606/screen1136x1136.jpeg"], "userRatingCount": 13643, "trackContentRating": "4+", "formattedPrice": "Free", "artistViewUrl": "https://itunes.apple.com/us/artist/strava-inc./id426826312?uo=4", "kind": "software", "averageUserRatingForCurrentVersion": 4.5, "sellerName": "Strava Inc.", "supportedDevices": ["iPhone5s", "iPhone5c", "iPhone4", "iPadThirdGen", "iPadFourthGen4G", "iPadMini4G", "iPadThirdGen4G", "iPad2Wifi", "iPhone5", "iPadMini", "iPhone4S", "iPadFourthGen", "iPad23G", "iPodTouchFifthGen"], "artworkUrl100": "http://a570.phobos.apple.com/us/r30/Purple3/v4/da/29/ac/da29aced-fa4c-13d4-6241-ff062ba59ab3/mzl.unxtlejr.png", "bundleId": "com.strava.stravaride", "trackViewUrl": "https://itunes.apple.com/us/app/strava-running-cycling-gps/id426826309?mt=8&uo=4", "minimumOsVersion": "7.0", "artworkUrl60": "http://a1665.phobos.apple.com/us/r30/Purple1/v4/97/3f/04/973f04a9-4861-44f2-d8d1-0a592f19e911/AppIcon57x57.png", "averageUserRating": 4.5}