{"contentAdvisoryRating": "4+", "features": [], "languageCodesISO2A": ["EN"], "ipadScreenshotUrls": ["http://a4.mzstatic.com/us/r30/Purple/v4/2f/28/ab/2f28ab8b-9170-4e1c-a517-a814557e76d3/screen480x480.jpeg", "http://a3.mzstatic.com/us/r30/Purple/v4/94/36/bb/9436bb69-29e8-f2a2-c579-149fd9b57769/screen480x480.jpeg", "http://a4.mzstatic.com/us/r30/Purple4/v4/11/9d/6e/119d6eaa-5f65-c8d4-56bc-623380d62e17/screen480x480.jpeg", "http://a4.mzstatic.com/us/r30/Purple/v4/85/e4/90/85e4906b-5ed0-9bea-7a1d-e782a6a0c1a1/screen480x480.jpeg"], "releaseDate": "2011-04-26T04:02:58Z", "currency": "USD", "artistId": 423911974, "userRatingCountForCurrentVersion": 16, "wrapperType": "software", "advisories": [], "genres": ["Photo & Video", "Productivity"], "trackId": 427757668, "description": "Sync photos directly to Lightroom with no monthly cloud costs. Organize your photography collection on the go. View and edit IPTC metadata right on your iPad: Star ratings, keywords, location, copyright, and much more. Export to Flickr, Facebook, Dropbox or Email, with all your metadata embedded.\n\n“Photosmith lets you do a lot of the things [that] I think are the most desirable for Lightroom on the iPad.” — Leo Laporte / iPad Today Episode 148\n\n“Got an iPad? Use Adobe Lightroom to organize and mess with your Photos? Then prepare to get excited.” — Charlie Sorrel / Wired\n\n“Photosmith is a solid app. If you’re in that market, and if you think the iPad fits in [your workflow] ... Photosmith totally rocks.” — Matt Kloskowski / The Grid Episode 64\n\n“Ditching superfluous gear is great. Photosmith will lighten your photographic load, iPad- loading pics straight from your camera.” — Sam Biddle / Gizmodo\n\n“For me it means I can meet clients anywhere, and do a shoot review making selects at a place that suits them, but without the theatrics of setting up a computer/laptop.” — Sean McCormack / lightroom-blog.com\n\n* * *\n\nThe best time to tag your photos is right after you make them, while your memory is still fresh. Capture thoughts and associate them with your photos on iPad; then later sync everything with your Lightroom catalog, at your convenience.\n\n––– KEY FEATURES –––\n\n• Native camera raw processing. The fastest native camera raw processing available on iPad\n• View, edit, then sync metadata with Lightroom: Keywords, pick/reject flags, description, location, and much more.\n• Touch-optimized keywording.\n• Automatic groupings of similar photos with Smart Groups (patent pending)\n• Apply metadata individually, in groups, or with user-defined presets\n• Sort and filter your photos by flags, stars, color labels, dates and filenames\n• Export to Facebook, Flickr, Dropbox, email, and iPad Albums\n• View JPG and camera raw photos with 200% zoom\n• Import photos wirelessly with Eye-Fi and FTP\n• Import photos through USB using iTunes\n• Very robust and configurable Lightroom sync options, accommodating many digital photography workflows\n\nPhotosmith is not an image manipulation tool, and cannot adjust photo exposure, crop, or color temperature.  However, you may edit photos using any of the wonderful image editing apps available, then import them right into Photosmith for organizing and storage.\n\n–– Camera File Format Support –– \n• JPG: Complete support for both image viewing and metadata \n• Native camera raw rendering for the following camera formats: CR2, NEF, ORF, PEF, NRW, SRF, CRW, RAF, RW2, DNG, SRW, RAW, MOS, ERF, MRW, KDC, 3FR, ARW, DC2, DCR, FFF, HDR, K25, KC2, MDC, MEF \n\n* For a comprehensive list of all tested camera raw filetypes, please visit photosmithapp.com/cameras \n\n\n–– Requirements –– \n• iPad 3 or newer strongly recommended \n• iOS 5.1 or higher \n• Apple® Camera Connection Kit (only needed when importing images directly from your camera or memory card) \n• Adobe® Photoshop® Lightroom 4.0 or higher\n• Photosmith Lightroom plugin --- A free download from photosmithapp.com \n• Wi-Fi connection to your Mac or PC during Lightroom sync \n\n\n–– Support –– \nPhotosmith was created by a small team of avid photographers. We take customer feedback very seriously and welcome your interaction and discussion. \n\nWhile every effort has been made to ensure that Photosmith sync “just works,” you may still have questions. Photosmith offers extensive in-app help, and you may contact us directly from within the app. \n\nWe also maintain a User Guide as a PDF and individual Knowledge Base articles - both are at support.photosmithapp.com \n\nFor a complete list of features and videos, please visit photosmithapp.com", "artistName": "C² Enterprises, Inc", "artworkUrl512": "http://a1302.phobos.apple.com/us/r30/Purple/v4/dd/62/71/dd627197-6b5b-45ac-4f58-e4a01ea76460/mzl.wtitpebl.png", "version": "3.1.1", "primaryGenreId": 6008, "primaryGenreName": "Photo & Video", "fileSizeBytes": "29070293", "price": 19.99, "isGameCenterEnabled": false, "trackCensoredName": "Photosmith", "genreIds": ["6008", "6007"], "trackName": "Photosmith", "releaseNotes": "v3.1.1: Fixes crash caused by iOS 7.1 \n\nNew in Photosmith for iPad v3.1: \n\n• Native camera raw rendering for the following camera formats: CR2, NEF, ORF, PEF, NRW, SRF, CRW, RAF, RW2, DNG, SRW, RAW, MOS, ERF, MRW, KDC, 3FR, ARW, DC2, DCR, FFF, HDR, K25, KC2, MDC, MEF \n• Lightroom Sync Dashboard: See sync status of all your User Collections and start sync of specific (or multiple) User Collections right in Photosmith. \n• Vastly improved Lightroom sync detection and network discovery \n• Added metadata conflict chooser during sync in Photosmith \n• Many bug fixes and optimizations, too numerous to mention here, please visit photosmithapp.com for full details.", "sellerUrl": "http://www.photosmithapp.com", "screenshotUrls": [], "userRatingCount": 185, "trackContentRating": "4+", "formattedPrice": "$19.99", "artistViewUrl": "https://itunes.apple.com/us/artist/c2-enterprises-inc/id423911974?uo=4", "kind": "software", "averageUserRatingForCurrentVersion": 3.0, "sellerName": "C Squared Enterprises, Inc", "supportedDevices": ["iPadFourthGen", "iPad2Wifi", "iPadThirdGen", "iPad3G", "iPadMini4G", "iPadFourthGen4G", "iPadThirdGen4G", "iPadMini", "iPad23G", "iPadWifi"], "artworkUrl100": "http://a1302.phobos.apple.com/us/r30/Purple/v4/dd/62/71/dd627197-6b5b-45ac-4f58-e4a01ea76460/mzl.wtitpebl.png", "bundleId": "com.csquaredapps.photosmith", "trackViewUrl": "https://itunes.apple.com/us/app/photosmith/id427757668?mt=8&uo=4", "minimumOsVersion": "5.1", "artworkUrl60": "http://a1686.phobos.apple.com/us/r30/Purple/v4/f8/7d/18/f87d1830-96bc-4c23-d907-b2be46165705/AppIcon72x72_ipad.png", "averageUserRating": 3.5}