{"contentAdvisoryRating": "17+", "features": [], "languageCodesISO2A": ["EN"], "ipadScreenshotUrls": [], "releaseDate": "2011-11-29T08:00:00Z", "currency": "USD", "artistId": 422115756, "userRatingCountForCurrentVersion": 132, "wrapperType": "software", "advisories": ["Frequent/Intense Sexual Content or Nudity", "Infrequent/Mild Mature/Suggestive Themes"], "genres": ["Social Networking", "Lifestyle"], "trackId": 429431089, "description": "MISTER is the first and only gay app for men over 30. The guys on MISTER are real men: confident, strong, down-to-earth men who have experience in the things that matter. Whether you're over 30 — or just love grown men — it's time to become a MISTER.\n\nFEATURES\n- MR. Right learns what kinds of men you like and sends you personalized introductions everyday\n- Matches: We'll let you know when you and another member both \"Like\" each other\n- Multiple Views: More ways to view the men on your screen. See who’s nearby, who’s far away, who’s interested in you and more. Click top-left corner to see.\n- Adjust Views: Once you’ve chosen a view, fine-tune it to see the men you’re most interested in. Want to talk to someone right now? Sort by last login. Use the age filter to zero in even more. Customize to keep things fresh.\n- Better Profiles: Upload up to 25 photos to public and private galleries and spend less time sending pics back and forth. Get into detail with profile text up to 3,000 characters.\n\nMISTER MEN\nSo, what kinds of men will you meet on MISTER? Suit-and-tie professionals and carefree outdoorsmen; tattooed gay guys and big hairy bears; bearded guys, bald guys, jocks, and muscle daddies. They all share the screen on MISTER.\n\nMISTER men are straightforward, honest and generally friendlier than guys on other apps. They’ll tell you if they’re husky or skinny, if they’re HIV-positive or negative, if they’re 52 or 25. And they’re proud of who they are. Most of our members agree to the MISTER Code, a shared set of values regarding mutual respect and safety.\n\nMISTER PREMIUM\nGet even more features when you upgrade to our premium subscription service:\n- See up to seven times as many men as you would on the free version.\n- Online-Only Mode lets you check out only who’s logged in and ready to talk right now.\n- The Travel Feature allows you to pick any city and scan the MISTER scene there.\n- Read Message Notifications let you know the second your message is seen by the recipient.\n- The Private Photo Bucket gives you the power to send additional photos more quickly and store your photos within MISTER. That way, any risqué shots don’t have to sit in your iPhone albums where snooping friends or relatives might find them.\n- MISTER Premium also gives you unfiltered, unlimited access to misterapp.com where you can do advanced searches on dozens of different criteria.\n\nMISTER PREMIUM SUBSCRIPTION\nVisit http://www.misterapp.com/app/magnum to see a list of MISTER Premium features. Choose a one-month ($9.99) or three-month ($24.99) subscription. Subscriptions auto-renew until cancelled. Payment for all purchases will be charged to your iTunes account upon confirmation of your purchase. Your subscription automatically renews unless auto-renew is turned off at least 24 hours before the end of the current period. Your iTunes account will automatically be charged at the same price for renewal within 24 hours prior to the end of the current period (one month for monthly subscribers or three months for quarterly subscribers) unless you change your subscription preferences in your iTunes account settings. No cancellation of the current subscription is allowed during an active subscription period.\n\nMISTER is for men over 18 years old only. Photos that display nudity or are sexually suggestive will be removed immediately. Please visit http://www.misterapp.com/mister/terms to see our terms of use and privacy policies.", "artistName": "DH Services", "artworkUrl512": "http://a1571.phobos.apple.com/us/r30/Purple/v4/b2/cb/8d/b2cb8daa-dd08-e8c7-c9d8-e546b2683e14/mzl.xutabcmg.png", "version": "2.2.0", "primaryGenreId": 6005, "primaryGenreName": "Social Networking", "fileSizeBytes": "19652017", "price": 0.0, "isGameCenterEnabled": false, "trackCensoredName": "MISTER: Gay app for real men. Chat with and date gay men with facial scruff", "genreIds": ["6005", "6012"], "trackName": "MISTER: Gay app for real men. Chat with and date gay men with facial scruff", "releaseNotes": "Now members have the option to state they are stigma-free when it comes to dating.", "sellerUrl": "http://www.misterapp.com", "screenshotUrls": ["http://a3.mzstatic.com/us/r30/Purple6/v4/2b/b9/59/2bb959c0-8c67-abd8-bca3-8bfb6093e2d6/screen1136x1136.jpeg", "http://a1.mzstatic.com/us/r30/Purple6/v4/71/ee/5b/71ee5b4d-f56e-b284-a135-cc290d63debe/screen1136x1136.jpeg", "http://a2.mzstatic.com/us/r30/Purple4/v4/a8/99/9b/a8999b7b-6b43-ab6d-8d39-61c36f57f0be/screen1136x1136.jpeg", "http://a3.mzstatic.com/us/r30/Purple/v4/53/57/05/53570537-5d1b-db5f-a8e1-61ebab8fab8b/screen1136x1136.jpeg", "http://a5.mzstatic.com/us/r30/Purple/v4/4f/af/c4/4fafc46b-ca6d-99e8-7fbc-9cac249f756a/screen1136x1136.jpeg"], "userRatingCount": 1472, "trackContentRating": "17+", "formattedPrice": "Free", "artistViewUrl": "https://itunes.apple.com/us/artist/dh-services/id422115756?uo=4", "kind": "software", "averageUserRatingForCurrentVersion": 4.5, "sellerName": "DH Services", "supportedDevices": ["iPadMini", "iPhone4S", "iPad23G", "iPadThirdGen", "iPadFourthGen4G", "iPad2Wifi", "iPadFourthGen", "iPodTouchourthGen", "iPhone4", "iPadThirdGen4G", "iPhone5s", "iPhone5", "iPhone-3GS", "iPodTouchFifthGen", "iPadMini4G", "iPhone5c"], "artworkUrl100": "http://a1571.phobos.apple.com/us/r30/Purple/v4/b2/cb/8d/b2cb8daa-dd08-e8c7-c9d8-e546b2683e14/mzl.xutabcmg.png", "bundleId": "com.daddyhunt.mister", "trackViewUrl": "https://itunes.apple.com/us/app/mister-gay-app-for-real-men./id429431089?mt=8&uo=4", "minimumOsVersion": "6.0", "artworkUrl60": "http://a1702.phobos.apple.com/us/r30/Purple2/v4/01/f0/48/01f048f5-94f9-f8b3-51da-c46d25fae0ff/appicon.png", "averageUserRating": 4.0}