{"contentAdvisoryRating": "4+", "features": [], "languageCodesISO2A": ["EN"], "ipadScreenshotUrls": [], "releaseDate": "2011-04-18T14:51:31Z", "currency": "USD", "artistId": 298856275, "userRatingCountForCurrentVersion": 74, "wrapperType": "software", "advisories": [], "genres": ["Photo & Video", "Entertainment"], "trackId": 430065256, "description": "Interactive Panorama Capture and Sharing, with new Social Features! – Now in Version 1.6.2\n\nWith Photosynth’s new social features it’s easier than ever to get your best work noticed!\n\nPhotosynth for iOS is the panorama creation app that makes it easy and fun to capture and share interactive panoramas of the places, people, and events that are important to you. Using the latest in computer vision techniques, you can create panoramas not only from left to right, but also up and down, enabling you to capture a full sphere.\n\nOnce you’ve created a panorama, share it as an interactive experience on Photosynth, Facebook, Twitter, or in email (using the free Photosynth service) or as a simple image. Interactive panoramas you share publicly can be viewed by anyone, are searchable, and may be featured by Photosynth and Bing to be seen by millions!\n\nJoin the Photosynth community to share your view of the world while getting inspired by other panorama enthusiasts. Explore panoramas, users, and tags featured by Photosynth. Search for amazing images from the Photosynth community. Like, share, and comment on your favorite finds, then customize your newsfeed by following users and tags you enjoy the most. Share your panoramas, accumulate likes, comments, and follows, and soon your masterpieces could be featured by Photosynth and Bing to be seen by millions!\n\nConnect the Photosynth application with the Ricoh Theta to instantly capture a full 360-degree panorama for even easier sharing! Get more info at http://theta360.com.\n\nFeatures\n• See your panoramas take shape as you capture them with INTERACTIVE CAPTURE\n• Look and capture in all directions with FULL-SPHERE PANORAMAS\n• See the final panorama right away with fast ON-DEVICE PROCESSING\n• Sharp, seamless results with the ADVANCED IMAGE STITCHING ENGINE\n• Zoom, pan, and rotate your panorama in any direction with our IMMERSIVE VIEWER\n• Share your view of the world with the PHOTOSYNTH COMMUNITY\n• SEARCH AND EXPLORE panoramas from the Photosynth community to discover new amazing interactive images\n• LIKE, SHARE, AND COMMENT on the creations of other photo enthusiasts\n• Build a personal NEWSFEED by following your favorite content creators and popular topics\n• Jump-start your newsfeed by following Photosynth’s RECOMMENDED USERS AND TAGS\n• Get NOTIFICATIONS when your panoramas are liked or commented on, when you are followed, or when Photosynth has featured one of your creations\n• Connect with the RICOH THETA to instantly capture 360-degree panoramas (get more info at http://theta360.com)\n• Share images or interactive panoramas to FACEBOOK or TWITTER\n• Share in EMAIL to send images of your panoramas directly to friends\n• Your panorama images are available to any app from the CAMERA ROLL", "artistName": "Microsoft Corporation", "artworkUrl512": "http://a1827.phobos.apple.com/us/r30/Purple6/v4/c0/06/67/c006676b-46bc-764e-ca3d-2e7c72910e0f/mzl.jlhsbgfd.png", "version": "1.6.2", "primaryGenreId": 6008, "primaryGenreName": "Photo & Video", "fileSizeBytes": "6464586", "price": 0.0, "isGameCenterEnabled": false, "trackCensoredName": "Photosynth", "genreIds": ["6008", "6016"], "trackName": "Photosynth", "releaseNotes": "Photosynth goes social! Join the Photosynth community to share your view of the world while getting inspired by other panorama enthusiasts. Share your panoramas, accumulate likes, comments, and follows, and soon your masterpieces could be featured by Photosynth and Bing to be seen by millions!\n•Search and explore panoramas from the Photosynth community to discover new amazing interactive images\n•Like, share, and comment on the creations of other photo enthusiasts\n•Build a personal newsfeed by following your favorite content creators and popular topics\n•Jump-start your newsfeed by following recommended users and tags\n•Get notified when your panoramas are liked or commented on, when you are followed, or when Photosynth has featured one of your creations\n•Connect the Photosynth application with the Ricoh Theta to instantly capture a full 360-degree panorama for even easier sharing (get more info at http://theta360.com)\nVersion 1.6.2 fixes a bug that prevented panoramas from being shared via Twitter", "sellerUrl": "http://www.photosynth.net", "screenshotUrls": ["http://a2.mzstatic.com/us/r30/Purple/v4/9f/2c/46/9f2c46e1-bfe9-666c-e839-b2c1139a2d99/screen1136x1136.jpeg", "http://a4.mzstatic.com/us/r30/Purple6/v4/d8/29/02/d8290271-6f02-f9c4-3fde-a1bf1b93f591/screen1136x1136.jpeg", "http://a3.mzstatic.com/us/r30/Purple6/v4/64/ad/47/64ad47e5-f3f7-b9c7-1d19-181424a0919a/screen1136x1136.jpeg", "http://a4.mzstatic.com/us/r30/Purple6/v4/72/de/23/72de23b0-4223-d2dd-e698-118af097488f/screen1136x1136.jpeg", "http://a3.mzstatic.com/us/r30/Purple/v4/7b/9a/c6/7b9ac667-1cfb-ea81-2533-7b07a302a8ee/screen1136x1136.jpeg"], "userRatingCount": 4884, "trackContentRating": "4+", "formattedPrice": "Free", "artistViewUrl": "https://itunes.apple.com/us/artist/microsoft-corporation/id298856275?uo=4", "kind": "software", "averageUserRatingForCurrentVersion": 4.0, "sellerName": "Microsoft Corporation", "supportedDevices": ["iPodTouchFifthGen", "iPhone4S", "iPhone5s", "iPhone4", "iPad2Wifi", "iPhone5", "iPad23G", "iPadThirdGen", "iPodTouchourthGen", "iPadFourthGen4G", "iPadThirdGen4G", "iPadMini", "iPhone5c", "iPadMini4G", "iPadFourthGen", "iPhone-3GS"], "artworkUrl100": "http://a1827.phobos.apple.com/us/r30/Purple6/v4/c0/06/67/c006676b-46bc-764e-ca3d-2e7c72910e0f/mzl.jlhsbgfd.png", "bundleId": "com.microsoft.capture", "trackViewUrl": "https://itunes.apple.com/us/app/photosynth/id430065256?mt=8&uo=4", "minimumOsVersion": "5.0", "artworkUrl60": "http://a1722.phobos.apple.com/us/r30/Purple6/v4/31/1d/7e/311d7e91-ee1d-3313-74d4-e2a891440e0e/Icon.png", "averageUserRating": 4.5}