{"contentAdvisoryRating": "4+", "features": [], "languageCodesISO2A": ["EN"], "ipadScreenshotUrls": [], "releaseDate": "2011-04-29T23:08:32Z", "currency": "USD", "artistId": 306423356, "wrapperType": "software", "advisories": [], "genres": ["Finance", "Lifestyle"], "trackId": 433742861, "description": "Homes.com's Mortgage Calculator is the perfect tool to help you understand finances if you are looking to buy, sell, or refinance a house. Determine your monthly payments, discover if you can save money refinancing your home loan, or if a fixed or adjustable mortgage would be in your best interest. \n\n\nFeatures:\nEnter your information once. If the field appears in another calculator, the information will be entered into the same fields in the other calculators.\n\nHome Screen becomes an infographic of your finances.\n\nMortgage calculator: See a breakdown of the four components that make up your total estimated monthly payment. An optional mortgage amortization chart will give you a monthly breakdown of the payments you make each month for the life of the loan.\n\nRefinancing Calculator: Discover how much you can save monthly by refinancing your current loan.\n\nDebt to Income: Calculate your Front End and Back End Ratio. Find out where you stand with your debt load and how that might affect your loan approval.\n\nLoan Term: Choose a different loan term and see how it can affect your monthly payment, the total interest you will pay, and your overall payment.\n\nInterest Rate: Compare interest rates and see how they can change what you pay for principal and interest, total interest, and total payments. The amount can be quite significant.\n\nRent or Buy: Based on your housing expenses and how long you plan to live in a certain location, see if renting or buying would be the most cost effective choice.\n\nFixed vs Adjustable: Compare a Fixed Interest Mortgage (interest rate stays the same for the duration of the loan) with an Adjustable Rate Mortgage (ARM - interest rates will change and fluctuate over the duration of the loan). The optional amortization chart provides a yearly breakdown of payments for Fixed and Adjustable Mortgages.\n\nGet Pre-Qualified: Looking to get pre-qualified for a mortgage loan? Complete an optional online home pre-qualification application in minutes. Get a quick (as little as 10 minutes) response from a lender that can assist you with securing a mortgage loan.\n\nPeople who might be interested in this app:  \n- Home buyers, home sellers, anyone preparing and beginning the home buying process, or renters curious about the potential to save if they buy versus if they rent.\n\nHomes.com is not only your partner in the home search process, but also for financing that dream home. Feel confident about your options with the Mortgage Calculator from Homes.com.", "artistName": "Homes.com", "artworkUrl512": "http://a971.phobos.apple.com/us/r30/Purple5/v4/a4/5c/6e/a45c6e94-d261-0402-6fcd-7d33ee9cd29a/mzl.ljdwkvse.jpg", "version": "1.11", "primaryGenreId": 6015, "primaryGenreName": "Finance", "fileSizeBytes": "9515127", "price": 0.0, "isGameCenterEnabled": false, "trackCensoredName": "Mortgage and Home Loan Calculator", "genreIds": ["6015", "6012"], "trackName": "Mortgage and Home Loan Calculator", "releaseNotes": "Bugfix\nFixed bug in Get Prequalified that prevented submission of the form.", "sellerUrl": "http://www.homes.com/mobile-apps", "screenshotUrls": ["http://a4.mzstatic.com/us/r30/Purple3/v4/a8/de/d6/a8ded679-7563-7893-c90f-6e86793699c3/screen1136x1136.jpeg", "http://a5.mzstatic.com/us/r30/Purple3/v4/37/75/79/37757930-0375-3ca5-6ef9-acb7ae65e7c8/screen1136x1136.jpeg", "http://a2.mzstatic.com/us/r30/Purple1/v4/f6/4b/00/f64b00ac-1afb-91b0-ae66-cbe2fe6efdf2/screen1136x1136.jpeg", "http://a4.mzstatic.com/us/r30/Purple1/v4/78/fb/40/78fb40e3-1718-5f63-9dae-cbb486442455/screen1136x1136.jpeg", "http://a1.mzstatic.com/us/r30/Purple3/v4/dc/86/67/dc8667cd-07d1-2b6a-b334-be9a3219eb57/screen1136x1136.jpeg"], "userRatingCount": 175, "trackContentRating": "4+", "formattedPrice": "Free", "artistViewUrl": "https://itunes.apple.com/us/artist/homes.com/id306423356?uo=4", "kind": "software", "sellerName": "Homes.com", "supportedDevices": ["iPadMini", "iPhone5s", "iPhone-3GS", "iPadFourthGen", "iPadThirdGen4G", "iPad23G", "iPadMini4G", "iPadThirdGen", "iPodTouchourthGen", "iPodTouchFifthGen", "iPhone4S", "iPadFourthGen4G", "iPad2Wifi", "iPhone5", "iPhone4", "iPhone5c"], "artworkUrl100": "http://a971.phobos.apple.com/us/r30/Purple5/v4/a4/5c/6e/a45c6e94-d261-0402-6fcd-7d33ee9cd29a/mzl.ljdwkvse.jpg", "bundleId": "com.homes.mortgagecalculator", "trackViewUrl": "https://itunes.apple.com/us/app/mortgage-home-loan-calculator/id433742861?mt=8&uo=4", "minimumOsVersion": "6.0", "artworkUrl60": "http://a1758.phobos.apple.com/us/r30/Purple3/v4/a4/21/d9/a421d970-ac07-12f1-eca0-441dd76fed97/appicon.png", "averageUserRating": 3.5}