{"contentAdvisoryRating": "4+", "features": [], "languageCodesISO2A": ["EN", "ID", "PT", "ES", "TR"], "ipadScreenshotUrls": [], "releaseDate": "2011-05-24T18:02:45Z", "currency": "USD", "artistId": 434613899, "userRatingCountForCurrentVersion": 12, "wrapperType": "software", "advisories": [], "genres": ["Food & Drink", "Travel"], "trackId": 434613896, "description": "Zomato is your best option to search for and discover great places to eat. It's a beautifully designed, easy-to-use social restaurant finder app that lets you explore all the dining options in your city. Browse through updated menus, pictures, and user reviews to decide where you want to eat, and use the map feature to guide you there.\n\nBuild a trusted network of friends and discover great new restaurants through them. Show off your own food journey with reviews, stunning filtered pictures, and check-ins at restaurants. \n\n**Features**\n\n* Search easily for Restaurants, Cafes, Pubs and Bars by location, cuisine (e.g. Chinese, Italian, Indian), name (e.g. Starbucks, Domino's Pizza, Amaya), or browse through beautifully crafted Collections to discover something special.\n* Explore every restaurant in your city, including the ones around your current location, and use search filters to find the one that suits you best. \n* View menus, pictures, phone numbers, directions, user reviews, and all the other information you need to choose a restaurant for Dine-out, Delivery, Nightlife or Takeaway. Maintain an easy-reference list of your favorites or places you want to visit with Bookmarks.\n* Check in at restaurants you visit, see useful information about the restaurant, add photos, and tag friends you're eating or drinking with.\n* Rate and review restaurants you've been to, and share photos of your foodie moments directly from the app.\n* In-app table booking (UK ONLY): If you're in the United Kingdom, you can book tables at all restaurants supported by OpenTable. Includes Passbook support for easy access to your booking details. \n\n\nZomato is currently available in over 100 cities across India, the UK, UAE, Chile, New Zealand, South Africa, Indonesia, Portugal, Turkey, the Philippines, Brasil, Qatar, Sri Lanka, the Czech Republic, and Slovakia. More locations coming very soon. \n\nZomato requires you to log in; it's only so we can get to know you better and serve you the stuff you'd like to see. \n\nKeywords: food, drink, restaurants, bar, cafe, menu, review, pub, delivery, dining, nightlife, takeout, takeaway, offers, deals, discounts, order food, restaurants near me, travel, local, food delivery, table booking, book a table, food app", "artistName": "Zomato Media Pvt. Ltd.", "artworkUrl512": "http://a303.phobos.apple.com/us/r30/Purple1/v4/ae/7f/6c/ae7f6cf9-e54c-1c0c-f9a4-4fdb32dcdd24/pr_source.png?downloadKey=1417124943_fa52354b1d0d5a3026c1ca75ae9aa27b", "version": "6.2", "primaryGenreId": 6023, "primaryGenreName": "Food & Drink", "fileSizeBytes": "13662581", "price": 0.0, "isGameCenterEnabled": false, "trackCensoredName": "Zomato - Food & Restaurant Finder", "genreIds": ["6023", "6003"], "trackName": "Zomato - Food & Restaurant Finder", "releaseNotes": "Here's what's new in this version:\nMap view on Nearby search: You can now view restaurant pins on a map, and also draw – yes, draw – the area in which you want to search for places. You'll find this super handy when you're searching for places around a landmark.\n\nBookmark sorting and filtering: Your Bookmarked restaurants can now be sorted by distance, or how recently they were added. You can also filter search results to quickly find places that are already in your bookmarks.\n\nOptimisation for iPhone 6 and 6 Plus: Size does matter, and our app now works like a charm on the newest iPhones.\n\nNew Collections layout: In addition to our regular collections, you'll now see collections ideal for the time of day, day of the week, and the weather. *Currently available in Delhi, London, Istanbul, Toronto, Dubai and Lisbon; more cities coming soon!\n\nExclude Chains' filter in search results: Ever felt chained down by the same old dining options? A single tap now opens up a world of new dining options. Seriously, there's only *that* many days in a month you can eat sandwiches for lunch. *Currently available only in London; more cities to be unchained soon!\n\nP.S. Zomato is hiring engineers! If you're interested, check out our careers page at zomato.com/careers", "sellerUrl": "http://www.zomato.com/mobile", "screenshotUrls": ["http://a3.mzstatic.com/us/r30/Purple3/v4/d0/b3/05/d0b30515-c601-1043-ed58-70fd68c1d672/screen322x572.jpeg", "http://a1.mzstatic.com/us/r30/Purple3/v4/87/2c/c6/872cc6cc-315d-a003-3cf5-0d771faf5370/screen322x572.jpeg", "http://a2.mzstatic.com/us/r30/Purple3/v4/d4/72/31/d472318b-5347-903f-eb6b-79f344707b81/screen322x572.jpeg", "http://a5.mzstatic.com/us/r30/Purple5/v4/4f/a6/33/4fa633a9-e57b-de5f-7ec7-622e9be0ec65/screen322x572.jpeg", "http://a3.mzstatic.com/us/r30/Purple5/v4/2e/bd/15/2ebd15e1-44a8-81c9-9fa3-ced69fd2d9a0/screen322x572.jpeg"], "userRatingCount": 486, "trackContentRating": "4+", "formattedPrice": "Free", "artistViewUrl": "https://itunes.apple.com/us/artist/zomato-media-pvt.-ltd./id434613899?uo=4", "kind": "software", "averageUserRatingForCurrentVersion": 4.5, "sellerName": "Zomato Media Pvt. Ltd.", "supportedDevices": ["iPadFourthGen", "iPhone5s", "iPhone4", "iPadThirdGen4G", "iPhone4S", "iPad2Wifi", "iPad23G", "iPodTouchFifthGen", "iPadMini", "iPadMini4G", "iPhone5", "iPadFourthGen4G", "iPadThirdGen", "iPhone5c"], "artworkUrl100": "http://a303.phobos.apple.com/us/r30/Purple1/v4/ae/7f/6c/ae7f6cf9-e54c-1c0c-f9a4-4fdb32dcdd24/pr_source.png?downloadKey=1417124943_fa52354b1d0d5a3026c1ca75ae9aa27b", "bundleId": "com.zomato.zomato", "trackViewUrl": "https://itunes.apple.com/us/app/zomato-food-restaurant-finder/id434613896?mt=8&uo=4", "minimumOsVersion": "7.0", "artworkUrl60": "http://a63.phobos.apple.com/us/r30/Purple3/v4/c3/38/d1/c338d171-32e9-9537-055c-0b6b2e4818f7/AppIcon60x60_U00402x.png", "averageUserRating": 4.5}