{"contentAdvisoryRating": "4+", "features": [], "languageCodesISO2A": ["EN"], "ipadScreenshotUrls": [], "releaseDate": "2011-09-12T07:00:00Z", "currency": "USD", "artistId": 327716319, "userRatingCountForCurrentVersion": 11, "wrapperType": "software", "advisories": [], "genres": ["Social Networking", "Games", "Educational", "Role Playing"], "trackId": 434820598, "description": "MogiMe is the best mobile avatar social network. Create MogiMe avatars (a.k.a Mogis) for yourself and everyone you know for FREE! Then you get to dressup your Mogis. Show off your Mogis in our new social gallery and also check out what other MogiMe users are creating! There's so much to do in MogiMe Avatar Social besides having fun playing dress up. Have fun with creating, sharing your creations, discovering other users' creations, making friends, playing games, and start making friends!\n\nUse the MogiMe Avatar Creator to personalize your own Mogis, then save them to My Mogis Gallery. Choose the best one you like for your MogiMe profile and share your avatar creations with everyone in so many ways, e.g. email, text message, etc. You can view, export, and edit your Mogis anytime you like. And check your Mogis to see if anyone liked or left you a comment on it recently. :)\n\nDon't just have fun creating avatars for yourself. Make fun avatars for friends and family too, and set them for your contacts in the built-in address book so that their Mogis will appear when they are calling you on your iPhone. You can also save your Mogis to your iPod, iPad or iPhone photos album and share them however you wish.  \n\nOver 350 FREE items, offering millions of combinations! And millions more items to choose from our Mogi Shop using your Mogi Tickets and Mogi Coins...Check back often! We update the shop with new items weekly and some times daily. There will be limited edition items as well, so don't miss out! You can buy MogiCoins or MogiTickets in Shop, or earn free Mogi money and receive daily gifts too! Tap on the gold coin in store to find out more!\n\nWin Mogi Tickets or Avatar items just by downloading the app and signing up for a MogiMe account. Check back often for more FREE Avatar items or FREE Mogi Tickets that you can use to buy whatever you want - whether a game from our Arcade or a cool outfit pack from our Mogi Shop.\n\nCheck out some of the games and apps in Apps. We have 3 mini games Find Mr Mogi (similar to Where's Waldo), Mogi Match (similar to Bejeweled), and Rock Paper Scissors (we all know this game, but this is more interesting with adorable characters - play it with a friend!). There are other cool apps that you can download and check out too here, most of them are free. :)\n\nAre you a fashionista? Or a Manga & Anime fan ? Or just someone who really likes MogiMe? Well, what are you waiting for? Download the app NOW, and start having fun!\n\nSUPPORT & FAQ\n\nEmail us at support@mogime.com if you have any issues.\n\nIf you have missing items or avatars in your gallery, restart MogiMe App by terminating it from your iOS Task Dock.\n\nReset password if now available from the settings view, the settings view is \"Gear\" button at the top right corner of your profile view when you are signed in. Or access it by tapping on the Info icon on splash screen. If you cannot reset your password, please email us at support@mogime.com\n\nYou will love Avatar Social by MogiMe if you like DressUp Games, Fashion, Manga Avatars, Anime Avatars, virtual worlds, chat, texting, making friends, and apps like Me Girl, IT Girl, WeeMee, Social Girl, DressUp! Fashion, Stardom The A-List. These apps mentioned are mostly dressup, dress-up, dress up apps, MogiMe is more than that! Download it and you will see. :)\n\nYou should try Avatar Social by MogiMe if you like Manga Avatars, Anime Avatars, IT Girl, WeeMee, Social Girl, DressUp! Fashion, Stardom The A-List.", "artistName": "MogiMe, Inc.", "artworkUrl512": "http://a1104.phobos.apple.com/us/r30/Purple3/v4/d1/d6/0a/d1d60a91-8e27-21f8-2e42-b382ac48e51b/mzl.xumtbvst.png", "version": "1.4", "primaryGenreId": 6005, "primaryGenreName": "Social Networking", "fileSizeBytes": "23433991", "price": 0.0, "isGameCenterEnabled": false, "trackCensoredName": "Avatar Creator Social by MogiMe", "genreIds": ["6005", "6014", "7008", "7014"], "trackName": "Avatar Creator Social by MogiMe", "releaseNotes": "Bug fixes:\n\nUpload to gallery bug is fixed! Yes! Now your Mogis will be uploaded to the public gallery because we finally found that pesky little bug that has been causing the uploading issue.\n\nNow go make more Mogis!\n\nMore stickers. Stickers. STICKERS!\n \nTap on the stickers to will bring you to the Sticker Store to download it!", "sellerUrl": "http://mogime.com", "screenshotUrls": ["http://a4.mzstatic.com/us/r30/Purple/v4/95/97/b3/9597b3be-4b3b-0170-1a6c-4238c566cefd/screen1136x1136.jpeg", "http://a5.mzstatic.com/us/r30/Purple/v4/08/dd/94/08dd94d6-b48f-bd34-e0ee-e0e1718f1eaf/screen1136x1136.jpeg", "http://a2.mzstatic.com/us/r30/Purple/v4/62/b0/17/62b01710-36f2-07a3-e218-b7becf552235/screen1136x1136.jpeg", "http://a4.mzstatic.com/us/r30/Purple/v4/0c/75/d1/0c75d16e-1557-ef60-49db-a29cfbcdb149/screen1136x1136.jpeg", "http://a5.mzstatic.com/us/r30/Purple/v4/90/10/97/901097db-91b2-599e-9343-fd51984a3633/screen1136x1136.jpeg"], "userRatingCount": 896, "trackContentRating": "4+", "formattedPrice": "Free", "artistViewUrl": "https://itunes.apple.com/us/artist/mogime-inc./id327716319?uo=4", "kind": "software", "averageUserRatingForCurrentVersion": 3.0, "sellerName": "MogiMe, Inc.", "supportedDevices": ["iPhone4S", "iPadFourthGen", "iPad2Wifi", "iPhone5c", "iPhone-3GS", "iPadThirdGen4G", "iPhone4", "iPhone5", "iPad23G", "iPadMini", "iPodTouchFifthGen", "iPodTouchourthGen", "iPadThirdGen", "iPadMini4G", "iPhone5s", "iPadFourthGen4G"], "artworkUrl100": "http://a1104.phobos.apple.com/us/r30/Purple3/v4/d1/d6/0a/d1d60a91-8e27-21f8-2e42-b382ac48e51b/mzl.xumtbvst.png", "bundleId": "net.leftrightstudios.mogime", "trackViewUrl": "https://itunes.apple.com/us/app/avatar-creator-social-by-mogime/id434820598?mt=8&uo=4", "minimumOsVersion": "6.1", "artworkUrl60": "http://a1571.phobos.apple.com/us/r30/Purple1/v4/27/49/fc/2749fce1-2001-8ed5-6617-4b6c834dc62b/Icon.png", "averageUserRating": 4.0}