{"contentAdvisoryRating": "4+", "features": ["iosUniversal"], "languageCodesISO2A": ["EN"], "ipadScreenshotUrls": ["http://a2.mzstatic.com/us/r30/Purple4/v4/45/90/24/4590249a-66d7-2578-f15d-ac38b7ca955f/screen480x480.jpeg", "http://a2.mzstatic.com/us/r30/Purple/v4/c3/d0/9c/c3d09cf9-245f-ab0c-3751-b025176058b7/screen480x480.jpeg", "http://a5.mzstatic.com/us/r30/Purple6/v4/4e/36/76/4e367619-5bd6-9375-9fc6-a2f27a44fd57/screen480x480.jpeg", "http://a3.mzstatic.com/us/r30/Purple6/v4/2b/ea/25/2bea2563-788d-4751-f302-7c10db1f387e/screen480x480.jpeg", "http://a3.mzstatic.com/us/r30/Purple/v4/9d/94/f2/9d94f202-1444-1fd5-36cb-ca7a84f39f69/screen480x480.jpeg"], "releaseDate": "2011-10-04T07:00:00Z", "currency": "USD", "artistId": 328868865, "userRatingCountForCurrentVersion": 16, "wrapperType": "software", "advisories": [], "genres": ["Reference", "Lifestyle"], "trackId": 436998224, "description": "POCKETBIBLE is powerful, full-featured software designed to help you read and study the Bible! Includes the King James Version Bible plus over 40 other Bibles, Bible reference titles and devotionals free upon registration. Hundreds of other titles (NIV, ESV, etc.) are available for purchase. All Bibles and books are \"offline\" -- no Internet connection is required after download.\n\nAlready a Laridian customer? PocketBible can use any of your previously purchased books and Bibles (no matter which platform you originally purchased them for). If you use PocketBible on other iOS devices or even your Windows PC, you can synchronize your personal data (notes, bookmarks, highlights) between devices.\n\nREVIEWS:\n\n\"PocketBible is one of the most full featured applications I have ever used and has a ton of features and functions to make Bible study a very pleasant experience.\" Matthew Miller, ZDNET.com\n\n\"The toggle feature moves you quickly between pages or books. Amazing! No one else has this feature.\" gracefirst\n\n\"I'm impressed. Simple, clean interface--and what's amazing is that they remembered and restored past purchases to my new iPhone--and it was easy! Now that's service!\" Cvogan\n\n\"If the AppStore gave out awards for the best app this would win it hands down. It has the cleanest and easiest to use UI of any app I've used on the iPad. If I could I would give it 10 stars not just 5.\" RS.C.\n\nTOP FEATURES: \n\n1. Read and study the Bible anywhere. No Internet connection required.\n2. Move easily through Bibles and books by simply turning the page. Go to any verse using one of three methods for selecting book, chapter and verse.\n3. Quickly find any word or phrase in your entire library.\n4. Keep track of what you learn with highlights, notes and bookmarks; sync to the Laridian cloud for sharing with PocketBible on all your other devices.\n5. Take your study further with popular commentaries, word study books, dictionaries (each sold separately).\n6. Share verses by text message or email.\n\nCOMES WITH:\n\n* KJV Bible\n* Over 40 additional free titles upon registration (including SBL Greek New Testament, ASV, World English Bible, Geneva NT, JFB Commentary, Treasury of Scripture Knowledge, and several Bible reading plans)\n\nEXPAND YOUR LIBRARY:\n\n* Choose from hundreds of popular Bibles and Bible reference titles including NIV, ESV, Spanish NVI, Catholic NAB, NIV Study Bible, Bible Knowledge Commentary, Vine's Expository Dictionary and many more.\n\nMORE PROGRAM FEATURES:\n\n* Easily switch between any number of open Bibles and books\n* View multiple books at the same time\n* Easy Bible navigation by selecting book, chapter, verse\n* Highlight verses in a variety of colors\n* Set bookmarks on your favorite passages and create categories to organize bookmarks\n* Add your own notes to any verse. Bible references in your notes are automatically linked\n* Synchronize your highlights, bookmarks and notes with the Laridian cloud, and from there to PocketBible running on your other devices\n* Fast searching for words, phrases, and combinations of words/phrases\n* Track your progress as you read through devotional books and reading plans\n* Copy and paste to clipboard and to other apps\n* Full-screen reading in either portrait or landscape\n* Change font, font size, and colors to facilitate vision or night reading issues\n\nIN-APP UPGRADE TO ADVANCED FEATURES:\n\n* Synthesized audio reads any Bible or book to you (Voices sold separately)\n* Journal feature lets you create named notes not attached to a Bible verse\n* Name your highlight colors to remind you what a particular color means\n* Customize the behavior of taps and gestures that let you turn pages, move to previous and next chapter/verse, etc.\n* Unique \"Autostudy\" reports give you instant access to everything in your library related to a selected verse or word\n* Display book panes \"tiled\" or as tabs.\n* Advanced text selection -- select any text for copy, print, text, email, or speech\n* AirPrint support", "artistName": "Laridian", "artworkUrl512": "http://a1157.phobos.apple.com/us/r30/Purple4/v4/78/b4/f8/78b4f8ef-7635-bd15-b8bd-920c0bbb0bbb/mzl.fgternmr.png", "version": "3.1.0", "primaryGenreId": 6006, "primaryGenreName": "Reference", "fileSizeBytes": "8626731", "price": 0.0, "isGameCenterEnabled": false, "trackCensoredName": "PocketBible Bible Study App", "genreIds": ["6006", "6012"], "trackName": "PocketBible Bible Study App", "releaseNotes": "New Features:\n* Users with the Advanced Feature Set can change the behavior of the \"touch zones\". The most common customization is to use swipe up and down for page changes instead of swiping left and right. Other customizations are possible.\n* Added buttons for paragraphs, bold, italic, underline, ordered lists, unordered lists, and list items to the Note editor on the iPad.\n* Journal titles are now included in searches.\n\nBug Fixes:\n* Fixed a crash when user has more than about 70-75 books open simultaneously.\n* Fixed a crash in the Note editor on the iPhone when inserting font size or font color tags.\n* Fixed the list of verses at the top of the Note editor so that it gets correctly updated, especially when the Lock button is turned on.\n* Fixed erroneous cursor position after inserting certain HTML tags in the Note editor. Confirmed in iOS 7; could still be incorrect in earlier versions.\n* Fixed a misbehavior of the pop-up \"menu\" view on the iPad under iOS 7.1 in which it was not getting properly dismissed when subsequent toolbar buttons were pressed.\n\nMinor Enhancements:\n* Changed the defaults for \"Sync Bible/Commentaries\" and \"Highlight Linked Passage\" to ON.\n* Reduced the height of the expanded Toolbox in \"upside down portrait\" orientation so there's more room for the keyboard to pop up without obscuring Bible text.\n* Allow the horizontal rule tag to appear in notes without requiring the user to take responsibility for inserting paragraph tags.\n* Preserve the user's customer ID and password when resetting program settings to their defaults. This should reduce the occurrence of users inadvertently invalidating their user data and books.\n* Removed the \"launch recovery dialog\" that is displayed on launch after a program crash. The program will always retry without giving the user the option of deleting all their settings, which can result in invalidation of user-created data and the need to delete and reinstall books.", "sellerUrl": "http://www.laridian.com", "screenshotUrls": ["http://a1.mzstatic.com/us/r30/Purple4/v4/51/c3/f7/51c3f76e-a1e7-877c-add8-2c12c4dabcdc/screen1136x1136.jpeg", "http://a2.mzstatic.com/us/r30/Purple4/v4/ab/14/95/ab1495a3-ed4f-e26a-4dbc-e16db01b2803/screen1136x1136.jpeg", "http://a4.mzstatic.com/us/r30/Purple/v4/44/03/bb/4403bbec-32c6-e611-e8d6-9359ad18c4d6/screen1136x1136.jpeg", "http://a1.mzstatic.com/us/r30/Purple/v4/84/42/15/844215a7-f5fd-39b0-7af2-7f960cf2293e/screen1136x1136.jpeg", "http://a2.mzstatic.com/us/r30/Purple4/v4/00/b4/25/00b425b5-8463-03cd-8466-aae9cadfe273/screen1136x1136.jpeg"], "userRatingCount": 256, "trackContentRating": "4+", "formattedPrice": "Free", "artistViewUrl": "https://itunes.apple.com/us/artist/laridian/id328868865?uo=4", "kind": "software", "averageUserRatingForCurrentVersion": 4.5, "sellerName": "Laridian, Inc.", "supportedDevices": ["iPadFourthGen4G", "iPhone4", "iPodTouchFifthGen", "iPodTouchThirdGen", "iPhone5c", "iPad23G", "iPadThirdGen4G", "iPhone5s", "iPadMini", "iPad3G", "iPadMini4G", "iPhone-3GS", "iPad2Wifi", "iPadFourthGen", "iPadThirdGen", "iPhone4S", "iPadWifi", "iPhone5", "iPodTouchourthGen"], "artworkUrl100": "http://a1157.phobos.apple.com/us/r30/Purple4/v4/78/b4/f8/78b4f8ef-7635-bd15-b8bd-920c0bbb0bbb/mzl.fgternmr.png", "bundleId": "com.laridian.PocketBible2", "trackViewUrl": "https://itunes.apple.com/us/app/pocketbible-bible-study-app/id436998224?mt=8&uo=4", "minimumOsVersion": "5.0", "artworkUrl60": "http://a1222.phobos.apple.com/us/r30/Purple4/v4/0c/56/22/0c5622f1-98ba-cf9a-dd90-bf313af578d4/PocketBible_Dove_57x57.png", "averageUserRating": 4.0}