{"contentAdvisoryRating": "4+", "features": [], "languageCodesISO2A": ["CA", "NL", "EN", "FR", "DE", "IT", "JA", "PL", "PT", "RU", "ZH", "SK"], "ipadScreenshotUrls": ["http://a2.mzstatic.com/us/r30/Purple/v4/dd/76/d3/dd76d3b7-113e-a5f4-b9f0-b0d4dea63052/screen480x480.jpeg", "http://a5.mzstatic.com/us/r30/Purple/v4/f2/03/54/f2035461-0c76-e414-7d73-54d3b4958608/screen480x480.jpeg", "http://a3.mzstatic.com/us/r30/Purple/v4/e1/75/9b/e1759bf5-eedc-965d-39d4-158487c41a74/screen480x480.jpeg", "http://a3.mzstatic.com/us/r30/Purple/v4/d2/e3/9f/d2e39f18-5ff8-bd38-5faf-1835dcbcd9bc/screen480x480.jpeg", "http://a1.mzstatic.com/us/r30/Purple/v4/db/7d/5b/db7d5ba2-f303-a3dd-da6d-7c403d5f9f89/screen480x480.jpeg"], "releaseDate": "2011-10-26T07:00:00Z", "currency": "USD", "artistId": 335953314, "userRatingCountForCurrentVersion": 98, "wrapperType": "software", "advisories": [], "genres": ["Productivity", "Education"], "trackId": 439571171, "description": "\"It’s kind of like the Garage Band of coding.\" – Wired \n\n\"[Codea] for iPad is a super slick way to write and run programs on your iPad.\" – Gizmodo \n\nMost Innovative App & Best Generative Art App — 2011 Best App Ever Awards \n\nCodea lets you create games and simulations — or just about any visual idea you have. Turn your thoughts into interactive creations that make use of iPad features like Multi-Touch and the accelerometer. \n\nWe think Codea is the most beautiful code editor you'll use, and it's easy. Codea is designed to let you touch your code. Want to change a color, or an image? Tapping will bring up visual editors that let you choose exactly what you want. \n\nCodea is built on the Lua programming language. A simple, elegant language that doesn't rely too much on symbols — a perfect match for iPad. \n\nHere's how you use it: type your code. Press play to watch it run. Interact with it. Get creative.\n\nVIDEO \n\nSee twolivesleft.com/Codea \n\nFEATURES \n\n• A full featured vector graphics and image renderer lets you prototype what you can imagine.\n• Lots of fantastic example projects to learn from, including games and simulations.\n• Generate random retro-game sound effects to use in your creations.\n• Touch your code: tap colors, images and sounds to adjust them.\n• Complete in-line reference documentation accessible from the keyboard.\n• Intelligent auto-completion suggests keywords and functions.\n• Import your own assets from Dropbox, photos, and more.\n• A fully featured physics engine for complex motion.\n• Add parameters to your simulation or game interface so you can tweak variables at runtime.\n• Interact with the accelerometer and multi touch on your device.\n• Video recording: Record videos of your projects and share them! \n• Codea renders your code with beautiful syntax highlighting.\n• Codea can render 3D graphics\n• Export your finished projects to Xcode to produce real apps\n• GLSL Shader Language support with built-in shader editor.\n• Bluetooth keyboard support with custom keyboard shortcuts.\n\nIMPORTANT INFORMATION \n\n• Join the forums at http://twolivesleft.com/Codea/Talk to ask questions, share ideas and get help when you need it.\n\n• The included Codea Reference Documentation is currently only available in English and Chinese (Simplified). If you would like to help translate Codea into your language please join the translation effort at http://translate.twolivesleft.com.\n\n• If you need help or wish to get in contact with us, please use the support link on this page.", "artistName": "Two Lives Left", "artworkUrl512": "http://a1308.phobos.apple.com/us/r30/Purple/v4/e1/d8/91/e1d891a1-e77e-cf0f-930e-108e978323ea/mzl.bbavwfas.png", "version": "2.0", "primaryGenreId": 6007, "primaryGenreName": "Productivity", "fileSizeBytes": "28456156", "price": 9.99, "isGameCenterEnabled": false, "trackCensoredName": "Codea", "genreIds": ["6007", "6017"], "trackName": "Codea", "releaseNotes": "Codea 2.0 is Here\n\n• Redesigned for iOS 7\n• Full 64-bit support\n\nAssets\n\n• Codea now features a brand new unified asset system that supports sounds, music, images and more\n• Music API for playing background music in popular formats\n• Three fantastic new sound and music packs for you to use in your games — composed especially for Codea\n\nCompletely New Code Editor\n\n• Intelligent autocomplete picks up all your variables, locals and nested types\n• In-line errors show up live as you code\n• Smart indentation and scope completion\n• Most editor keys can be long-pressed for more options\n• Support for multi-line comments\n• Fix your code layout with the new Re-Indent feature\n\nNew Features\n\n• Find and Replace: access via the search button on the keyboard\n• Location API: access GPS data in Codea\n• displayMode(OVERLAY): use this for a transparent sidebar in your projects\n• Codea now uses double precision floating point\n• Projects can be sorted by recently opened, or by name\n• Z-level supported in setContext\n• Bluetooth Keyboard Shortcut support (see Getting Started section for a full list)\n\nImprovements\n\n• Codea has lost weight: Codea 2.0 is 23 MB, compared with 36 MB for the old version\n• Air Code respects your editor theme choice (light or dark)\n• Shader Lab can bind arrays, and will tell you about failed bindings\n• Shader compilation errors are printed as warnings in your projects\n• Dark keyboard style for dark theme\n\nFixes\n\n• Many, many fixes. Including the wrapped line issue in code editor\n\nStill Reading?\n\n• If you like Codea, please consider rating it on the App Store. We love reading your reviews.\n\n• Thank you for downloading Codea. Version 2.0 is the 22nd free update we’ve released; and we have plenty of great things planned for the future. Be sure to join the Codea forums at http://twolivesleft.com/Codea/Talk", "sellerUrl": "http://twolivesleft.com/Codea", "screenshotUrls": [], "userRatingCount": 697, "trackContentRating": "4+", "formattedPrice": "$9.99", "artistViewUrl": "https://itunes.apple.com/us/artist/two-lives-left/id335953314?uo=4", "kind": "software", "averageUserRatingForCurrentVersion": 5.0, "sellerName": "Two Lives Left", "supportedDevices": ["iPadFourthGen", "iPadThirdGen4G", "iPadMini", "iPad2Wifi", "iPadFourthGen4G", "iPadThirdGen", "iPadMini4G", "iPad23G"], "artworkUrl100": "http://a1308.phobos.apple.com/us/r30/Purple/v4/e1/d8/91/e1d891a1-e77e-cf0f-930e-108e978323ea/mzl.bbavwfas.png", "bundleId": "com.twolivesleft.Codify", "trackViewUrl": "https://itunes.apple.com/us/app/codea/id439571171?mt=8&uo=4", "minimumOsVersion": "7.0", "artworkUrl60": "http://a67.phobos.apple.com/us/r30/Purple/v4/d5/2c/3b/d52c3b22-291b-87fa-dd55-5e27e68434c7/AppIcon72x72_ipad.png", "averageUserRating": 4.5}