{"contentAdvisoryRating": "4+", "features": [], "languageCodesISO2A": ["EN", "DE"], "ipadScreenshotUrls": [], "releaseDate": "2011-07-06T00:29:59Z", "currency": "USD", "artistId": 370316732, "wrapperType": "software", "advisories": [], "genres": ["Navigation", "Business"], "trackId": 439589978, "description": "Car Dashboard with Real Time Fuel Cost, Weather, driving analytics, and Voice Guided Navigation. Records and Saves all trip details!\n*FEATURED  NAVIGATION APP. Drive less, drive responsibly™\n \n- Fuel Consumption Cost and driving Behavior in real-time \n- Traffic Cameras for a large number of cities world wide.\n- Mileage log (US and Metric units), driving pattern, speed alerts, full route tracking and KML export of map\n- Dropbox Syncing  \n- Complete turn by turn voice directions for driving or transit(bus, train, ferry)\n- Google Street Views - easy drag & drop Pegman pin on Map to view and explore in Google Street View.\n\nSimply start the app when you start your car. It will automatically record distance traveled, fuel expenses, trip duration and driving pattern. When you reach your destination, just press the end button. View the trip details in a log or view every day’s total on a calendar. If you forget to start your app, you can always add the trip details manually. Extra Mile features an easy-to-use mileage tracker, gas expense logger, driving habit analyzer, mileage diary for your business or personal expenses, and voice-guided navigation. \n\nExtra Mile will be with you all along your trip and even after your trip ends. \n\nDASHBOARD \n. View fuel cost, speed, distance traveled in real time. Get sound and visual alerts on your driving pattern \n. Once the trip ends, just tap on the end button to save all the details to the log. \n\nMAP \n. Voice Guided Navigation with trip recording (Mileage Log and Driving analysis) for business and personal usage. \n. Traffic Cameras\n. Single tap POI search \n. Get estimated fuel cost before you make a trip \n. Use voice guided navigation to reach your destination. Full auto rerouting and manual rerouting. \nNote: Julie's Voice is now a $1.99 in-app purchase.\n\n\nTRAFFIC CAMERAS\nView live traffic video from over 10,000 traffic cameras spanning 200+ cities. world wide. Please visit http://trafficland.com/mapnav.jsp to view cameras in your area. \nUsers can purchase 2 versions of camera feed. \n. $0.99/year - manual traffic cameras feed.\n. $1.99/year - automatically(refresh time less than 2 seconds)updating camera feed updates the images automatically.\n\nSETTINGS \n. Save home, work addresses in settings for single tap navigation back to home or work \n. Update the last fill-up price. \n\nTRIP LOG \n. View trips; manually add trips; swipe on a trip to delete it. \n. Analyze driving pattern graphs and improve your driving habits \n\nCALENDAR \n. View fuel expenses on a monthly calendar \n\nREPORTS \n. Generate and share trip log reports \n. Reports can be generated in HTML or as a spreadsheet document (MS Excel, iWorks Numbers, etc). \n. Include driving analysis as data points or graphical bar chart in the report. \n. Create a personal report having consumed fuel costs or as a business expense using the Federal(IRS) business travel rate. Preview the report before sharing the reports via email. \n\nNOTE for iPod/iPad users: If your device doesn't have a in-build GPS receiver, you would need an external GPS, similar to Pioneer's AppRadio. \n\nNOTE for Rerouting: By default the app is set to let the user know that the route has been deviated. Then the user can choose to refresh the route. For full auto rerouting, change the Dashboard->Settings->Rerouting type to Auto.\n\n\nFULL BACKGROUND process supported. Start the app and switch to other apps like Phone or Maps. Extra Mile app tracks the trip and records the trip details while running in background.\n\nDisclaimer: Continued use of GPS running in the background can dramatically decrease battery life. \n\nWeather powered by Zypr connects (http://www.zypr.net/).\n\nExtra Mile can be used as a GPS Voice Navigation app, Gas Logger, Trip Logger, Mileage Tracker, Fuel expenses, Green Mile, Vehicle Log, Live Traffic Video or Camera, fleet management, driver behavior.", "artistName": "GammaPoint, LLC", "artworkUrl512": "http://a733.phobos.apple.com/us/r30/Purple3/v4/c2/c3/64/c2c36448-343e-0230-cce7-049a9d3e8106/mzl.gpvbayfi.png", "version": "6.1.3", "primaryGenreId": 6010, "primaryGenreName": "Navigation", "fileSizeBytes": "21539602", "price": 1.99, "isGameCenterEnabled": false, "trackCensoredName": "Extra Mile - Voice Navigation with GPS Trip and Mileage Log", "genreIds": ["6010", "6000"], "trackName": "Extra Mile - Voice Navigation with GPS Trip and Mileage Log", "releaseNotes": "6.1.3 - iOS 8 fixes.\n6.1.2 - Defect fix for traffic cameras.\n6.1.1\n- Removed sharing when AppRadio connected.\n- Fixed sharing via twitter.\n-Defect fixes.\n6.1\n- iOS 7 improvements for logs, manual entries, trip details. \n6.0 \n- AppRadio iOS 7.0 update \n- iOS 7 UI improvements \n5.11 - Ready for iOS 7.0 \n5.10 - Changes for AppRadio3, Pioneer update and screen issues. \n5.9.1 - Defect fix for spreadsheets under Reports. \n5.9 - Metric units in weather for non-US users. \n5.8 - Google Street View. \n5.7 - AppRadio2 users: App ready for iPhone 5 lightning connector. \n5.6 - Map rotation based on user's direction (heading). Just tap on the location button to go from No location-> Location -> Track heading. \n5.5.1 - Reports defect related to naming of the reports. \n5.5 - Improved UI, performance improvements. \n5.4.1 - Performance improvement for location error on bad Satellite reception and improved auto trip stopping. \n5.4 - Critical update for voice instructions in iPhone 5 (armv7s). \n5.3 - Fixed critical defect for AppRadio2 users where GPS didn't update location after a long stop. \n- Fixed issue were some parts of location tracking were not registered. \n- Fixed performance issue while getting weather data. \n- Added Trip name edit while saving the trip. \n5.2 - Fixed location error problem while finding directions and getting weather if the user moves out of the map. \n5.1.1 - Fixed crash from Voice setup from Upgrade screen in iOS 6.0 \n5.1 - Updated help files & weather logo update. \n5.0 - Ready for new iPhone 5 - longer display. \n- iOS 6.0 Maps app Routing app search list update. \n- Moved to a newer weather API. This fixes the issues with weather on Dashboard \n- Help files included in the app. No need to download the files. \n\n4.8.1 - POI searches with search range option - 1 to 31 miles \n4.8 - iOS 6.0 update: Transit (Bus, Walking, Train etc) directions. \n- Added setting to reduce GPS accuracy to increase battery life. \n- Enabled launching of the app from Maps app in iOS 6.0 \n4.7.16 - Added a Settings entry for the user to show the trip cost using the Federal Mileage Reimbursement rate instead of Fuel Cost. \n4.7.15 - iOS 6.0 fix for Manual Log entry. \n4.7.14 - iOS 6.0 fix for settings. \n4.7.13 - Updates for iOS 6.0 & new Pioneer SDK for AppRadio2. \n4.7.12 - Issues in Searches under Navigation tab fixed. \n4.7.11 - Address improvement when intersections contain letter \"&\" \n4.7.10 - Changed the default setting to Manual Re-route. \n4.7.9 - Performance improvement. Faster loading of Trip details in the log and calendar tabs. \n4.7.8 - Fixed a crash when Navigation tab was used. \n4.7.7 - Updated to latest Pioneer AppRadio2 software library. \n4.7.6- Defect fixes for Costa Rica. \n4.7.4 & 4.7.5: Improvement to the music player and navigation voice control. Phone call interruption mutes the voice & alerts. \n- Online Help - FAQ & Tutorials under Settings. \nIn 4.7.3: Critical defect fix for people with large trip database. \nin 4.7.2: - Defect fix related to custom mileage & fuel price in settings. \n- Select destination address from iPhone's Contact's address book. \n-Fix for AppRadio2 users for the Facebook & Twitter bar, hiding problem \nin 4.7: - Full Auto Re routing support. \n- Improved Dashboard with driving analysis graph and local weather. \n- History of last destinations with Search. \n- Share your trip details on Facebook and Twitter. \n\nIn 4.6.1 - Auto saving of Trips. \n- Fixed a crash on Trip Detail view close. \n- Defect fix for the Upgrade Screen \n- iPhone sleep disable in app settings. \n- Improved direction routes to POIs, like Airports. \n\nin 4.6: - Traffic cameras for a large # of cities world wide. App allows to view the cameras for 5 times for free. After that users need to buy yearly subscription. \n- Reports: removal of currency & distance symbols from data entries. \n- Improved saving of trips.", "sellerUrl": "http://www.gamma-point.com", "screenshotUrls": ["http://a1.mzstatic.com/us/r30/Purple6/v4/ae/a8/5a/aea85a60-8b1a-8947-3c6f-d193e88f1dcc/screen1136x1136.jpeg", "http://a5.mzstatic.com/us/r30/Purple/v4/d6/6b/b4/d66bb4ae-db74-4901-e2c0-3f86868978d5/screen1136x1136.jpeg", "http://a4.mzstatic.com/us/r30/Purple4/v4/24/7b/3c/247b3c04-be2a-39d4-84da-fa2eefe789f8/screen1136x1136.jpeg", "http://a2.mzstatic.com/us/r30/Purple4/v4/04/b2/6a/04b26a40-e05c-1fab-553f-830cb10ef52c/screen1136x1136.jpeg", "http://a2.mzstatic.com/us/r30/Purple4/v4/e6/67/29/e667297c-e693-2ae7-b1c0-337f17f0274c/screen1136x1136.jpeg"], "userRatingCount": 101, "trackContentRating": "4+", "formattedPrice": "$1.99", "artistViewUrl": "https://itunes.apple.com/us/artist/gammapoint-llc/id370316732?uo=4", "kind": "software", "sellerName": "GammaPoint LLC", "supportedDevices": ["iPadThirdGen", "iPhone5s", "iPadMini", "iPad23G", "iPhone5c", "iPadFourthGen4G", "iPhone5", "iPadFourthGen", "iPadThirdGen4G", "iPad2Wifi", "iPhone4S", "iPodTouchFifthGen", "iPodTouchourthGen", "iPhone4", "iPhone-3GS", "iPadMini4G"], "artworkUrl100": "http://a733.phobos.apple.com/us/r30/Purple3/v4/c2/c3/64/c2c36448-343e-0230-cce7-049a9d3e8106/mzl.gpvbayfi.png", "bundleId": "com.gamma-point.taximeter", "trackViewUrl": "https://itunes.apple.com/us/app/extra-mile-voice-navigation/id439589978?mt=8&uo=4", "minimumOsVersion": "6.0", "artworkUrl60": "http://a1749.phobos.apple.com/us/r30/Purple3/v4/ce/3d/7f/ce3d7f5c-5fa4-aa65-07b9-6ef6e2882809/Icon.png", "averageUserRating": 3.5}