{"contentAdvisoryRating": "4+", "features": ["newsstand"], "languageCodesISO2A": ["EN"], "ipadScreenshotUrls": ["http://a3.mzstatic.com/us/r30/Purple2/v4/c9/92/a4/c992a4f6-a124-1d74-b7a4-f7ab50a1f286/screen480x480.jpeg", "http://a4.mzstatic.com/us/r30/Purple6/v4/da/46/3c/da463c6c-fc7b-33fa-73a0-495f94ca37c1/screen480x480.jpeg", "http://a4.mzstatic.com/us/r30/Purple4/v4/3c/55/aa/3c55aae6-3971-4ae8-3c43-c304dbb7ff9b/screen480x480.jpeg", "http://a1.mzstatic.com/us/r30/Purple4/v4/69/61/55/69615503-c745-a79a-96b8-83bcb6ea9006/screen480x480.jpeg", "http://a3.mzstatic.com/us/r30/Purple/v4/e2/be/22/e2be22cc-46f2-1350-e1cc-392f53a9ae52/screen480x480.jpeg"], "releaseDate": "2011-10-03T10:52:55Z", "currency": "USD", "artistId": 358769478, "userRatingCountForCurrentVersion": 30, "wrapperType": "software", "advisories": [], "genres": ["News", "Newsstand", "News & Politics"], "trackId": 444519360, "description": "• Our award winning app is free to download. \n• Free Editor’s picks. Registered readers can read or listen to a selection of must-read articles chosen each week by John Micklethwait. \n• Subscribers enjoy full access to each week’s issue. \n\nOur award winning app allows registered readers to read a selection of free content each week, while subscribers with digital access can enjoy the full issue every Thursday from 4pm EST/ 9pm GMT. \n\nWe have identified a bug which causes the app to crash periodically when trying to open the app. We have been working on a solution for this issue which will be released as soon as possible.\n \nWe apologise for the inconvenience this has caused.\n\nNOW ON NEWSSTAND \nThe Economist app now appears on your device in Newsstand. Please note that you will not find The Economist app on your device home screen. \nWhen you allow Push Notifications from The Economist app for iPad, each new issue will be downloaded to your device automatically. \n\nCertain users may experience functionality issues with the app. Please be advised that deleting and reinstalling the app whilst connected to a strong internet connection will resolve this issue. \nIf functionality of the app is not restored following these instructions, please do not hesitate to get in touch with our customer service desk at customerservices@subscriptions.economist.com. \n\nFEATURES \n-Read or listen to each week’s full issue from Thursday 4pm EST/ 9pm GMT. \n-Pre-download The Economist and enjoy offline reading anytime, anywhere. \n-Seamlessly move between our reader and audio features. \n-Store and access back issues. \n-If you are a registered reader, you may purchase single issues using In App Purchase. \n-Subscribe within the app and get full access to Economist.com and The Economist apps. \n\nSUBSCRIPTION OPTIONS \n-Subscribe quarterly (12 issues) for GBP £39.99 or annually (51 issues) for GBP £159.99 or buy a single issue for GBP £4.99. If available, you will be charged in your local currency at the prevailing exchange rate as defined by iTunes. \n-Payment will be charged to your iTunes account at confirmation of purchase. \n-No cancellation of the current subscription is allowed during the active subscription period – \n-Subscriptions automatically renew unless auto-renew is turned off at least 24-hours before the end of the current period. \n-Account will be charged for renewal within 24-hours prior to the end of the current period at the price of the original subscription. \n-You can manage auto-renew of your subscription in your iTunes account settings. \n-The app may offer a subscription with a free trial period. At the end of the trial period, full price of the subscription will be charged thereafter. \n-You may cancel a subscription during its free trial period via the subscription setting through your iTunes account. This must be done 24 hours before the end of the subscription period to avoid being charged. Please visit http://support.apple.com/kb/ht4098 for more information. \n-You may turn off the auto-renewal of your subscription via your Account Settings. However, you are not able to cancel the current subscription during its active period \n-Full terms of use can be found at http://www.economist.com/legal/terms-of-use \n\nABOUT THE ECONOMIST \nThe Economist is a weekly international news and business publication offering independent and clear reporting, commentary and analysis on world current affairs; business, finance, science and technology, culture, society, media and the arts. \n\nALSO AVAILABLE ON iPhone \nThe Economist is also available on iPhone. Simply search for The Economist in the App Store for iPhone.", "artistName": "The Economist", "artworkUrl512": "http://a691.phobos.apple.com/us/r30/Purple3/v4/16/44/4a/16444a88-ddb8-2e2d-61a3-c9728ef10246/pr_source.jpg?downloadKey=1417125085_fa85f38f679f026b3f81ebb392a2a402", "version": "2.13.2", "primaryGenreId": 6009, "primaryGenreName": "News", "fileSizeBytes": "10505685", "price": 0.0, "isGameCenterEnabled": false, "trackCensoredName": "The Economist for iPad", "genreIds": ["6009", "6021", "13001"], "trackName": "The Economist for iPad", "releaseNotes": "Dear Reader,\n\nThis release resolves an issue causing the app to crash for some readers on start up.\n\nSincerely,\n\nThe Digital Editions team.", "sellerUrl": "http://www.economist.com/digital/apps", "screenshotUrls": [], "userRatingCount": 2439, "trackContentRating": "4+", "formattedPrice": "Free", "artistViewUrl": "https://itunes.apple.com/us/artist/the-economist/id358769478?uo=4", "kind": "software", "averageUserRatingForCurrentVersion": 2.0, "sellerName": "The Economist Newspaper Group Inc.", "supportedDevices": ["iPadThirdGen", "iPad2Wifi", "iPadMini", "iPadMini4G", "iPad23G", "iPadThirdGen4G", "iPadFourthGen4G", "iPad3G", "iPadFourthGen", "iPadWifi"], "artworkUrl100": "http://a691.phobos.apple.com/us/r30/Purple3/v4/16/44/4a/16444a88-ddb8-2e2d-61a3-c9728ef10246/pr_source.jpg?downloadKey=1417125085_fa85f38f679f026b3f81ebb392a2a402", "bundleId": "com.economist.ipad.na", "trackViewUrl": "https://itunes.apple.com/us/app/the-economist-for-ipad/id444519360?mt=8&uo=4", "minimumOsVersion": "5.1", "artworkUrl60": "http://a1209.phobos.apple.com/us/r30/Purple3/v4/d2/6c/8f/d26c8fd9-09b5-1eb1-ed6b-5fdbf9b7c75f/Icon-Ipad.png", "averageUserRating": 3.0}