{"contentAdvisoryRating": "4+", "features": ["gameCenter"], "languageCodesISO2A": ["EN", "ZH", "ZH"], "ipadScreenshotUrls": ["http://a5.mzstatic.com/us/r30/Purple/v4/63/4f/97/634f9748-6c78-b576-ce42-2c86f783914f/screen480x480.jpeg", "http://a1.mzstatic.com/us/r30/Purple4/v4/d6/04/d9/d604d975-447b-aa67-5729-886d51f00ee1/screen480x480.jpeg", "http://a3.mzstatic.com/us/r30/Purple4/v4/fe/98/cd/fe98cd59-a0bb-d0c5-5092-bb485d9e8304/screen480x480.jpeg", "http://a4.mzstatic.com/us/r30/Purple6/v4/a5/55/ce/a555ce9b-5bd2-4a83-4f72-b7285626fbef/screen480x480.jpeg", "http://a2.mzstatic.com/us/r30/Purple4/v4/00/5f/44/005f443d-8c2b-9b7f-1806-dac3919ba8f2/screen480x480.jpeg"], "releaseDate": "2011-07-08T20:37:24Z", "currency": "USD", "artistId": 445330264, "userRatingCountForCurrentVersion": 23, "wrapperType": "software", "advisories": [], "genres": ["Games", "Entertainment", "Arcade", "Trivia"], "trackId": 445330261, "description": "Confirming by billions of users. The finest fishing game in the app store is in front of you now! Hunting in the vast sea, choosing your favorite skin, listening to the waves of gold coins, and enjoying the pleasure of harvest! Double the satisfaction in both visual and auditory feast! Open the hidden chest to complete the collection of the delicate dolls, detailed and intimate design will instantly capture your heart! What are you waiting for? Hurry up and join us~! \n\nDear Hunters, iPhone and iPad version are both ready for download! Ergonomics game play design, combat with your friend on Wi-Fi and Bluetooth, together with top quality graphic will bond to bring you an awesome gaming experience! \n\n【No. 1 Strategy Game in 16 countries】\n【Top 10 Strategy Game in 66 countries】 \n【Top 3 iPad App in China after 5 Days】\n\nAll of these are possible because of your kind support!\nWe will repay your support by keep on making “Fish Hunter” even better.\n\nVersion 4.0 takes you to explore the deep secrets of Atlantis\n\n【New adventure function】\nAs long as you dare to take risks, we dare to send gold! Each level has a gold challenge both hands, got more surprises Samsung also get rewards!\nPlayers use a limited number of shells for exploring the mysterious Atlantis, the player will encounter during explore a variety of challenges, such as ghost fish, such as laser wall and a large whirlpool. In the meantime players can also use the new types of props to increase their ability to value. Finally, given consumed shells, they will get the appropriate score, the player's score will appear in the positioning rankings. In pass through mode to get more points, the more abundant the final reward!\n\n【Times Area】\nIn normal mode, the player reaches 1000,2000,5000 coins will unlock after different times zones. At times the area under the hunting fish will challenge your digital limits！\n\n【Trim package】\nAdjust the trim package location and the purchase. Support coins to buy!\n\n 【New menu interface】\nThe new steam punk style login screen, let us rock up in the underwater world!\n\n Please drop your comments, because they drive us further. We will make a note each one of them.\n\n\nTouch your iPad  to indicate the direction of shooting, your fish cannon will fire net to catch fish on its way. You will have the chance to catch all the fish within the diameter and you will be rewarded with coins. Each net you fire will cost you corresponding coins, you can power up your cannon up to level 7, which to use, you decide. \n\nThere are Treasure Chests for you to discover. They are carried by those shinny fish, catch them to get more coins and even dolls! You will be able to check your game progress by watching your coins and dolls collected dropping from the top. Simply press the red button on the bottom left of the screen, and you will be surprised! Well, only if you have done well enough though.\n\nWe hope you could enjoy our game.\n\nGame features:\n• Amazingly realistic arcade game playing experience \n• Exotic 3-D graphics\n• Impressive Treasure Chest system\n• Over 20 types of Fish and Prizes\n• Awesome coin return effect\n• Lot of collectable prizes \n• 70 Game Centre Achievements and worldwide Leader board\n• Share with friends on Facebook and Twitter\n• Combat with your friend on Wi-Fi and Bluetooth, the winner will acquire the decoration\n• You could show your combat gains to everyone\n\nPlease quit “fish hunter” completely before download.", "artistName": "BLINGSTORM ENTERTAINMENT LIMITED", "artworkUrl512": "http://a976.phobos.apple.com/us/r30/Purple4/v4/6a/22/06/6a2206b3-b93b-a70a-2435-6bb2c542a115/mzl.qnpvcwps.png", "version": "4.2", "primaryGenreId": 6014, "primaryGenreName": "Games", "fileSizeBytes": "57014157", "price": 0.0, "isGameCenterEnabled": true, "trackCensoredName": "Fish Hunter HD - All Blue Sea", "genreIds": ["6014", "6016", "7003", "7018"], "trackName": "Fish Hunter HD - All Blue Sea", "releaseNotes": "-Rank list of adventure mode. Now you can see score & ladder in adventure mode.\n-New collection UI. The new UI has better experience for checking up your collections.\n-Dolls fill up. Better experience for unlocking items with dolls.\n-Store optimization. Better shopping experience.", "screenshotUrls": [], "userRatingCount": 1156, "trackContentRating": "4+", "formattedPrice": "Free", "artistViewUrl": "https://itunes.apple.com/us/artist/blingstorm-entertainment-limited/id445330264?uo=4", "kind": "software", "averageUserRatingForCurrentVersion": 4.5, "sellerName": "BLINGSTORM ENTERTAINMENT LIMITED", "supportedDevices": ["iPad23G", "iPadFourthGen", "iPadWifi", "iPad3G", "iPadThirdGen4G", "iPadFourthGen4G", "iPadMini4G", "iPadMini", "iPad2Wifi", "iPadThirdGen"], "artworkUrl100": "http://a976.phobos.apple.com/us/r30/Purple4/v4/6a/22/06/6a2206b3-b93b-a70a-2435-6bb2c542a115/mzl.qnpvcwps.png", "bundleId": "com.blingstorm.fishhunter", "trackViewUrl": "https://itunes.apple.com/us/app/fish-hunter-hd-all-blue-sea/id445330261?mt=8&uo=4", "minimumOsVersion": "4.3", "artworkUrl60": "http://a1062.phobos.apple.com/us/r30/Purple6/v4/49/b6/dd/49b6dda4-6449-a743-fe15-3d3c09e13724/Icon-72.png", "averageUserRating": 4.5}