{"contentAdvisoryRating": "4+", "features": [], "languageCodesISO2A": ["EN"], "ipadScreenshotUrls": [], "releaseDate": "2011-07-21T21:09:29Z", "currency": "USD", "artistId": 445868565, "userRatingCountForCurrentVersion": 43, "wrapperType": "software", "advisories": [], "genres": ["Travel", "Navigation"], "trackId": 449060020, "description": "Planning ahead or plan as you go - get directions, discounts and information for RV parks across North America with the new Good Sam Camping app.\n\nThe new Good Sam Camping app provides information, including the exclusive Good Sam 10/10*/10 Triple Rating for more than 14,500 RV parks and campgrounds listed in the comprehensive Good Sam RV Travel Guide & Campground Directory, North America’s top-selling campground directory printed annually. Easy-to-use, the app is a perfect companion for your next RV trip.\n\nAll RV parks and campgrounds listed in the Good Sam RV Travel Guide are included in the app, including 2,200+ Good Sam parks with 10% discount for Good Sam members. Users can search by city and state or province and filter campground searches based on hookups, swimming pools, pet restrictions and seasonality.\n\nGood Sam RV park and campground listings are identified by the Good Sam logo, and have expanded information such as RV hookup details, tenting and pull-through availability, slide-out space and pet allowances and restrictions, and if there is WiFi access – essential when traveling.\n\nThe app is the product of the Good Sam Directory’s 38 RVing consultant teams, who visit, evaluate and inspect campgrounds every year, so that you’ll always have the most reliable and up-to-date information available in the palm of your hand. As a bonus, the app includes photos of some parks, along with links to their websites. All listings include click-to-call functionality, making contacting a park easy and quick.\n\nHere are some of the great features you’ll find in the Good Sam Camping app: \n- Robust search capabilities by city, state or province of your choice \n- Ability to search RV parks located between 15 and 200 miles from your current location \n- Detailed results of over 14,500 campgrounds and RV parks across North America, reflected on a map view and in listed results \n- Ability to filter 2,200-plus Good Sam Parks that offer a 10% discount to Good Sam Club members. \n- Ability to sort and filter results to best suit your needs \n- Good Sam exclusive 10/10*/10 triple rated and inspected privately owned parks \n- Good Sam Member 10% discount locations that are easily spotted by the red Good Sam logo \n- Thousands of public parks, including national parks, state parks and U.S. Army Corps of Engineer parks \n- Details about amenities, services and recreation at parks \n\nWhether you're taking your first RV trip with the family or have miles of RV travel under your belt, with the Good Sam Camping app you'll have the most trusted and reliable travel information available! \n\nAbout the Good Sam RV Travel Guide & Campground Directory Relying on a half-century of publishing expertise, the Good Sam RV Travel Guide & Campground Directory gives travelers all the information they need to plan an RV trip in North America. The top-selling, comprehensive volume contains detailed information on more than 14,500 RV parks across the United States, Canada or Mexico. Included are 2,200-plus Good Sam Parks that offer a 10% discount to Good Sam Club members. \n\nEach private campground included in the app is personally inspected and rated by Good Sam’s seasoned consultant teams, and each listing includes Good Sam’s exclusive triple rating, which grades completeness of facilities, cleanliness of restrooms, and visual appeal and environmental quality. \n\nTo learn more, visit GoodSamCamping.com, join the Good Sam community on Facebook or call toll free 877-209-6655.", "artistName": "Consent Media & Waterfield Technologies", "artworkUrl512": "http://a685.phobos.apple.com/us/r30/Purple6/v4/c6/7a/12/c67a12d6-7be2-ec2c-3a7c-59e7ae625681/mzl.lxzrzawf.png", "version": "2.5", "primaryGenreId": 6003, "primaryGenreName": "Travel", "fileSizeBytes": "8707271", "price": 0.0, "isGameCenterEnabled": false, "trackCensoredName": "Good Sam Camping", "genreIds": ["6003", "6010"], "trackName": "Good Sam Camping", "releaseNotes": "> New Good Sam RV parks and campgrounds added\n> Bug fixes that resolve crashing issues\n> Improved radius searches using your current location\n> Updated Good Sam Ratings", "sellerUrl": "http://blog.goodsamcamping.com/2013/07/good-sam-app", "screenshotUrls": ["http://a1.mzstatic.com/us/r30/Purple6/v4/cb/27/5d/cb275d71-300a-fe6f-63b3-f55bd960a588/screen1136x1136.jpeg", "http://a3.mzstatic.com/us/r30/Purple/v4/ec/f0/53/ecf05337-49f2-5865-2463-9117e4cd7068/screen1136x1136.jpeg", "http://a4.mzstatic.com/us/r30/Purple4/v4/8f/73/d9/8f73d9b2-955f-f0e3-2f55-a573b4e966b5/screen1136x1136.jpeg", "http://a1.mzstatic.com/us/r30/Purple4/v4/51/bc/df/51bcdf1b-df00-ce2b-911c-b21a7c0d3da4/screen1136x1136.jpeg", "http://a4.mzstatic.com/us/r30/Purple/v4/2e/9f/36/2e9f36e0-13ed-f1fb-1bcc-eb2a563a1eb6/screen1136x1136.jpeg"], "userRatingCount": 555, "trackContentRating": "4+", "formattedPrice": "Free", "artistViewUrl": "https://itunes.apple.com/us/artist/consent-media-waterfield-technologies/id445868565?uo=4", "kind": "software", "averageUserRatingForCurrentVersion": 1.5, "sellerName": "Waterfield Technologies", "supportedDevices": ["iPhone-3GS", "iPadMini", "iPadFourthGen", "iPhone4", "iPhone4S", "iPad2Wifi", "iPadMini4G", "iPadThirdGen", "iPhone5s", "iPodTouchFifthGen", "iPad23G", "iPhone5c", "iPodTouchourthGen", "iPhone5", "iPadThirdGen4G", "iPadFourthGen4G"], "artworkUrl100": "http://a685.phobos.apple.com/us/r30/Purple6/v4/c6/7a/12/c67a12d6-7be2-ec2c-3a7c-59e7ae625681/mzl.lxzrzawf.png", "bundleId": "com.waterfieldtechnologies.goodsam", "trackViewUrl": "https://itunes.apple.com/us/app/good-sam-camping/id449060020?mt=8&uo=4", "minimumOsVersion": "6.0", "artworkUrl60": "http://a1415.phobos.apple.com/us/r30/Purple4/v4/32/07/6a/32076a28-3472-4354-66e2-ce9aa3385871/Icon.png", "averageUserRating": 4.0}