{"contentAdvisoryRating": "4+", "features": [], "languageCodesISO2A": ["EN", "DE", "PT"], "ipadScreenshotUrls": [], "releaseDate": "2011-12-16T21:49:37Z", "currency": "USD", "artistId": 403758879, "userRatingCountForCurrentVersion": 68, "wrapperType": "software", "advisories": [], "genres": ["Books", "Reference"], "trackId": 449147540, "description": "** Introductory price of $2.99 for a limited time only **\nFor the avid Bible reader, Glo Bible Reader+ includes NIV, NKJV, ESV, the Message and KJV - all the translations currently available for the Glo Bible!\n\nGlo brings the text of Scripture to life through HD videos, high-res images, articles, 360-degree virtual tours, and much more. Includes 4 lenses: Bible, Atlas, Media and the new socially-enabled \"Me\" Lens! \n\n** Existing Bible360 & Glo users: Get this app today, and log in using your existing account to access your translations and media. ** \n\nTRUSTED TRANSLATIONS \nGet all the translations currently available in Glo at a great low price including NIV, NKJV, ESV, the Message and KJV.\n\nEXPLORE THE WORLD OF THE BIBLE \nIn the zoomable Bible lens it takes just taps 2 taps to access any chapter of the Bible. Each verse is linked to resources and media. \n\nThe Atlas lens has hundreds of biblical locations linked directly to scripture and media to explore the world of the Bible! Your free download of Glo lite includes 13 maps of key Bible stories for free, with even more in Glo Premium! \n\nThe socially-enabled \"Me\" Lens allows you to see all your notes and reading plans in one place. Plus, see what verses your Facebook friends have posted in the \"My Friends\" feed. \n\nRICH MEDIA, LINKED TO EACH VERSE \nIn Glo, each verse is linked to 360 virtual tours, artwork, high-res photos, articles, HD videos and much more! Your free download includes the Glo lite media pack with full-resolution media throughout the Bible for FREE! \n\nMULTI-DEVICE \nGlo synchronizes FREE on iPad, iPhone, Mac and PC. Your media, notes, highlights, tools, translations, and reading plans synchronize across all your connected devices. Take a note on the go, and it will appear at home on your computer! \n\nTOOLS FOR STUDY & SHARING \nGlo has great free reading plans to stay engaged with God's word. Choose from over 25 plans like the \"Essential 100 passages\", \"New Testament in a Year\", \"Wisdom\" – or create your own on your computer and sync with your mobile device! You can login to your YouVersion account to see your bookmarks, public & private notes, as well as see or post community notes! Glo is socially enabled - you can post any verse, note, or media to Facebook, Twitter, the Glo Facebook page or send by email! \n\nOVER 1.5 MILLION DOWNLOADS \nMillions worldwide have downloaded Glo for Mac, PC, iPad and iPhone. See what the excitement is about! Download now!\n\nSO MUCH MORE TO EXPLORE \nUpgrade to Glo Premium in-app for access to 3500+ media elements linked to the entire Bible, NIV study notes, articles, tools and more! A Premium purchase gives you access to Premium content on your Mac, PC, iPad and iPhone. \n\n- - - - - \n\nGlo in the Press \n\nAppAdvice top-rated \"Essential App\" - AppAdvice.com \n\"Coolest Book App for Fall\" - USA Today \n\"Glo…is cool with a capital C.\" - Newsweek \n\"The ability to have context and visualization of concepts at your fingertips is something that nearly any textbook could benefit from.\" - Mashable \n\"Glo Bible spreads word (and HD video) of God to digital generation\" - The Guardian \n\"[Glo is] bring[ing] religion to digital generation.” - Telegraph, UK \n\"just about anything that you would need from research tools to audio-visual aids is right at your fingertip when you use Glo.\" - Max Lucado \n\"Glo digital Bible designed to reach a younger generation\" - Washington Post \n\nGlo has also been featured in the Washington Post, Miami Herald, ABCNews Now, Orlando Sentinel, Charisma magazine, Denver Post, and more! \n\n- - - - - - \n\nAwards \n\n** Winner, Bible of the Year, ECPA, 2010 ** \n** Winner, Software of the year, Washington Times, 2011 ** \n** Winner, Media of the Year, Christian Resource Awards, 2010 ** \n\n- - - - - \n\nVisit the places you've read about, Explore the World of the Bible. Experience the Bible like never before with Glo!", "artistName": "Information Humanities Inc.", "artworkUrl512": "http://a888.phobos.apple.com/us/r30/Purple2/v4/60/9c/3d/609c3dcb-6599-1fd1-7b2c-466257f01d21/mzl.qapbmbwl.png", "version": "1.4.6", "primaryGenreId": 6018, "primaryGenreName": "Book", "fileSizeBytes": "107897163", "price": 2.99, "isGameCenterEnabled": false, "trackCensoredName": "Bible Reader ＋", "genreIds": ["6018", "6006"], "trackName": "Bible Reader ＋", "releaseNotes": "Bible360 is now Glo Bible Reader!\nThis app now joins the over 1 million Glo Bible users worldwide!\n\nAs a thank you for being a loyal user, you now have access to all Bible translations - NKJV, NIV, ESV, and the Message! They are available in the Bible page translation pulldown.\n\n\nDon't worry, all your existing notes and purchases are still here, and your Bible will work just like it did before. Questions about the transition? Contact us. http://globible.com/contact", "sellerUrl": "http://globible.com", "screenshotUrls": ["http://a1.mzstatic.com/us/r30/Purple2/v4/6e/56/bd/6e56bdd4-ddeb-c125-b53e-1dca4e6e6673/screen1136x1136.jpeg", "http://a2.mzstatic.com/us/r30/Purple2/v4/c7/7f/73/c77f73f6-63db-e8fa-5134-733b67bd6af1/screen1136x1136.jpeg", "http://a1.mzstatic.com/us/r30/Purple2/v4/3d/98/2d/3d982dc8-acfc-9ef9-6e4d-2516ead9121c/screen1136x1136.jpeg", "http://a2.mzstatic.com/us/r30/Purple2/v4/47/10/43/4710437a-a67a-3d65-c27c-fb54816d1f0a/screen1136x1136.jpeg", "http://a4.mzstatic.com/us/r30/Purple/v4/c3/51/76/c3517610-6237-4ffb-4175-156dd814227e/screen1136x1136.jpeg"], "userRatingCount": 1494, "trackContentRating": "4+", "formattedPrice": "$2.99", "artistViewUrl": "https://itunes.apple.com/us/artist/information-humanities-inc./id403758879?uo=4", "kind": "software", "averageUserRatingForCurrentVersion": 4.5, "sellerName": "Information Humanities Inc.", "supportedDevices": ["iPhone-3GS", "iPhone5c", "iPhone4S", "iPodTouchourthGen", "iPadMini4G", "iPodTouchThirdGen", "iPadFourthGen", "iPad2Wifi", "iPadMini", "iPadThirdGen", "iPad23G", "iPad3G", "iPhone4", "iPodTouchFifthGen", "iPadFourthGen4G", "iPhone5", "iPadThirdGen4G", "iPhone5s", "iPadWifi"], "artworkUrl100": "http://a888.phobos.apple.com/us/r30/Purple2/v4/60/9c/3d/609c3dcb-6599-1fd1-7b2c-466257f01d21/mzl.qapbmbwl.png", "bundleId": "com.immersiondigital.Bible360iPhone", "trackViewUrl": "https://itunes.apple.com/us/app/bible-reader-+/id449147540?mt=8&uo=4", "minimumOsVersion": "4.3", "artworkUrl60": "http://a1953.phobos.apple.com/us/r30/Purple/v4/c4/a6/a7/c4a6a738-09e9-72d1-18fe-fed8b951528f/Glo_Bible.png", "averageUserRating": 5.0}