{"contentAdvisoryRating": "12+", "features": [], "languageCodesISO2A": ["EN"], "ipadScreenshotUrls": [], "releaseDate": "2012-03-04T15:47:41Z", "currency": "USD", "artistId": 457297760, "userRatingCountForCurrentVersion": 6, "wrapperType": "software", "advisories": ["Infrequent/Mild Alcohol, Tobacco, or Drug Use or References"], "genres": ["Lifestyle", "Social Networking"], "trackId": 457297757, "description": "Discover amazing events, activities, and places in your city with Sosh's curated, personalized recommendations.\nONLY AVAILABLE IN SF, NYC, CHICAGO, DC, AND SEATTLE WITH MORE CITIES COMING SOON.\n\nSosh is changing the way people find fun things to do, curating only the best of your city and tailoring recommendations according to your interests. It's not another directory, review site, or daily deals service - it's about sharing incredible experiences with the people you love. Whether you're planning a date, hanging out with friends, or organizing an adventure with the family, Sosh has you covered. It's beautiful, intuitive, and completely free to join. Because life's too short to be bored. \n\nWHAT PEOPLE ARE SAYING \n\n• \"Sosh is beautiful, easy to use and comprehensive in the possibilities it presents for exploration\" - The NY Times\n• \"We're obsessed with Sosh...part personal concierge, part cool BFF.\" - InStyle Magazine\n• \"If it feels like new life-curator, Sosh, is inside your head, it's because, well, it kind of is.\" - Refinery29 \n• \"Sosh provides a personalized collection of interesting and unique things for people to do\" - Forbes \n• \"Sosh makes 'social' actually social by giving you things to do in your city\" - TechCrunch \n\nUSE SOSH TO FIND \n\n• Pop-up restaurants, food trucks, and supperclubs \n• Concerts, live music, opera, and jazz shows \n• The best local bars, artisanal cocktails, lounges, beer gardens, and speakeasies \n• New restaurants, secret dishes, and off-the-menu cocktails \n• Outdoor activities, fitness classes, and weekend escapes \n• Interesting classes and hands-on workshops \n• Art exhibits, gallery openings, plays, musicals, ballet, and modern dance performances \n• Festivals, flea markets, and sample sales \n• And much more  \n\nFEATURES \n\n• Personal, smart recommendations: Discover amazing things to do based on your interests and what your friends are up to, as well as real-world signals from the time of day to the weather outside. \n• Search: Have something specific in mind? Find recommendations by searching for any category, neighborhood, or venue. \n• The Weekender: Get inspired with the best picks for the upcoming weekend.\n• Bookmarks & reminders: Never forget the places, dishes, or cocktails you've been meaning to try. \n• Beautiful design: Gorgeous photos and intuitive layout so you can browse thousands of activities with ease. \n• Insider tips: Reservations, directions, and pro tips all in one place. By the time you walk in, you'll know exactly what to order. \n• Follow and share with friends: See what your friends are planning or what they recommend doing. Share activities with friends using Facebook, Twitter, or email with ease to start making plans for tonight! \n• Trusted reviews: In-depth descriptions from credible sources like Thrillist, Eater, UrbanDaddy, Zagat, Refinery29, TimeOut, Grubstreet, New York Magazine, 7x7, Chicago Magazine, The Seattle Times, and The Washingtonian, and more. \n• Available in San Francisco, New York, Chicago, Washington DC, & Seattle only. More cities coming soon! \n• Connect with Facebook to create your account on Sosh.", "artistName": "Offline Labs, Inc.", "artworkUrl512": "http://a757.phobos.apple.com/us/r30/Purple1/v4/d2/e4/fc/d2e4fcc2-a2f9-a210-a7e6-f73dfbd319e5/mzl.glfliuei.png", "version": "4.7", "primaryGenreId": 6012, "primaryGenreName": "Lifestyle", "fileSizeBytes": "23285537", "price": 0.0, "isGameCenterEnabled": false, "trackCensoredName": "Sosh - City Guide", "genreIds": ["6012", "6005"], "trackName": "Sosh - City Guide", "releaseNotes": "Version 4.7\n\n• San Francisco: We've integrated with Uber! You can now order a car to any Concierge experience from within the Sosh app.\n• San Francisco: Explore new lists of our favorite things to eat and drink in Concierge.\n• Lots of bug fixes!", "sellerUrl": "http://sosh.com/", "screenshotUrls": ["http://a3.mzstatic.com/us/r30/Purple3/v4/82/24/61/8224619b-e14b-708f-37e2-dd0c4c1df183/screen1136x1136.jpeg", "http://a1.mzstatic.com/us/r30/Purple5/v4/4e/97/cf/4e97cf65-6094-19a5-7c07-a6be3aa95cd2/screen1136x1136.jpeg", "http://a4.mzstatic.com/us/r30/Purple5/v4/24/17/ab/2417abb9-5e43-b5ff-8790-da73189ef97d/screen1136x1136.jpeg", "http://a4.mzstatic.com/us/r30/Purple1/v4/ef/34/e9/ef34e9d5-2c5d-6006-16c2-7b488ace9b52/screen1136x1136.jpeg"], "userRatingCount": 739, "trackContentRating": "12+", "formattedPrice": "Free", "artistViewUrl": "https://itunes.apple.com/us/artist/offline-labs-inc./id457297760?uo=4", "kind": "software", "averageUserRatingForCurrentVersion": 4.5, "sellerName": "Offline Labs Inc.", "supportedDevices": ["iPadFourthGen4G", "iPadThirdGen", "iPadFourthGen", "iPadThirdGen4G", "iPhone4", "iPad2Wifi", "iPhone4S", "iPodTouchFifthGen", "iPhone5s", "iPadMini4G", "iPad23G", "iPhone5", "iPadMini", "iPhone5c"], "artworkUrl100": "http://a757.phobos.apple.com/us/r30/Purple1/v4/d2/e4/fc/d2e4fcc2-a2f9-a210-a7e6-f73dfbd319e5/mzl.glfliuei.png", "bundleId": "com.sosh.turtle", "trackViewUrl": "https://itunes.apple.com/us/app/sosh-city-guide/id457297757?mt=8&uo=4", "minimumOsVersion": "7.0", "artworkUrl60": "http://a723.phobos.apple.com/us/r30/Purple1/v4/1a/61/01/1a6101b9-1daa-d8ea-dbf4-f0b873129efd/AppIcon60x60_U00402x.png", "averageUserRating": 4.0}