{"contentAdvisoryRating": "4+", "features": ["iosUniversal"], "languageCodesISO2A": ["EN"], "ipadScreenshotUrls": ["http://a1.mzstatic.com/us/r30/Purple/v4/2b/71/96/2b7196c0-da79-6715-ec65-5f3c6428ab33/screen480x480.jpeg", "http://a4.mzstatic.com/us/r30/Purple/v4/58/e6/65/58e665d2-6490-35d0-04b9-ad828712a626/screen480x480.jpeg", "http://a3.mzstatic.com/us/r30/Purple/v4/ac/6c/d1/ac6cd10d-35e6-7b73-ddd7-b3d0ae7b0138/screen480x480.jpeg"], "releaseDate": "2011-11-10T23:49:58Z", "currency": "USD", "artistId": 317856073, "wrapperType": "software", "advisories": [], "genres": ["Photo & Video", "Utilities"], "trackId": 458984421, "description": "★ Featured in What's Hot ★\n\n\"Love the fact that it’s such an easy app to use and to learn. It’s a simple click process; select the frame, add the photos and then choose a border, how much easier can it be? ...I am addicted to this app.\" - MonsterFreeApps.com\n\nPicture Frames Free lets you get photographically creative. Combine multiple photos into beautiful frames then share with others. This app is really easy to use and doesn’t cost you a thing. \n\nYou have those wonderful wedding and honeymoon pictures. There are so many great ones! You’ve been planning to send them to all your friends and relatives one at a time. Yawn. Boring! \n\nWhy not arrange those special snapshots into attractive groups that everyone will cherish? Maybe put the happy bride and groom at the top, a photo of that beautiful resort where you spent your first night as man and wife beneath it, with a shot of the two of you on the beach beside that. It’s really easy, go ahead and try it.\n\nOkay, that looks nice but let’s jazz it up some more. Select a frame in the color you want, maybe one of your wedding party colors. How does that look? Mmm, not quite there, thicken the border a little. Yes, that’s perfect! If you want, you can zoom in a bit to make sure people can see those newlywed smiles. Now, that is a great presentation of an important event in your life and it took hardly any time at all.\n\nPicture Frames Free makes it super easy to combine multiple photos into frames to share your story with friends and family. There are tons of adjustable frames and a color palette to choose from, so there’s something for everybody and every occasion.\n\nSimply take photos or select existing ones from your camera roll. Arrange them the way you like, zoom, pan, make any adjustments then add any frame in your favorite color. Like we said, there is lots of variety, so get creative and put your personal touches to your photo groups. Make your borders thin, thick or in between, whatever spices up your pictures and makes them pop.\n\nYour Picture Frames Free does all the work in a lower resolution, so you’ll have faster processing and online uploading. When you print the finished images out though, you get high resolution for crisp clear memories.\n\nWhen you’ve finished creating your framed pictures, show them off to others. The application lets you quickly and easily share them on Facebook, Twitter or our public user gallery. The whole world can admire your handiwork and if you want to, you can simply email your photos, like you’d planned to in the first place. However, now they will be extra special mementos of your big day.\n\nCheck out some of the features you get in Picture Frames Free:\n* Beautiful, intuitive interface\n* Very easy to use\n* Works with existing saved photos or new ones\n* Offers tons of adjustable frames \n* Varied color palette for your frame colors \n* Adjustable border thickness \n* Zoom, pan, and adjust your images \n* High resolution for printouts! \n* Lower resolution for faster processing and online uploading \n* Share on Facebook, Twitter, or our public user gallery\n* See what others are creating on the user gallery\n* Email your creations to friends and family \n* App supports both the iPhone and iPad\n\nNow is the time to let your muse out to play. Download Picture Frames Free, have fun and share your original photo arrangements.\n\nFree the Apps! brings you the quality of paid apps for free. We have registered over 37 million total downloads. Your continued support allows us to bring you more updates and apps for free. If you haven't gotten a chance to try out our other top free apps, check them out and spread the word! Thanks! :D\n\nfreetheapps.com \nfacebook.com/freetheapps \ntwitter.com/freetheapps", "artistName": "John Temple Group Pty Ltd.", "artworkUrl512": "http://a1111.phobos.apple.com/us/r30/Purple3/v4/24/e3/4d/24e34d19-e22d-530b-0968-0d1c216e9fd8/mzl.sjozruwu.png", "version": "2.1", "primaryGenreId": 6008, "primaryGenreName": "Photo & Video", "fileSizeBytes": "14610616", "price": 0.0, "isGameCenterEnabled": false, "trackCensoredName": "Picture Frames FREE", "genreIds": ["6008", "6002"], "trackName": "Picture Frames FREE", "releaseNotes": "New effect packs added.\nMinor bug fix.", "sellerUrl": "http://www.freetheapps.com", "screenshotUrls": ["http://a4.mzstatic.com/us/r30/Purple/v4/e6/65/63/e6656373-3c97-36e9-ec48-37b94f74de57/screen1136x1136.jpeg", "http://a2.mzstatic.com/us/r30/Purple/v4/50/03/4f/50034f31-8823-5169-9840-ca5edfb08fa7/screen1136x1136.jpeg", "http://a3.mzstatic.com/us/r30/Purple/v4/1e/2f/aa/1e2faa5b-927d-8078-a536-beb7dde1cafb/screen1136x1136.jpeg", "http://a1.mzstatic.com/us/r30/Purple/v4/32/0d/03/320d039b-b214-b312-2b54-ba4758b05042/screen1136x1136.jpeg", "http://a4.mzstatic.com/us/r30/Purple/v4/bb/90/6b/bb906b73-242a-1a50-6798-8ad0b81bd1bc/screen1136x1136.jpeg"], "userRatingCount": 528, "trackContentRating": "4+", "formattedPrice": "Free", "artistViewUrl": "https://itunes.apple.com/us/artist/john-temple-group-pty-ltd./id317856073?uo=4", "kind": "software", "sellerName": "John Temple Group Pty Ltd.", "supportedDevices": ["iPodTouchFifthGen", "iPad2Wifi", "iPadMini4G", "iPhone5", "iPhone4", "iPodTouchourthGen", "iPadThirdGen4G", "iPhone5c", "iPadFourthGen4G", "iPhone4S", "iPadMini", "iPadThirdGen", "iPad23G", "iPhone-3GS", "iPhone5s", "iPadFourthGen"], "artworkUrl100": "http://a1111.phobos.apple.com/us/r30/Purple3/v4/24/e3/4d/24e34d19-e22d-530b-0968-0d1c216e9fd8/mzl.sjozruwu.png", "bundleId": "com.freetheapps.dypticframes", "trackViewUrl": "https://itunes.apple.com/us/app/picture-frames-free/id458984421?mt=8&uo=4", "minimumOsVersion": "6.1", "artworkUrl60": "http://a1275.phobos.apple.com/us/r30/Purple3/v4/94/b5/b8/94b5b8cc-0333-5b59-c736-626f52eeae37/icon-iphone.png", "averageUserRating": 4.0}