{"contentAdvisoryRating": "4+", "features": [], "languageCodesISO2A": ["EN"], "ipadScreenshotUrls": [], "releaseDate": "2011-09-13T21:28:33Z", "currency": "USD", "artistId": 459465952, "userRatingCountForCurrentVersion": 7, "wrapperType": "software", "advisories": [], "genres": ["Sports", "Entertainment"], "trackId": 459465949, "description": "Now with support for Fantasy Football 2014\n\nCan’t watch enough great sports moments? Then Thuuz is a must have app for you. Thuuz makes sure you never miss a Patriots-Broncos game for the ages, a Lebron-fueled 4th quarter comeback, a Zimmerman no-hitter, or a Messi hat trick.\n\n- “I’m a huge fan of the app.” - TechCrunch\n\n- \"Thuuz might be the coolest app that you haven’t downloaded on your phone yet.\" - Xfinity\n\n- \"All in all this is a fantastic app that blows ESPN ScoreCenter out of the water.\" - Billy (user), Los Angeles…we love Billy.\n\nWhat makes Thuuz different than your average sports app? Thuuz rates all live and upcoming games on a scale of 0-100, making it easy for you to know exactly what to watch. You can personalize the app based on your favorite teams, sports and even your Fantasy* players so Thuuz will only alert you to the games near and dear to your heart!\n\nThen the world class TV guide** in Thuuz will tell you immediately where to watch the action. If you can't get to the TV, we'll let you know where the game is streaming on your mobile device or online. If you miss the game, you can also relive all the great moments with our links to the highlights.\n\nIf you're a fan of these sports - NFL, MLB, NBA, NHL,  Men’s college football and basketball, Tennis, Golf, Soccer, Cricket and Rugby - then Thuuz has you covered. \n\nAnd if you play fantasy football or baseball on any of the major platforms, Thuuz helps you track when your players are having great performances and when is the right time to tune in and see a great performance. Thuuz will even let you know if your players get injured.\n\nHere are some ways big time sports fans are using Thuuz every single day as their go-to sports app:\n\n1. My sports TV guide: Check in to see what’s on TV right now\n2. My on-the-go sports alerts:  Know what’s going on when you’re not in front of the TV\n3. My Fantasy tracker:  Get alerts when your players are going off or are injured\n4. My buddy system: Check in to a game and alert all of your friends to what’s going on\n5. My time saver:  Life getting busy? Use Thuuz to optimize your sports viewing time\n\n*  Thuuz only supports Fantasy baseball and football at this time.\n** Thuuz currently only provides TV and online viewing information for the United States. \n\n\nLearn more: http://www.thuuz.com or follow us on Facebook or Twitter (@thuuz) to get real-time updates on our product, as well as what's exciting in sports.", "artistName": "Thuuz Inc.", "artworkUrl512": "http://a1943.phobos.apple.com/us/r30/Purple1/v4/03/33/e6/0333e697-f882-d907-924f-0fcd4f90f1ed/mzl.nskxcvhv.png", "version": "6.5.5", "primaryGenreId": 6004, "primaryGenreName": "Sports", "fileSizeBytes": "20647999", "price": 0.0, "isGameCenterEnabled": false, "trackCensoredName": "Thuuz Sports", "genreIds": ["6004", "6016"], "trackName": "Thuuz Sports", "releaseNotes": "Fall bring us MLB Postseason, NFL and NCAA football, NHL, NBA and NCAA basketball, European Football, and more! \n\nThis is what Thuuz is all about: providing the personalized guide to navigate through all these sports and insure that you never miss a great game or match. Make sure you have your alerts turned on so that you get the full impact of the service!\n\nWe only send you one alert per game, and only if it's truly exciting from your perspective, so you'll never be overwhelmed with notifications. \n\nWith your preferences set appropriately, you can govern which sports to follow, which teams to get heightened excitement alerts for, and how often to get alerted within a given league, from the \"I don't want to miss any great game\" fanatic to the \"only if its the best of the best\" casual fan.\n\nIn this new version of Thuuz Sports, we are delighted to announce that we:\n\n* Greatly streamlined the onboarding process, including the option to use your Facebook profile to seamlessly set the preferences for your favorite teams and sports.\n\n* Threw in some fixes for iOS 8 (not that we're suggesting that someone broke a few things en route to enhancing their mobile platform).\n\nNow, with our new onboarding flow, it's easier to get your friends to become Thuuzers. Spread the word! Give the gift of Thuuz today.", "sellerUrl": "http://www.thuuz.com/", "screenshotUrls": ["http://a3.mzstatic.com/us/r30/Purple3/v4/80/e2/a7/80e2a73a-2813-3544-5350-99b7f6d8a438/screen1136x1136.jpeg", "http://a1.mzstatic.com/us/r30/Purple3/v4/f1/82/ad/f182ad08-fdc1-353b-ecd8-1c21d24bcabc/screen1136x1136.jpeg", "http://a1.mzstatic.com/us/r30/Purple3/v4/9f/a1/9f/9fa19fcb-ff81-3355-c205-3ea86197b6ed/screen1136x1136.jpeg", "http://a3.mzstatic.com/us/r30/Purple1/v4/38/ec/51/38ec51bc-87ad-78c0-a54b-6d2d7a9838a9/screen1136x1136.jpeg", "http://a2.mzstatic.com/us/r30/Purple3/v4/c0/93/3c/c0933cc3-af8c-aa9a-19e6-bc560bfbabc4/screen1136x1136.jpeg"], "userRatingCount": 394, "trackContentRating": "4+", "formattedPrice": "Free", "artistViewUrl": "https://itunes.apple.com/us/artist/thuuz-inc./id459465952?uo=4", "kind": "software", "averageUserRatingForCurrentVersion": 4.5, "sellerName": "Thuuz Inc.", "supportedDevices": ["iPad23G", "iPadFourthGen4G", "iPodTouchFifthGen", "iPad2Wifi", "iPhone4", "iPadMini4G", "iPhone5s", "iPhone5", "iPhone4S", "iPadMini", "iPadFourthGen", "iPhone5c", "iPadThirdGen", "iPadThirdGen4G"], "artworkUrl100": "http://a1943.phobos.apple.com/us/r30/Purple1/v4/03/33/e6/0333e697-f882-d907-924f-0fcd4f90f1ed/mzl.nskxcvhv.png", "bundleId": "com.thuuz.iphone", "trackViewUrl": "https://itunes.apple.com/us/app/thuuz-sports/id459465949?mt=8&uo=4", "minimumOsVersion": "7.0", "artworkUrl60": "http://a232.phobos.apple.com/us/r30/Purple1/v4/63/f3/ff/63f3ff7f-4f04-cc20-0563-b06a83cc3132/application-icon.png", "averageUserRating": 4.5}