{"contentAdvisoryRating": "4+", "features": ["iosUniversal"], "languageCodesISO2A": ["EN"], "ipadScreenshotUrls": ["http://a5.mzstatic.com/us/r30/Purple3/v4/89/40/0d/89400d8d-04b8-878c-cede-a1b8b9c34b11/screen480x480.jpeg", "http://a3.mzstatic.com/us/r30/Purple1/v4/a9/b2/c8/a9b2c89b-b606-eca7-7f23-b9d6bba7a490/screen480x480.jpeg", "http://a5.mzstatic.com/us/r30/Purple1/v4/b1/c5/d2/b1c5d2d7-6edf-743d-802d-3246824d5cbd/screen480x480.jpeg", "http://a1.mzstatic.com/us/r30/Purple5/v4/a2/52/35/a252354c-fb19-c1b7-fb74-7f6f2de54204/screen480x480.jpeg", "http://a4.mzstatic.com/us/r30/Purple1/v4/fe/74/05/fe74055e-8e2e-d912-aab3-06f9f4e1d7ab/screen480x480.jpeg"], "releaseDate": "2011-09-12T19:25:18Z", "currency": "USD", "artistId": 459602074, "userRatingCountForCurrentVersion": 9, "wrapperType": "software", "advisories": [], "genres": ["Education", "Games", "Family"], "trackId": 459602071, "description": "Teachers using the JogNog app save 1-2 hours of class time each week by using JogNog's ready-to-use quizzes rather than creating and grading their own. Easily find a JogNog assessment for almost any Common Core or State Standard and assign it to your students for homework.\n\nStudents use JogNog to study for and take tests in a fun and fast way. In Massachusetts, students using JogNog improved scores on state standardized tests by an average of 8.1%. Students using JogNog can test their skills against people in their class, their school or around the world.\n\nThe JogNog app has a library of over 1,600 quizzes and over 70,000 questions written and fact-checked by teachers aligned to the Common Core and state standards. To motivate student engagement, it also includes over 1,600 unique JogNog achievement badges.\n\nHigh praise for JogNog:\n\n\"For teachers looking for a fun, interactive way to help students review the core curriculum, this product is an excellent choice.\" -National Science Teachers Association \n\n\"Using this tool, teachers can create a video game that supports their lesson plan much faster and more conveniently than writing their own test and review materials\" - Site of the Week, eSchool News\n\n\"JogNog is an educational game site which engages students in test preparation in a fun, lively way. 'This is crazy. It's really fun but you're also learning' exclaimed one player.\" -NSTA \n\nEach JogNog topic has a comprehensive FREE review quiz and the first level of every quiz is free to play as many times as you like. JogNog Credits can be purchased for $0.99 each and used to unlock higher levels of each Quiz. There are also special Teacher Packs that support full classrooms of students at discounted prices.\n \nJogNog is great for elementary and middle school but there is also content for high school and college prep. Here are some example quizzes:\n\n2nd Grade: Contractions, Spelling Patterns, Leadership and Good Citizenship, Famous People in History, Place Value, Even and Odd Numbers, Butterfly Life Cycle, Spelling Blends and Digraphs, Fossils\n\n3rd Grade: Sentence Structure, Subject and Verb Agreement, Math Vocabulary, Subtraction, Electricity and Magnetism, Forms of Energy, Living Things, Sound and Light Energy\n\n4th Grade: Solar System, Structures and Functions, Weather, Central America, Caribbean, China, Standard English Conventions, Subjects and Predicates, Parts of Speech, Inequalities, Patterns and Expressions\n\n5th Grade: Adaptations, Earth's History, Energy and Living Things, Materials and Tools, Water Cycle, Constitutional Government, Growth of the Colonies, Growth of the U.S. Republic, Pre-Columbian History, Geometry, Fractions, Integers, Factors, Multiples\n\n6th Grade: Environmental Science, Algebra, Data, Earth and Space, Grammar, Civilization, Engineering, Technology, Structure and Function of Plants, Rise of Rome, Tools for Constructing Prototypes, Planets\n\n7th Grade: Ancient Greece, Ancient India, The Renaissance, The Reformation, Types of Bridges, Transportation Systems, Tools of Communication Technology Design, Atoms and Molecules, Heat Energy\n\n8th Grade: Kush and Other African Kingdoms, Ancient Mesopotamia, Korea, Southeast Asia, Melting and Boiling Point, Conservation of Mass\n\n9th, 10th, 11th, 12th Grade - High School: Biology, Chemistry, Physics, Judicial Branch - Courts and the Law, Constitution, Legislative Branch - The House and Senate, Local Government - Towns, Counties, and States\n\nLiterature: Midsummer Night's Dream, Separate Peace, Tale of Two Cities, Animal Farm, Jane Eyre, Julius Caesar, Macbeth, Of Mice and Men, Romeo and Juliet, Catcher in the Rye, Glass Menagerie, Great Gatsby, Old Man and the Sea, To Kill A Mockingbird, Adventures of Huckleberry Finn, Fahrenheit 451, Hamlet, Les Miserables, Grapes of Wrath, Scarlet Letter, Treasure Island\n\nCollege Prep: Brain and Cognitive Sciences, Nuclear Engineering, X-Rays and Other Daily Encounters, Ocean Sciences, Elementary Japanese - Hiragana, Katakana, Music", "artistName": "G7 Research LLC", "artworkUrl512": "http://a973.phobos.apple.com/us/r30/Purple3/v4/c7/14/46/c71446fd-f6ce-260b-3f60-1edc23bda071/mzl.tddakpuw.png", "version": "3.3.2412", "primaryGenreId": 6017, "primaryGenreName": "Education", "fileSizeBytes": "16127989", "price": 0.0, "isGameCenterEnabled": false, "trackCensoredName": "JogNog", "genreIds": ["6017", "6014", "7009"], "trackName": "JogNog", "releaseNotes": "Bug fixes for iOS8", "sellerUrl": "http://www.jognog.com", "screenshotUrls": ["http://a5.mzstatic.com/us/r30/Purple5/v4/09/c7/dc/09c7dcbd-8777-a7f9-77c4-f56e481d7b60/screen1136x1136.jpeg", "http://a4.mzstatic.com/us/r30/Purple3/v4/15/b2/72/15b272bf-e0ea-3ccb-1103-7cd2c22814af/screen1136x1136.jpeg", "http://a5.mzstatic.com/us/r30/Purple3/v4/bb/96/6e/bb966eab-f75a-06a1-eb9e-0f0a1bae2f90/screen1136x1136.jpeg", "http://a1.mzstatic.com/us/r30/Purple3/v4/e7/94/2b/e7942b67-e228-898f-aea5-ed07ecee1a95/screen1136x1136.jpeg", "http://a2.mzstatic.com/us/r30/Purple5/v4/6a/86/bc/6a86bc44-b783-1339-ecfa-745dbbf0b2bc/screen1136x1136.jpeg"], "userRatingCount": 242, "trackContentRating": "4+", "formattedPrice": "Free", "artistViewUrl": "https://itunes.apple.com/us/artist/g7-research-llc/id459602074?uo=4", "kind": "software", "averageUserRatingForCurrentVersion": 4.5, "sellerName": "G7 Research LLC", "supportedDevices": ["iPadFourthGen", "iPadFourthGen4G", "iPad2Wifi", "iPadMini", "iPhone5", "iPhone5c", "iPhone4", "iPhone4S", "iPadThirdGen4G", "iPhone5s", "iPad23G", "iPadThirdGen", "iPodTouchFifthGen", "iPadMini4G"], "artworkUrl100": "http://a973.phobos.apple.com/us/r30/Purple3/v4/c7/14/46/c71446fd-f6ce-260b-3f60-1edc23bda071/mzl.tddakpuw.png", "bundleId": "com.g7research.jognog", "trackViewUrl": "https://itunes.apple.com/us/app/jognog/id459602071?mt=8&uo=4", "minimumOsVersion": "7.0", "artworkUrl60": "http://a306.phobos.apple.com/us/r30/Purple3/v4/17/20/3f/17203f3a-ab4f-cfd5-b943-2f8c0ed1f23a/AppIcon57x57.png", "averageUserRating": 4.0}