{"contentAdvisoryRating": "4+", "features": [], "languageCodesISO2A": ["EN"], "ipadScreenshotUrls": [], "releaseDate": "2012-01-10T07:02:49Z", "currency": "USD", "artistId": 331527274, "userRatingCountForCurrentVersion": 239, "wrapperType": "software", "advisories": [], "genres": ["Navigation", "Travel"], "trackId": 467816643, "description": "Scout GPS Maps, Meetup, Chat & Social Voice Navigation with Friends \n\n“I’m just five minutes away!” Heard that before? Whether it’s that friend who’s always late, who’s always lost, or who needs to lighten up with the “where are you??” texts, we all have that friend. Now there’s a cure for the common meetup quirk: Scout. It’s the only app that let’s you chat, make plans, and meet up in real life all in one super easy experience—including getting there with turn-by-turn GPS directions and everyone’s real-time ETA on the navigation map. \n\n•\tNew! Chat that leads to real plans – From spur-of-the-moment hangouts to a planned movie night, chat with friends about what to do and where to go, and then actually do it all in Scout. \n\n•\tNew! Meet up hassle-free – One app for everything. Choose who to meet up with, pick a day and time, select a location, and you’re set. You can even chat before and after your get-together with all invitees in the same meetup stream.\n\n•\tNew! Drive together — Everyone meeting up gets voice-guided, turn-by-turn directions to the destination and sees each other’s ETA on the navigation map while driving there, so you’ll know if ‘”five minutes away” really means “I haven’t left yet!”\n\n•\tNew! Safe and secure, it’s about who you know – Always online or anti-social media, Android or iPhone, include anyone you want. People can only see the chats and meetups they’re invited to and can leave the conversation with just a swipe. \n\n•\tNew! Get a leg up on your commute – Without even opening the app., Scout keeps an eye on what your daily commute conditions are like and sends you a report 15 minutes before you usually leave. Scout will also help you find alternate routes to save you time. \n\n•\tNever get lost with the most up-to-date maps – OpenStreetMap (OSM) powers Scout’s maps with a community of more than 1.6 million editors making regular updates to the map. Your use of Scout will automatically help OSM map quality.\n\n•\tBeat traffic everywhere you go – Get the fastest routes based on real-time traffic and be routed around accidents and jams. Help others on the road by reporting traffic incidents, congestion, police, and construction hazards. \n\n•\tHandle pits stops faster than a NASCAR crew – When you need to stop on the way, Scout finds gas stations by price, restaurants, coffee shops, and even popular chains up ahead, only along your route.\n\n•\tSave money and time on parking - Scout’s arrival guide shows you the nearest and cheapest parking closest to your destination\n\n•\tGet help when you need it – customer support is available online at ourcommunity.scout.me\n\n•\tJoin our community – Keep up with Scout at www.facebook.com/scoutbytelenav, @scout on Twitter, and @scoutbytelenav on Instagram\n\n--\nWhat’s the word on Scout?\n“Scout is as easy on the eyes as it is easy to use.” - Mashable\n“Scout wins Best for Design” ¬ Travel & Leisure, Best GPS Apps for Travel\n\nNotes:\n•Continued use of GPS running in the background can decrease battery life.\n•Scout’s map and search coverage is currently for the USA only.", "artistName": "Telenav, Inc.", "artworkUrl512": "http://a806.phobos.apple.com/us/r30/Purple4/v4/56/90/aa/5690aa08-083b-e903-0ae0-789dcdf1bfcf/mzl.tjbnbvns.png", "version": "1.18.1.104528", "primaryGenreId": 6010, "primaryGenreName": "Navigation", "fileSizeBytes": "28962354", "price": 0.0, "isGameCenterEnabled": false, "trackCensoredName": "Scout GPS Maps, Meetup, Chat & Social Voice Navigation with Friends", "genreIds": ["6010", "6003"], "trackName": "Scout GPS Maps, Meetup, Chat & Social Voice Navigation with Friends", "releaseNotes": "Use the new Scout with other people! Chat, Meet Up and Drive together:\n·         Chat and make real plans\n·         Meet up hassle free\n·         Know when everyone’s going to get there\n \nAlso, get the quickest route for your daily commute without opening the app. Scout does the work for you!", "sellerUrl": "http://www.telenav.com/products/scout", "screenshotUrls": ["http://a3.mzstatic.com/us/r30/Purple3/v4/62/b2/01/62b201c7-50d5-c1e4-6af4-92df29a4547c/screen1136x1136.jpeg", "http://a4.mzstatic.com/us/r30/Purple3/v4/9e/de/2e/9ede2e61-cae1-1a60-3e36-a2c4228f9567/screen1136x1136.jpeg", "http://a5.mzstatic.com/us/r30/Purple3/v4/54/b2/f0/54b2f074-676b-f08a-6fde-7c9c4e7c3eaa/screen1136x1136.jpeg", "http://a1.mzstatic.com/us/r30/Purple3/v4/21/a3/c8/21a3c8cd-df39-7b48-4e98-ddec43b5e4e4/screen1136x1136.jpeg", "http://a2.mzstatic.com/us/r30/Purple1/v4/0b/d5/bb/0bd5bbd2-438c-81d1-67cd-0b20886924c5/screen1136x1136.jpeg"], "userRatingCount": 5188, "trackContentRating": "4+", "formattedPrice": "Free", "artistViewUrl": "https://itunes.apple.com/us/artist/telenav-inc./id331527274?uo=4", "kind": "software", "averageUserRatingForCurrentVersion": 3.5, "sellerName": "Telenav, Inc.", "supportedDevices": ["iPhone4S", "iPhone5", "iPadMini4G", "iPhone5c", "iPhone4", "iPhone5s", "iPad2Wifi", "iPadThirdGen4G", "iPadFourthGen", "iPad23G", "iPodTouchFifthGen", "iPadMini", "iPadThirdGen", "iPadFourthGen4G"], "artworkUrl100": "http://a806.phobos.apple.com/us/r30/Purple4/v4/56/90/aa/5690aa08-083b-e903-0ae0-789dcdf1bfcf/mzl.tjbnbvns.png", "bundleId": "com.telenav.scout", "trackViewUrl": "https://itunes.apple.com/us/app/scout-gps-maps-meetup-chat/id467816643?mt=8&uo=4", "minimumOsVersion": "7.0", "artworkUrl60": "http://a1213.phobos.apple.com/us/r30/Purple3/v4/6e/34/8d/6e348d9d-cd1d-2f19-0abf-a3d82d9b3671/app_icon.png", "averageUserRating": 4.0}