{"contentAdvisoryRating": "4+", "features": [], "languageCodesISO2A": ["EN", "FR", "DE", "IT", "JA", "ES"], "ipadScreenshotUrls": [], "releaseDate": "2011-10-18T03:47:18Z", "currency": "USD", "artistId": 431553215, "userRatingCountForCurrentVersion": 16, "wrapperType": "software", "advisories": [], "genres": ["Navigation", "Travel"], "trackId": 469463298, "description": "The ULTIMATE TRANSIT APP! * 2013 Apple's App of the Year (runner-up) * Apple Editor's Choice * Grand Prize Winner of MTA NYC App Quest 2013 * Best Overall Mobile App 2014 (GSMA/Mobile World Congress) * Designs of the Year 2014 - London Design Museum * Essential App of the Year- Stuff Magazine * \n\nLive in: San Francisco, Chicago, New York City, Washington DC, Boston. London, Paris, Berlin, Madrid, Barcelona, Milan, Rome. (more coming)\n\n- \"Citymapper is quite simply the best travel app to be introduced to New York City\"- NYTimes\n- \"The most useful app I have on my Phone.\"\n- \"Its reason alone to get an iPhone. It's that good.\" \n- \"Life changing. This app really changes the way you travel.\"\n- \"I never thought I could love an app so much.\"\n\nCitymapper is reinventing the everyday urban transit app and making the large complicated city simple and usable. A to B trip planning, real-time departure data on all modes of transit where available, weather, alerts, disruptions, and everything you need and may not even realize that you need to manage your life in the city.\n\nConstant updates. We improve the app regularly.\n\nREVIEWS:\n- \"Best app on my phone.\"\n- \"It has it all. Everything in one place.\" \n- \"BEST TRANSPORT APP EVER.\"\n- \"This is simply the best app I've come across.\" \n- \"This app makes me warm inside\"\n- \"Literally my favorite app. If any of my friends are looking for new apps, this is the one I suggest first.\" \n- \"The only true five star app.\"\n- \"Don't know how I lived without it.\" \n- \"Get these guys on the Queen's birthday honours list.\" \n- \"It's become a weird and possibly sad fact of my life that waiting and receiving Citymapper updates have overtaken Christmases and birthdays on the anticipation and excitometer.\"\n- \"I'm practically married to this app.\"\n- \"Just when you think it can't get any better. Boom. New amazing features are released.\"\n- \"By far the most useful app I have and have ever had.\"\n\nWe use open data from MTA, WMATA, MBTA TfL, other agencies and lots of other sources. We update the app regularly.\n\nWrite us to tell us what you want: support(at)citymapper.com.\n\nPlease note the app requires data access and works best with GPS on.", "artistName": "Citymapper Limited", "artworkUrl512": "http://a1617.phobos.apple.com/us/r30/Purple3/v4/8b/33/8b/8b338b07-6654-924e-8980-56087db1b31e/mzl.stdvtfvr.png", "version": "4.12", "primaryGenreId": 6010, "primaryGenreName": "Navigation", "fileSizeBytes": "23764565", "price": 0.0, "isGameCenterEnabled": false, "trackCensoredName": "Citymapper - the Ultimate Transit App (Subway, Train, Bus, Metro, Bikes)- New York City and others", "genreIds": ["6010", "6003"], "trackName": "Citymapper - the Ultimate Transit App (Subway, Train, Bus, Metro, Bikes)- New York City and others", "releaseNotes": "Mexico City and.. baby Tokyo. Oh! You didn’t see that coming now did you. Look at that face. Latin America and Asia represent!\n\nMexico City aka Distrito Federal. Enough with the #firstworldproblems, it’s time to help some real people. So begins our broader international expansion into emerging markets where some of our greatest work is to be done. Hola to 21 million Chilangos. We have the Metro, the Metrobus, the trolleybuses, the lightrail as well as the suburban rail, the RTP buses, and the ecobici! We also have line incidents. Oh and the peseros, they will come. Ahorita, ahorita. \n\nBaby Tokyo. Ok to be honest, we’re going early on this one, the data is incomplete, there are no buses. Even Citymapper can’t handle the Tokyo. Just yet. But there is some real-time and disruptions and the app is in Japanese. Or so we think. This is the first step folks. Will the baby grow up?\n\nExisting cities, please know that adding more cities does not make the app slower. However still using iOS6 will. We have more:\n- Improved fengshui when you use nearby stops/ departures and My Stops.\n- Get Me Home and Get Me to Work are now easier to edit and share, just tap the Triple Dots. Hope you find them. \n- Get Me to School. You can now change Work to School. Those of you in school, seriously don’t leave, work is overrated anyway. Especially transport apps, mad difficult.\n- Various bugs squished, data and routing improvements. \n\nAs the app gets more complex, please know that we will also continue to simplify. The world gets bigger. The world gets smaller. Welcome to our new continents.", "sellerUrl": "http://citymapper.com", "screenshotUrls": ["http://a5.mzstatic.com/us/r30/Purple3/v4/f5/5e/4a/f55e4ad6-f775-6510-4280-015b834e5a37/screen1136x1136.jpeg", "http://a5.mzstatic.com/us/r30/Purple3/v4/ac/b7/01/acb70182-6f38-5a7e-8542-4c4aeaebd09c/screen1136x1136.jpeg", "http://a4.mzstatic.com/us/r30/Purple3/v4/24/2b/fa/242bfa76-f376-32e1-3a43-dfa13a5f6996/screen1136x1136.jpeg", "http://a3.mzstatic.com/us/r30/Purple3/v4/c0/0b/c8/c00bc80a-29af-d98f-8eb5-de49679a294b/screen1136x1136.jpeg", "http://a5.mzstatic.com/us/r30/Purple3/v4/ca/a6/22/caa62287-9d86-8862-0949-0b9c8542a193/screen1136x1136.jpeg"], "userRatingCount": 786, "trackContentRating": "4+", "formattedPrice": "Free", "artistViewUrl": "https://itunes.apple.com/us/artist/citymapper-limited/id431553215?uo=4", "kind": "software", "averageUserRatingForCurrentVersion": 5.0, "sellerName": "Citymapper Limited", "supportedDevices": ["iPadMini4G", "iPadFourthGen4G", "iPhone5s", "iPhone4S", "iPad23G", "iPadThirdGen", "iPhone-3GS", "iPhone5", "iPodTouchourthGen", "iPadMini", "iPhone5c", "iPadFourthGen", "iPadThirdGen4G", "iPad2Wifi", "iPhone4", "iPodTouchFifthGen"], "artworkUrl100": "http://a1617.phobos.apple.com/us/r30/Purple3/v4/8b/33/8b/8b338b07-6654-924e-8980-56087db1b31e/mzl.stdvtfvr.png", "bundleId": "azdev.citymapper", "trackViewUrl": "https://itunes.apple.com/us/app/citymapper-ultimate-transit/id469463298?mt=8&uo=4", "minimumOsVersion": "6.0", "artworkUrl60": "http://a603.phobos.apple.com/us/r30/Purple3/v4/c4/e0/f6/c4e0f6d2-9bb5-95e4-e174-5e530287fccd/app-icon-old-57.png", "averageUserRating": 5.0}