{"contentAdvisoryRating": "4+", "features": ["iosUniversal"], "languageCodesISO2A": ["EN"], "ipadScreenshotUrls": ["http://a5.mzstatic.com/us/r30/Purple1/v4/66/3a/62/663a62a3-0a62-29d6-6b43-482580079eb6/screen480x480.jpeg", "http://a4.mzstatic.com/us/r30/Purple3/v4/a2/18/5c/a2185c59-cd85-15d4-399c-51d45d8b0b3b/screen480x480.jpeg", "http://a5.mzstatic.com/us/r30/Purple1/v4/e2/d4/04/e2d4042c-46ed-f09c-2e24-9ad772a76be8/screen480x480.jpeg", "http://a2.mzstatic.com/us/r30/Purple3/v4/19/9d/69/199d696f-0ebe-e1bd-b6c5-0c5609d18623/screen480x480.jpeg", "http://a5.mzstatic.com/us/r30/Purple3/v4/45/bc/f1/45bcf1d9-48af-35c9-aa48-7acb77a4e886/screen480x480.jpeg"], "releaseDate": "2011-12-10T04:42:53Z", "currency": "USD", "artistId": 322120289, "userRatingCountForCurrentVersion": 7, "wrapperType": "software", "advisories": [], "genres": ["Health & Fitness", "Lifestyle"], "trackId": 472322122, "description": "NEW USERS GET A MONTH ON US! START YOUR FREE MONTH TODAY! \n\nBring the gym to you with DailyBurn. Discover trainer-led workouts for all fitness levels, whether you’re new to fitness or advanced. Now with support for HealthKit in iOS 8. \n\nDailyBurn’s wide variety covers cardio, high-intensity interval training, yoga, strength-training, dance and beginner workouts. Whether you have only 15 minutes or more than an hour, DailyBurn has a workout for you! \n\nDailyBurn’s great features include:\n• Full-length, HD-quality workout videos with on-screen guidance through every step of your workout\n• Flexibility to workout anywhere - get access to your workout at home, the gym or on the road\n• Expert trainers and proven fitness plans keep you engaged and get you faster results while having fun\n• Access on your favorite iOS devices, other mobile devices, connected TV devices (including Roku, Xbox 360, Samsung TV, PlayStation PS3) and at www.dailyburn.com\n• Stream your workout from your iOS device to your flat screen TV with AirPlay (for Apple TV) or Chromecast\n• iOS 8 HealthKit support (iPhone and iPod Touch only) - share your workout activity with other popular health and fitness apps that support HealthKit. View your workout stats in iOS 8’s Health app.\n\nA few of our most popular workout programs:\n• Cardio Sculpt - Get lean legs, toned abs and a tight butt! Cardio Sculpt is DailyBurn's total-body sculpting program that torches calories and shrinks stubborn areas. Cardio Sculpt provides unique workouts designed by five expert trainers you're going to love. So what are you waiting for? Start Sculpting today!\n\n• True Beginner - Whether you’re starting out or starting over, True Beginner is the program for you. With this 8 week program, learn the fundamentals of fitness, boost energy levels, and build confidence. No matter what your starting point is, you can join us. Everyone is welcome at True Beginner! \n\n• LTF (Live to Fail) - JUST RELEASED! Failure is the secret weapon during these workouts! LTF is a 90 day program that combines high-intensity interval training with highly focused strength training. You'll learn the principles behind how muscle failure builds the well-defined lean muscle mass that you want. With LTF, you have to fail in order to grow!\n\n• TBT (Tactical Bodyweight Training) - Push yourself with a 28 day body blast that alternates two days of hard workouts with two days of recovery. Based on primal movements and mobility, TBT will make you strong while opening up your range of motion. These workouts aren't like anything you've seen before!\n\n• Inferno - Are you up for the Inferno Challenge? A 21 day gut-wrenching journey, Inferno applies breakthrough sequences to accelerate your metabolism and shred your body fast! So if you think you've got what it takes to be part of the Inferno Crew, start the Inferno Challenge today! Inferno brings the heat. You bring the passion!\n\nThe premium version of DailyBurn, DailyBurn All Access, requires a monthly subscription of $9.99, which is auto-renewed. Your All Access subscription automatically renews unless auto-renew is turned off at least 24-hours prior to the end of the current period. Your account will be charged the monthly subscription of $9.99 for renewal within 24-hours prior to the end of the current period. Auto-renewal may be turned off in your Account Setting in iTunes after purchase. No cancellation of the current subscription is allowed during an active subscription period.\n\nFeatured in: Mashable, TechCrunch, CNN, Huffington Post, The Daily Beast and Health.com\n\n“If you’re interested in daily programs (think P90x) designed to slim you down quickly and build muscle, then DailyBurn is the place to go.” - Mashable\n\nGet started with a 30 day free trial! Apple’s auto-renewing service allows you to enjoy DailyBurn’s premium service without interruption. \n\nFollow @dailyburn on Twitter \nLike us on facebook.com/dailyburn\nDailyBurn is the best fitness anywhere!", "artistName": "DailyBurn", "artworkUrl512": "http://a1787.phobos.apple.com/us/r30/Purple3/v4/13/e8/b7/13e8b7b8-dbc5-b2c7-a73f-03cf06726cd6/mzl.tlpwvnfd.png", "version": "3.4.1", "primaryGenreId": 6013, "primaryGenreName": "Health & Fitness", "fileSizeBytes": "23243121", "price": 0.0, "isGameCenterEnabled": false, "trackCensoredName": "DailyBurn - Video Workouts", "genreIds": ["6013", "6012"], "trackName": "DailyBurn - Video Workouts", "releaseNotes": "Now, new users have access to a free month of DailyBurn video workouts!", "sellerUrl": "http://dailyburn.com", "screenshotUrls": ["http://a3.mzstatic.com/us/r30/Purple3/v4/92/5c/4c/925c4cc8-1dbe-93d5-791c-376a4c0e974f/screen1136x1136.jpeg", "http://a4.mzstatic.com/us/r30/Purple3/v4/b6/e3/b7/b6e3b7ed-f04b-a993-94ac-67cbfc82494d/screen1136x1136.jpeg", "http://a4.mzstatic.com/us/r30/Purple1/v4/a7/53/73/a7537359-73f7-a4c0-ef88-f751c5708717/screen1136x1136.jpeg", "http://a5.mzstatic.com/us/r30/Purple3/v4/43/b8/b7/43b8b7b1-38ca-ea37-88d7-c766a27637a8/screen1136x1136.jpeg", "http://a3.mzstatic.com/us/r30/Purple3/v4/af/5f/77/af5f774b-34f6-adb9-ebd9-fcc426da3125/screen1136x1136.jpeg"], "userRatingCount": 979, "trackContentRating": "4+", "formattedPrice": "Free", "artistViewUrl": "https://itunes.apple.com/us/artist/dailyburn/id322120289?uo=4", "kind": "software", "averageUserRatingForCurrentVersion": 3.5, "sellerName": "Gyminee", "supportedDevices": ["iPadMini4G", "iPhone5", "iPadThirdGen4G", "iPadMini", "iPhone4", "iPadThirdGen", "iPhone5c", "iPadFourthGen4G", "iPad23G", "iPhone4S", "iPadFourthGen", "iPad2Wifi", "iPhone5s", "iPodTouchFifthGen"], "artworkUrl100": "http://a1787.phobos.apple.com/us/r30/Purple3/v4/13/e8/b7/13e8b7b8-dbc5-b2c7-a73f-03cf06726cd6/mzl.tlpwvnfd.png", "bundleId": "com.dailyburn.wod", "trackViewUrl": "https://itunes.apple.com/us/app/dailyburn-video-workouts/id472322122?mt=8&uo=4", "minimumOsVersion": "7.0", "artworkUrl60": "http://a689.phobos.apple.com/us/r30/Purple3/v4/6a/7e/1a/6a7e1ac5-2096-092b-1c68-161a2376c74d/AppIcon57x57.png", "averageUserRating": 4.0}