{"contentAdvisoryRating": "4+", "features": [], "languageCodesISO2A": ["EN"], "ipadScreenshotUrls": ["http://a2.mzstatic.com/us/r30/Purple2/v4/b0/b1/3c/b0b13c49-f902-b037-c535-4e63f4b3ce7d/screen480x480.jpeg", "http://a1.mzstatic.com/us/r30/Purple2/v4/3f/aa/e4/3faae4b3-f871-9fba-3e54-424c8447e391/screen480x480.jpeg", "http://a3.mzstatic.com/us/r30/Purple/v4/f4/f8/7a/f4f87a66-d712-6a82-e03e-501b7587b9d2/screen480x480.jpeg", "http://a3.mzstatic.com/us/r30/Purple/v4/f9/22/70/f9227061-a8c7-e2f3-6a86-021d9b48a17a/screen480x480.jpeg", "http://a2.mzstatic.com/us/r30/Purple2/v4/05/ef/84/05ef84a3-2130-cb33-c345-098bc774fed2/screen480x480.jpeg"], "releaseDate": "2012-01-20T20:45:00Z", "currency": "USD", "artistId": 303217147, "userRatingCountForCurrentVersion": 72, "wrapperType": "software", "advisories": [], "genres": ["Navigation", "Travel"], "trackId": 495230948, "description": "HopStop is the only public transit app you'll ever need. Get detailed subway, bus, train, taxi, walking & biking directions along with official transit maps, a nearby station finder, and schedules in over 600 cities throughout the US, Canada, Europe, Russia, Australia and New Zealand.\n\nWith HopStop you can:\n• Get directions from your current location \n• Get schedules for hundreds of regional rails, subways, buses, ferries, light rails, streetcars, trams, trolleys & more\n• Map a location & see nearby subway & bus stops\n• Estimate travel time & cost for a taxi\n• View high quality transit maps for NYC, LIRR, Metro North and SF\n• Set your travel preferences \n• Save recent searches in MyTrips\n• Stay updated with NYC transit advisories\n• Get biking directions in NYC, DC, Chicago, & SF\n• Find out how many calories you burn on each route and how many carbon emissions you save compared to driving\n• See wheelchair accessible and stroller friendly routes\n• Access previously used addresses as well as addresses from your contact list\n• Easily share directions via Email, Messages, Facebook and Twitter\n\nHopStop works in over 600 cities & counting:\nAkron, Albany, Albuquerque, Allentown / Lehigh, Ann Arbor, Asheville, Atlanta, Austin, Bakersfield, Baltimore, Bend, Birmingham, Blacksburg, Bloomington, Boston, Buffalo, Burlington, Charlotte, Chicago, Cincinnati, Clemson, Columbus, Cleveland, Dallas / Ft. Worth, Delaware, Denver / Boulder, Detroit, Dover / Portsmouth, Eugene, Flagstaff, Fort Wayne, Fresno, Green Bay / Appleton, Hartford, Honolulu, Houston, Huntsville, Indiana, Jackson Hole, Jacksonville, Kansas City, Kingsport, La Crosse, Lansing, Las Vegas, Lexington, Little Rock, Long Island, LA, Louisville, Madison, Memphis, Mendocino / Ft. Bragg / Eureka, Metro North, S. Florida, Milwaukee, Minneapolis, Missoula, NJ, Nashville, New Orleans, New York City, Newport News / Hampton, Norfolk / VA Beach, OKC, Omaha, Orange County, Orlando, Palm Springs , Philadelphia, Pittsburgh, Phoenix, Portland / Salem, Providence, Raleigh-Durham, Redding / Red Bluff / Shasta, Reno / Tahoe, Richmond, Rochester, Sacramento, Salt Lake City, San Antonio, San Diego, SF, Santa Barbara, Sarasota, Savannah, Seattle / Tacoma, Southwest Oregon, Spokane, Springfield, St Louis, State College, Stockton / Modesto / Tracey, Syracuse, Tampa, Topeka, Ventura / Oxnard, Yuma, Walla Walla, DC, Wilmington, Calgary, Edmonton, Halifax, Hamilton, Montreal, Ottawa, Quebec City, Saskatoon, Thunder Bay, Toronto, Vancouver, Victoria, Waterloo, Winnipeg, London, Moscow, Paris, St Petersburg\n\nHere are some of the transit agencies we support:\nAATA, ABQ, AC TRANSIT, AMT, AMTExp, ART, AT, ATS, BART, BBB, BC Ferries, BC Transit, BCT, BEE, BJCTA, BRTA, BT, CALTRAIN, Capital Corridor, CapMetro, CATA, CCR, CCRTA, CCTA, CDTA, CENTRO, CFRTA, CHT, CIT, COR, COTA, CTA, CTS, CTT, CUMTD, DART, DASH, DATA, DCTA, DDOT, DECAMP, DT, DTC, ESTA, ETS, EUROSTAR, FAX, FOOTHILL, FRTA, GATRA, GBMT, GBTA, GCRTA, GET, GO , GRT, GRTC, GT, HART, HHRM, JAC, JTA, KCATA, LACMTA, LADOT, LANE, LANTA, LBT, LBT, LCT, LEXTRAN, LIRR, LIT, LOOP, LRTA, LVM, MARTA, MATA, MAX, MBTA, MCTA, MCTS, MDT, METRA, MHC, MMT, MNR, MRC, MRO, MTA, MTSL, MUNI, MVRTA, MVTA, MWRTA, NCSU, NCTD, NFTA, NICE, NJT, NORTA, NRTA, NT, NYAS, NYWT, NYWW, OCTA, OC Transpo, OCW, OMIT, PAAC, PATCO, PATH, RATP, RB, RGRTA, RIPTA, RT, RTA, RTC, RTCSN, RTD, RTL, RVDB, RVTD, SACRT, SBCE, SCAT, SCMTD, SCRRA, SCT, SDMTS, SEPTA, SIF, SK, SJRTD, SLE, SLTA, SLW, SLWT,  SRCB, SSL, STA, STCA, STL, STM, TARC, TCT, TFL, Translink, TRAX, TRIMET, Tri-Rail, UNITRANS, UTA, VIA, VRE, VTA, WMATA, WRTA, WSDOT, YCT, Yolobus, YRT, YT, YUBA\n\nHopStop directions are informational only. Transit schedules and routes are subject to change. No representation is made or warranty given as to their content, route usability or expeditiousness. User assumes all risk of use. HopStop and its suppliers assume no responsibility for any loss or delay resulting from such use.", "artistName": "HopStop.com, Inc.", "artworkUrl512": "http://a712.phobos.apple.com/us/r30/Purple/v4/6d/46/1c/6d461cd6-2ab3-fdae-2cf2-4335d53404d4/mzl.lnazukji.png", "version": "2.1.1", "primaryGenreId": 6010, "primaryGenreName": "Navigation", "fileSizeBytes": "127356414", "price": 0.0, "isGameCenterEnabled": false, "trackCensoredName": "HopStop Transit Directions for iPad", "genreIds": ["6010", "6003"], "trackName": "HopStop Transit Directions for iPad", "releaseNotes": "- Bug fixes and improvements", "sellerUrl": "http://hopstop.com", "screenshotUrls": [], "userRatingCount": 323, "trackContentRating": "4+", "formattedPrice": "Free", "artistViewUrl": "https://itunes.apple.com/us/artist/hopstop.com-inc./id303217147?uo=4", "kind": "software", "averageUserRatingForCurrentVersion": 3.5, "sellerName": "HopStop.com, Inc.", "supportedDevices": ["iPad2Wifi", "iPadMini4G", "iPadThirdGen4G", "iPad3G", "iPadMini", "iPad23G", "iPadThirdGen", "iPadFourthGen", "iPadWifi", "iPadFourthGen4G"], "artworkUrl100": "http://a712.phobos.apple.com/us/r30/Purple/v4/6d/46/1c/6d461cd6-2ab3-fdae-2cf2-4335d53404d4/mzl.lnazukji.png", "bundleId": "com.hopstop.HopStop-for-iPad", "trackViewUrl": "https://itunes.apple.com/us/app/hopstop-transit-directions/id495230948?mt=8&uo=4", "minimumOsVersion": "5.0", "artworkUrl60": "http://a1595.phobos.apple.com/us/r30/Purple6/v4/c1/32/e2/c132e28f-2c10-6438-f82d-6ce6b0e80056/Icon-72.png", "averageUserRating": 4.0}