{"contentAdvisoryRating": "4+", "features": [], "languageCodesISO2A": ["EN"], "ipadScreenshotUrls": [], "releaseDate": "2012-03-20T07:00:00Z", "currency": "USD", "artistId": 284876798, "userRatingCountForCurrentVersion": 89, "wrapperType": "software", "advisories": [], "genres": ["Travel", "Utilities"], "trackId": 508487044, "description": "New features have been added to help you have an even better trip.  Find low airfares, pick your ideal seat on the plane, and get real-time flight alerts with the free SeatGuru® app.  We have rolled out redesigned high resolution seat maps with improved seat and amenity information.  The updated seat maps also have a new photos section with seat and cabin pictures from our SeatGuru community.  And now you can easily submit your own seat reviews and photos right from your phone! All from the ultimate source of advice on airplane seats, in-flight amenities and airline related information.\nWhether you're at the airport or on the go, SeatGuru is the must-have travel companion for everyone who flies. Optimized for your iPhone and iPod Touch, the free SeatGuru app lets you access over 700 seat maps from approximately 100 airlines. It features advice and insights drawn from tens of thousands of passenger reviews, so you can always find the best possible seat for your flight. \nThe SeatGuru app allows you to find and compare low airfares from the major airlines, low-cost carriers, as well as the leading online travel agencies. You can also set up flight alerts that monitor your flight departure and arrival times and other related flight information. \nPlus, with the latest app update, you can explore our redesigned seat maps for the most searched airlines, see seat photos submitted by other flyers, and upload your own seat photos and reviews. All in one easy-to-use free app!\nHere are some rave reviews for SeatGuru: \n\"The free SeatGuru app for the iPhone [brings] the company’s ultimate guide to air travel into the palm of your hand.\" - MacLife\n\"Even if you are an infrequent traveler, SeatGuru by TripAdvisor is an important app to have in order to make your air travel as pleasant as possible.\" - AppPicker\n\"The fact that the SeatGuru app is free is just icing on the cake.\" -– TUAW\nNamed a \"Best Travel App\" by Fortune Magazine, Bloomberg Businessweek, Travel + Leisure\n\nNamed a \"Best Travel App of 2012\" by The Next Web\n\nThe SeatGuru app is indispensable for anyone who flies. Here's why: \n1. Redesigned Airplane Seat Maps \nNewly updated color-coded maps allow you to more easily see the most important information on seat and aircraft amenities. Search the Web’s widest selection of airline seat maps to help you find the best seat on your flight. SeatGuru offers travelers over 700 of the most-searched seat maps for nearly 100 different airlines. The app now has our redesigned seat maps for most of the largest domestic and international airlines, with more to be added throughout the year.\n2. A superior Flight Search Engine (provided powered by TripAdvisor Flights) \nShop a wide selection of airlines and online travel agents and find the right flight and the lowest fares for your travel needs. \n3. Real-Time Flight Status Alerts \nCheck the status of your flight and sign up for real-time alerts, so you, your loved ones, and anyone else you want can stay informed of any delays or cancellations. \n4. Review Seat and Cabin Photos\nKnow what to expect by seeing seat photos before you fly. Browse through available pictures of seats and cabins from other SeatGuru flyers on the Seat Map page.\n5. Submit Seat Photos & Reviews \nShare your insights with other flyers. Add your own seat photos and reviews to SeatGuru from your phone, so other travelers can also have a great flight.\nAnd It’s Still Free!\nSeatGuru is available as a free download for the iPhone/iPod Touch in the Apple App Store and is powered by TripAdvisor®, the world’s largest travel site. \n\nSeatGuru.com and the SeatGuru app give travelers the information they need to make better and more informed travel decisions by providing comprehensive, extensive, and trusted seat recommendations and airline advice.", "artistName": "TripAdvisor LLC", "artworkUrl512": "http://a1122.phobos.apple.com/us/r30/Purple/v4/79/db/60/79db603c-91d4-9152-c7dc-cbc293da53e7/mzl.rtycedqy.png", "version": "2.2", "primaryGenreId": 6003, "primaryGenreName": "Travel", "fileSizeBytes": "2496266", "price": 0.0, "isGameCenterEnabled": false, "trackCensoredName": "SeatGuru by TripAdvisor", "genreIds": ["6003", "6002"], "trackName": "SeatGuru by TripAdvisor", "releaseNotes": "Photo uploader fix for iOS 7 and sundry bug fixes.", "sellerUrl": "http://www.seatguru.com/mobileapps", "screenshotUrls": ["http://a4.mzstatic.com/us/r30/Purple/v4/c5/eb/e7/c5ebe70e-9c18-5b76-45a0-6db2f35cfdf1/screen1136x1136.jpeg", "http://a1.mzstatic.com/us/r30/Purple2/v4/78/1f/de/781fdee3-4b26-d069-9c06-0783ae7bc387/screen1136x1136.jpeg", "http://a1.mzstatic.com/us/r30/Purple/v4/f4/9d/6f/f49d6f77-b985-7ccd-1487-376764ebadf2/screen1136x1136.jpeg", "http://a5.mzstatic.com/us/r30/Purple2/v4/76/3f/db/763fdb7e-08f9-f653-1eea-f6190a416a27/screen1136x1136.jpeg", "http://a1.mzstatic.com/us/r30/Purple2/v4/0f/fc/7d/0ffc7da8-8512-05f9-23db-9d7320986ba9/screen1136x1136.jpeg"], "userRatingCount": 1707, "trackContentRating": "4+", "formattedPrice": "Free", "artistViewUrl": "https://itunes.apple.com/us/artist/tripadvisor-llc/id284876798?uo=4", "kind": "software", "averageUserRatingForCurrentVersion": 3.0, "sellerName": "TripAdvisor", "supportedDevices": ["iPhone-3GS", "iPad3G", "iPadThirdGen4G", "iPhone4S", "iPhone5", "iPodTouchourthGen", "iPadWifi", "iPhone5c", "iPadFourthGen", "iPhone4", "iPodTouchThirdGen", "iPadFourthGen4G", "iPadThirdGen", "iPadMini", "iPhone5s", "iPad2Wifi", "iPad23G", "iPadMini4G", "iPodTouchFifthGen"], "artworkUrl100": "http://a1122.phobos.apple.com/us/r30/Purple/v4/79/db/60/79db603c-91d4-9152-c7dc-cbc293da53e7/mzl.rtycedqy.png", "bundleId": "com.tripadvisor.SeatGuru", "trackViewUrl": "https://itunes.apple.com/us/app/seatguru-by-tripadvisor/id508487044?mt=8&uo=4", "minimumOsVersion": "4.3", "artworkUrl60": "http://a1511.phobos.apple.com/us/r30/Purple4/v4/c6/d1/af/c6d1af5c-04df-33b6-4c13-5ddd5f069c10/SeatGuru-Icon.png", "averageUserRating": 4.5}