{"contentAdvisoryRating": "4+", "features": ["iosUniversal"], "languageCodesISO2A": ["EN"], "ipadScreenshotUrls": ["http://a4.mzstatic.com/us/r30/Purple3/v4/5f/ea/aa/5feaaa80-3a81-bf43-d087-a38a0c0f1b53/screen480x480.jpeg", "http://a1.mzstatic.com/us/r30/Purple3/v4/e6/5b/6f/e65b6f08-59e8-ffba-2ba9-cfc56942c9ca/screen480x480.jpeg", "http://a5.mzstatic.com/us/r30/Purple1/v4/ee/b1/1e/eeb11eed-8624-b862-e787-4afd08e91761/screen480x480.jpeg", "http://a2.mzstatic.com/us/r30/Purple1/v4/96/a8/79/96a8797b-875d-95b7-48c9-efdb2301e418/screen480x480.jpeg", "http://a1.mzstatic.com/us/r30/Purple5/v4/be/e2/97/bee297b5-57dc-7808-749c-08a784466e4c/screen480x480.jpeg"], "releaseDate": "2012-03-20T07:00:00Z", "currency": "USD", "artistId": 396622308, "userRatingCountForCurrentVersion": 9, "wrapperType": "software", "advisories": [], "genres": ["Entertainment", "Lifestyle"], "trackId": 509199715, "description": "Since 1920, AMC has been the amazing place where movies want to play. Now, we’re bringing movie magic to your fingertips with the FREE AMC Theatres app for iPhone and iPad. It’s the newest, most amazing way to find the closest theatre, get showtimes, buy tickets and browse exclusive content!\n\nIf you’re an AMC Stubs member, then the app has extra perks for you. Use your phone as your AMC Stubs card, check your rewards balance, share your stubs on Facebook and more!\n\nGet VIP movie access and download our app now! \n\nUse our AMC amazing app to:\n\n• Find a Movie – Get showtimes and buy tickets by searching for the flick you want to see. Get tickets for a show today, or make sure you’re first in line for next week’s movie by buying tickets now. Find movies by your current location, favorite theatres, or zip code. You’ll also find movie synopses and trailers.\n\n• Find a Theatre – Want to have an AMC amazing experience NOW? Find the theatre closest to your location, or look up your favorite theatre. You can also search by zip code, or switch over to map view.\n\n• AMC Stubs – If you’re a member, then your wallet must be getting heavy from the money you save on free concession upgrades. Leave your AMC Stubs card at home and use your phone instead. Plus, you can look through your online stubs collection, share your stubs on Facebook, check your rewards balance and more. \n\n• Gift Cards - Did you forget about your friend’s birthday until the last minute? Use our e-gift card section to purchase a gift card for them and deliver it via email or text message! You will be able to select a custom gift card design, amount and write a personal note. Buying gifts for others is great, but don't forget to treat yourself, too! Purchase an e-gift card for yourself and pull it up on your phone to buy tickets at the box office. \n\n• My Movies – No, you won’t actually own the movies that you add to this list, but you can find all the upcoming movies you want to see and get notified as soon as tickets go on sale.\n\n• Offers – Keep all AMC special offers at your fingertips so you’re always in-the-know and ready to save.\n\n• AMC Buzz – Want to know more about the movies than your coworkers? Stay up-to-date with our Facebook posts, tweets, AMC Movie News blog and YouTube videos!\n\n• Augmented Reality – Want to see the trailer for that new Robert Downey Jr. movie coming out? Look no further than the movie poster! Head to My AMC, open the Augmented Reality feature, and hold your viewfinder over a movie poster to watch Robert Downey Jr. come to life. Double tap to make it full screen and enjoy the experience!\n\niPad Exclusives\n• Filter theatres by their amenities, so if you want to see the latest blockbuster in awesome RealD® 3D, you’ll know where to find it, or if you want to have a cocktail on girl’s night, you can find an AMC with a MacGuffins® Bar & Lounge.\n\n• Planning a hot date for a couple weeks from now? Want to know when that Jennifer Lawrence movie finally comes out? It’s easy to search for upcoming movie releases using the calendar view.", "artistName": "VMBC", "artworkUrl512": "http://a546.phobos.apple.com/us/r30/Purple3/v4/78/65/65/78656505-329a-d3df-5a03-6c90f6a6772b/mzl.zhkbdnlc.png", "version": "3.3", "primaryGenreId": 6016, "primaryGenreName": "Entertainment", "fileSizeBytes": "32470622", "price": 0.0, "isGameCenterEnabled": false, "trackCensoredName": "AMC Theatres", "genreIds": ["6016", "6012"], "trackName": "AMC Theatres", "releaseNotes": "Introducing the all new shopping cart! Want to buy tickets for a few different movies? Maybe a gift card and AMC Stubs membership too? Browse our products, add them to your cart, and whenever you’re ready, checkout all in one transaction! We’ve also updated the menu to make it quicker and easier for you to access whatever you need. And as always, we’ve squashed a few bugs. Happy movie going!", "sellerUrl": "http://www.vmbc.com", "screenshotUrls": ["http://a3.mzstatic.com/us/r30/Purple1/v4/63/9e/a5/639ea5c9-da73-38ff-b9d9-65c2e3b6ba3b/screen322x572.jpeg", "http://a3.mzstatic.com/us/r30/Purple5/v4/09/ba/d3/09bad354-61e7-089a-bc30-3931178e5585/screen322x572.jpeg", "http://a3.mzstatic.com/us/r30/Purple5/v4/6f/71/26/6f712659-4c3a-8437-ab02-3d9765ea7f34/screen322x572.jpeg", "http://a2.mzstatic.com/us/r30/Purple3/v4/2e/1b/68/2e1b68de-1159-796a-86eb-eccd079e3fcd/screen322x572.jpeg"], "userRatingCount": 1817, "trackContentRating": "4+", "formattedPrice": "Free", "artistViewUrl": "https://itunes.apple.com/us/artist/vmbc/id396622308?uo=4", "kind": "software", "averageUserRatingForCurrentVersion": 2.5, "sellerName": "VMBC", "supportedDevices": ["iPadFourthGen", "iPadThirdGen", "iPadFourthGen4G", "iPodTouchourthGen", "iPadMini4G", "iPhone-3GS", "iPad2Wifi", "iPhone5s", "iPodTouchFifthGen", "iPhone4", "iPadMini", "iPhone5c", "iPadThirdGen4G", "iPhone4S", "iPad23G", "iPhone5"], "artworkUrl100": "http://a546.phobos.apple.com/us/r30/Purple3/v4/78/65/65/78656505-329a-d3df-5a03-6c90f6a6772b/mzl.zhkbdnlc.png", "bundleId": "com.vmbc.amc", "trackViewUrl": "https://itunes.apple.com/us/app/amc-theatres/id509199715?mt=8&uo=4", "minimumOsVersion": "6.0", "artworkUrl60": "http://a697.phobos.apple.com/us/r30/Purple5/v4/42/d8/52/42d85208-b62d-d599-afc3-d7e52a6f8699/Icon.png", "averageUserRating": 2.5}