{"contentAdvisoryRating": "4+", "features": [], "languageCodesISO2A": ["EN"], "ipadScreenshotUrls": [], "releaseDate": "2012-03-29T07:00:00Z", "currency": "USD", "artistId": 509253949, "userRatingCountForCurrentVersion": 259, "wrapperType": "software", "advisories": [], "genres": ["Health & Fitness", "Social Networking"], "trackId": 509253726, "description": "• Work with expert trainers who will help you reach your fitness goals\n• Easily track any workout you can imagine. Use any of our free workouts or make up your own.\n• Stay motivated by joining the awesome Fitocracy community and meeting other fitness-minded folks\n\nFitocracy motivates you and helps you succeed at fitness and level up in real life. We make exercise fun! Track your workouts, earn points, unlock achievements, beat quests, and slay the laziness dragon. Join the best fitness community on the planet and become the person you were meant to be.\n\n* An App of the Year by Men's Journal *\n* Mashable's Top Innovation in Health & Fitness Winner *\n\n\"This app is magical, revolutionary, and most importantly, life changing. Get it.\"\n\n\"Convinced that the new Fitocracy app has set a new high bar for iOS visual design. There's nothing else like it, just perfect.\"\n\n\"I used Fitocracy to track my fitness progress as I prepared for Miss America, and Fitocrats were a big part of my success. Being a part of such a supportive, encouraging online community made getting and staying in shape fun for me.\" - Miss America 2013\n\n\"It's like Facebook but it will make you a better person: harder, faster, stronger.\"\n\n\"After a little over two months of using Fitocracy I gained 15 pounds of muscle mass. I've never been called cut before in my life until a few weeks ago. The app makes it all the more amazing.\"\n\n\"I promise you, no other service will motivate you to stay in shape more than this one will. It's easily the best fitness tracker in the App Store.\"\n\n\"Fitocracy is a genius idea. It takes the addictive leveling system of games such as Pokemon or Call of Duty and combines it with your workout. You start at Level 1, and each workout you do, depending on its difficulty, rewards you with points that eventually cause you to level up. It's motivation enough to watch how many points each workout will give you, then to try to top the points you earn each time you workout.\"\n\n* Featured in CNN, TechCrunch, Lifehacker, Kotaku, The NY Observer, Apple App Store, Men's Journal, Mashable *\n\nFEATURES\n• Incredible speed: arrange and track your workout with minimal effort.\n• Powerfully flexible: rearrange workouts, add supersets and circuits, save routines, and more\n• Free workout routines: get awesome workouts from the best fitness coaches, whether you're at home or at the gym\n• Join fitness teams led by expert trainers who provide personalized workout and nutrition programs\n• Embark on an epic adventure: Unlock achievements to visualize your progress. Beat quests to push yourself and take on new challenges.\n• Be inspired: Follow other Fitocrats to get daily inspiration and join in on conversations.\n• Ultra motivation: Join an amazing community of supportive Fitocrats who will keep you motivated on your journey. If competition's your thing, there's plenty of that too.\n• Import/Export: Syncs with RunKeeper, export history to images and files.\n\nGET MORE AT WWW.FITOCRACY.COM\n• Get support and motivation from our amazing community of Fitocrats just like you\n• Your workouts are always synced between the web and the iPhone app\n• Automatically post your progress to Twitter and Facebook (optional)\n• Browse other users' profiles and find out what works for people just like you\n\nPRESS\n\"It’s about time someone created a RPG for fitness\" - TechCrunch\n\n\"...the best example yet of a digital domain applying the basics of games to getting in shape.\" - The Globe And Mail\n\n\"...provided me with a motivational breakthrough.\" - Kotaku\n\nGETTING STARTED GUIDES\nNeed any help getting started with Fitocracy? Check out this short and sweet walkthrough video! http://ftcy.co/188T3BJ\nWant to see more? http://ftcy.co/1u2V51G", "artistName": "Fitocracy, Inc.", "artworkUrl512": "http://a809.phobos.apple.com/us/r30/Purple3/v4/da/34/b2/da34b26b-1bc4-1eb1-c40e-ac0ce31eed7e/mzl.tqpgehhd.png", "version": "2.6", "primaryGenreId": 6013, "primaryGenreName": "Health & Fitness", "fileSizeBytes": "36194253", "price": 0.0, "isGameCenterEnabled": false, "trackCensoredName": "Fitocracy - Exercise log and online personal trainer", "genreIds": ["6013", "6005"], "trackName": "Fitocracy - Exercise log and online personal trainer", "releaseNotes": "- Filter the Team Fitness coaches. Find the right coach for you.\n- Ready to take your training to the next level? Hire a Coach from within the app!\n- General bug fixes\n- Time counts down in Playback Mode", "sellerUrl": "http://www.fitocracy.com", "screenshotUrls": ["http://a4.mzstatic.com/us/r30/Purple4/v4/05/a7/e4/05a7e439-6630-514d-b27e-912091ef49b3/screen1136x1136.jpeg", "http://a3.mzstatic.com/us/r30/Purple4/v4/a6/3e/5d/a63e5d2c-531c-910a-a004-2231517a0ff1/screen1136x1136.jpeg", "http://a1.mzstatic.com/us/r30/Purple5/v4/a9/03/28/a90328b1-4c91-fe3d-8e7d-bbd924b0af28/screen1136x1136.jpeg", "http://a5.mzstatic.com/us/r30/Purple5/v4/b3/4e/ae/b34eae91-95e7-3872-9193-31d0f71d61f3/screen1136x1136.jpeg", "http://a2.mzstatic.com/us/r30/Purple3/v4/80/f6/b9/80f6b990-fc55-38bd-d117-e387324b90f2/screen1136x1136.jpeg"], "userRatingCount": 13596, "trackContentRating": "4+", "formattedPrice": "Free", "artistViewUrl": "https://itunes.apple.com/us/artist/fitocracy-inc./id509253949?uo=4", "kind": "software", "averageUserRatingForCurrentVersion": 4.5, "sellerName": "Fitocracy Inc.", "supportedDevices": ["iPadThirdGen4G", "iPadThirdGen", "iPadMini", "iPhone5", "iPad2Wifi", "iPadMini4G", "iPadFourthGen", "iPhone5s", "iPodTouchFifthGen", "iPhone4S", "iPadFourthGen4G", "iPhone4", "iPad23G", "iPhone5c"], "artworkUrl100": "http://a809.phobos.apple.com/us/r30/Purple3/v4/da/34/b2/da34b26b-1bc4-1eb1-c40e-ac0ce31eed7e/mzl.tqpgehhd.png", "bundleId": "com.release.fitocracy", "trackViewUrl": "https://itunes.apple.com/us/app/fitocracy-exercise-log-online/id509253726?mt=8&uo=4", "minimumOsVersion": "7.0", "artworkUrl60": "http://a1605.phobos.apple.com/us/r30/Purple5/v4/a6/1d/8b/a61d8b93-6e26-937e-f429-ac94ed494a5c/AppIcon60x60_2x.png", "averageUserRating": 4.5}