{"contentAdvisoryRating": "4+", "features": [], "languageCodesISO2A": ["EN"], "ipadScreenshotUrls": ["http://a1.mzstatic.com/us/r30/Purple3/v4/ea/56/ed/ea56ed80-44c6-bfe8-d0ce-dc8fdfe4afdd/screen480x480.jpeg", "http://a3.mzstatic.com/us/r30/Purple1/v4/23/f0/4b/23f04b28-ff6f-7a13-fd63-2f0c7f9b153a/screen480x480.jpeg", "http://a2.mzstatic.com/us/r30/Purple5/v4/72/a6/1d/72a61d5e-d57c-75bd-5153-f3b9a37aa439/screen480x480.jpeg", "http://a3.mzstatic.com/us/r30/Purple1/v4/db/34/07/db340727-26bf-90c3-d2ac-ecf5be2a9312/screen480x480.jpeg", "http://a3.mzstatic.com/us/r30/Purple3/v4/4b/13/9b/4b139b5a-b39a-0ec0-a3ff-9591a06a87ff/screen480x480.jpeg"], "releaseDate": "2012-03-26T18:04:18Z", "currency": "USD", "artistId": 478265263, "userRatingCountForCurrentVersion": 34, "wrapperType": "software", "advisories": [], "genres": ["Education", "Games", "Educational", "Puzzle"], "trackId": 509343934, "description": "+ Winner of the 2014 Family & Parent Choice Award, Kappi Gold Award, NAPPA Gold Award & TeachersWithApps Award\n+ 100+ curriculum based preschool & kindergarten learning games for 2 years old to 6 years old kids\n+ Learning Games, Books and Mother Goose Nursery Rhymes\n+ Detailed Report Card of the child's performance\n+ Personalized learning for math, reading and writing\n\n\n+ Fun Learning Games for 2 year olds kids\nShapes, Colors, Fruits, Quantities, ABC's, Animal Names, Memory Puzzle, Counting\n\n+ Learn to Read for 3 year old kids\nTracing, Alphabet Sounds, Consonant, Blending, Reading, Spelling, Vocabulary.\n\n+ Early Reading, Nursery Rhymes and Interactive books for kids that reads a story for 4 year old kids\nThe Itsy Bitsy Spider, The Caterpillar, Mary Had A Little Lamb, Farmer In The Dell, Two Birds. Five Little Monkeys, The Stars, The Lambkins, Five Little Ducks, Bedtime, Twinkle twinkle little star, Early to Bed, Early to Rise, Rock-a-bye Baby, Little Miss Maya, Who Flew The Rocket, ABC Hide n Seek, I Am a King, Rub-A-Dub Dub, Little Boy Blue, Gregory Griggs, Bow Wow Goes The Dog, Pairs Or Pears, This Little Piggy, Little Bo Peep, Mary Mary Quite Contrary.\n\n+ Fun Math Learning Games for 5 year old kids\nNumber, Counting, Tracing, Addition, Subtraction, Multiplication, Factoring & Distribution,\n\n+ Math Games & Worksheets for 6 year old kids\nSubtraction as take-away, Counting, Addition and subtraction, problem solving, Zero as a number\n\n+ Geometry & Math Puzzle for 7 year olds\nShape Puzzle, Story Telling, Coloring Book, Space Puzzle, Balance Puzzle, Pattern Matching Puzzle.\n\n+ Fun Learning Games for Toddlers:\n- Toothbrush Fun:  Kid is a dentist, that is showing Icky how to brush his teeth.  A fun toothbrush and cleanup learning game for kids.\n- Bathtime Fun: A bathing, washing, showering and cleanup game for kids.  Kids can sing along with Icky in the shower with different color shampoos, shape and bubbles.  A fun, educational and learning game for kids.\n- Dressing Room: A dressup, makeover and a fashion game.  This game lets your kid change clothes shoes outfit hair dressing.  Setup in a dressing room with fancy outfits to play dress up and makeover.\n\n\n+ The curriculum is mapped to Common Core State Standard (CCSS)\n\n+ Monthly Auto-renew Subscription Details:\n- TopIQ is available through monthly auto-renew subscription only.\n- The monthly auto-renew subscription gives you access to all Agnitus original content.  Access to the skills, games, books and reports is based on your monthly subscription level.  In addition, you get access to all NEW games & books as they are released.\n- Monthly Subscription will be charged to your iTunes Account at confirmation of purchase.\n- Subscription automatically renews unless auto-renew is turned off at least 24-hours before the end of the current period\n- Account will be charged for renewal within 24-hours prior to the end of the current period at your current subscription level.\n- Subscriptions may be managed by the you and auto-renewal may be turned off by going to the your iTune Account Settings after purchase.\n- No cancellation of the current subscription is allowed during active subscription period.\n- Any unused portion of a free trial period, if offered, will be forfeited when the user purchases a subscription.\n\n+ Monthly Subscriptions Levels:\n(1) Agnitus Explorer:      $0.99/month gives you access to ONE game/skill & ONE book per day.  You can pick a different book and a game each day on one device.\n\n(2) Agnitus Genius:          $3.99/month gives you access to ALL games & books on one device.\n\n(3) Agnitus Full Access:  $6.99/month gives you access to ALL games and books on all devices i.e. phone, tablet and desktop.  Access to child’s report card, ability to turn games on/off, kids global ranking, data backup, personalized learning for your child and ability to add multiple kid accounts.\n\nhttp://www.agnitus.com/terms.html", "artistName": "Agnitus", "artworkUrl512": "http://a1204.phobos.apple.com/us/r30/Purple4/v4/64/f4/6a/64f46acc-16d5-3d78-be91-d35baeac566e/mzl.pjimzcqy.png", "version": "2.4.0", "primaryGenreId": 6017, "primaryGenreName": "Education", "fileSizeBytes": "557380866", "price": 0.0, "isGameCenterEnabled": false, "trackCensoredName": "TopIQ Kids Learning Games for Preschool, Kindergarten & 1st Grade", "genreIds": ["6017", "6014", "7008", "7012"], "trackName": "TopIQ Kids Learning Games for Preschool, Kindergarten & 1st Grade", "releaseNotes": "- Bugs fixed for iOS 8\n- Introducing 3 New Story books\n     1. Days of the Month\n     2. Heads Shoulders Knees and Toes\n     3. Pup the Puppy", "sellerUrl": "http://www.agnitus.com", "screenshotUrls": [], "userRatingCount": 3301, "trackContentRating": "4+", "formattedPrice": "Free", "artistViewUrl": "https://itunes.apple.com/us/artist/agnitus/id478265263?uo=4", "kind": "software", "averageUserRatingForCurrentVersion": 3.5, "sellerName": "AGNITUS, INC.", "supportedDevices": ["iPadMini4G", "iPad2Wifi", "iPadThirdGen", "iPadThirdGen4G", "iPadMini", "iPad23G", "iPadFourthGen4G", "iPadFourthGen"], "artworkUrl100": "http://a1204.phobos.apple.com/us/r30/Purple4/v4/64/f4/6a/64f46acc-16d5-3d78-be91-d35baeac566e/mzl.pjimzcqy.png", "bundleId": "com.agnitus.mainapp", "trackViewUrl": "https://itunes.apple.com/us/app/topiq-kids-learning-games/id509343934?mt=8&uo=4", "minimumOsVersion": "6.0", "artworkUrl60": "http://a1913.phobos.apple.com/us/r30/Purple3/v4/5a/0d/e4/5a0de498-d90b-8640-455e-83729e1173ed/Icon-72.png", "averageUserRating": 4.0}