{"contentAdvisoryRating": "4+", "features": [], "languageCodesISO2A": ["EN"], "ipadScreenshotUrls": [], "releaseDate": "2012-04-13T21:46:20Z", "currency": "USD", "artistId": 478058439, "userRatingCountForCurrentVersion": 18, "wrapperType": "software", "advisories": [], "genres": ["Navigation", "Weather"], "trackId": 511107467, "description": "Available exclusively to AOPA members, AOPA FlyQ Pocket is the powerful aviation app every pilot needs. It’s brilliantly easy to use and astonishingly fast.  It takes full advantage of the Internet when available but also stores information on the device for use without the Internet.\n\nAOPA FlyQ Pocket is the result of a partnership between AOPA and Seattle Avionics. FlyQ combines the convenience of the old AOPA Airports app with aviation weather and flight planning capability. It harnesses the legendary AOPA Airports database, putting FBO and aviation business information details only a tap away. Now you can plan a flight on your iPhone with an auto-router that wind-optimizes your flight to get you there as fast as possible. Victor Airways, GPS Direct routing, Jet Airways—FlyQ Pocket is ready for it all.\n\nUsing FlyQ Pocket is simple because all major functions are always just a tap away.\n\nAirport Information\n\nStart FlyQ Pocket and within about 3 seconds it finds the nearest airports and displays succinct weather and operational details about them—without even tapping a button. Or use the Search feature to find airports by ident or name.  Even browse by state/city to select airports without typing.  Want more info about an airport? Tap and all the details you need (but no excess clutter) appears instantly. On the first airport page, you immediately see operational information, runways, navaids, and an embedded satellite map image of the airport. Want to call the local ATIS? Tap the phone number and your iPhone quickly connects you. Tap the weather tab and see the current temperature and sky conditions, a Nexrad radar image of the area, the nearest METARs and TAFs, winds-aloft, and even an official DUAT or DUATS weather briefing. Best of all for those of us who aren’t 21 anymore, one tap zooms the METARs, TAFs and weather graphics to full screen, large font versions that anyone can read—even in turbulence. Another tap gives you an easy-to-read 7 day forecast.  Quickly find the FBO details you need—fuel information, telephone numbers, rental cars, nearby attractions and more.  The Favorites feature gives quick access to commonly-used airports.\n\nWeather Information\n\nWant to see what the weather is like at your current location? Tap the Weather tab and FlyQ Pocket instantly locks on to your GPS position and displays temperature, Nexrad images and local METARs and TAFs. Or choose from a large gallery of US and Canadian weather graphics, many of which are animated. Quickly check the weather anywhere on the globe by entering an airport identifier, city name, even a zip code. Of course, AOPA FlyQ keeps track of your recent selections for quick future access and stores graphics and METARs/TAFs on the phone so they’re available even when you’re not connected to the Internet (such as in flight).\n\nFlight Planning\n\nNo time to plan a flight? Give us 30 seconds and watch FlyQ Pocket assemble the perfect wind-optimized flight plan. Tell FlyQ Pocket where to depart, where to land, and how to fly there (Victor airways, Jet Airways or GPS Direct) and AOPA FlyQ Pocket plots the whole course including all the navaids and intersection—not a simple straight line. It even uses the winds-aloft forecast to give you the ideal altitude for each leg of your trip. To make your life easier, FlyQ Pocket automatically requests an official DUATS or DUAT weather briefing so you’re good to go. And since filing the flight plan takes one tap and about 3 seconds, it’s easy and quick to fly safely. FlyQ Pocket remembers your recent flights and home airport so you can often plan a flight by picking from a list of recently used airports rather than typing.\n\nMoving Map and Approach Plates\n\nFlyQ Pocket does not include a moving map or approach plates because it’s designed for pre-flight planning rather than in-flight use.  See new FlyQ EFB for a full-featured iPad app that includes a moving map.", "artistName": "Aircraft Owners and Pilots Association", "artworkUrl512": "http://a1098.phobos.apple.com/us/r30/Purple6/v4/76/b4/86/76b486b0-f15e-a487-7624-d7dc8f4bf6a4/mzl.pzjvoian.png", "version": "1.1.1", "primaryGenreId": 6010, "primaryGenreName": "Navigation", "fileSizeBytes": "23446159", "price": 0.0, "isGameCenterEnabled": false, "trackCensoredName": "AOPA FlyQ Pocket", "genreIds": ["6010", "6001"], "trackName": "AOPA FlyQ Pocket", "releaseNotes": "iOS 7 compatibility fix.", "sellerUrl": "http://www.aopa.org", "screenshotUrls": ["http://a5.mzstatic.com/us/r30/Purple/v4/66/66/31/66663166-582a-bb1b-70e0-ccf88585d734/screen1136x1136.jpeg", "http://a1.mzstatic.com/us/r30/Purple/v4/89/8a/ef/898aef4f-833d-a8ca-7920-a94c64180985/screen1136x1136.jpeg", "http://a5.mzstatic.com/us/r30/Purple/v4/3f/9b/79/3f9b7970-7156-ee5c-5278-beed83f6f493/screen1136x1136.jpeg", "http://a3.mzstatic.com/us/r30/Purple/v4/a5/ba/63/a5ba638d-0332-c4c4-6b69-7c347d2b8d5d/screen1136x1136.jpeg", "http://a1.mzstatic.com/us/r30/Purple/v4/9e/f2/a6/9ef2a653-e255-320c-9835-98f80734ae17/screen1136x1136.jpeg"], "userRatingCount": 178, "trackContentRating": "4+", "formattedPrice": "Free", "artistViewUrl": "https://itunes.apple.com/us/artist/aircraft-owners-pilots-association/id478058439?uo=4", "kind": "software", "averageUserRatingForCurrentVersion": 4.5, "sellerName": "Aircraft Owners and Pilots Association (AOPA)", "supportedDevices": ["iPad2Wifi", "iPadFourthGen", "iPodTouchourthGen", "iPhone4S", "iPad23G", "iPadMini", "iPhone5c", "iPadThirdGen", "iPhone5", "iPodTouchFifthGen", "iPadFourthGen4G", "iPadThirdGen4G", "iPodTouchThirdGen", "iPhone-3GS", "iPhone5s", "iPadWifi", "iPad3G", "iPhone4", "iPadMini4G"], "artworkUrl100": "http://a1098.phobos.apple.com/us/r30/Purple6/v4/76/b4/86/76b486b0-f15e-a487-7624-d7dc8f4bf6a4/mzl.pzjvoian.png", "bundleId": "org.aopa.flyq", "trackViewUrl": "https://itunes.apple.com/us/app/aopa-flyq-pocket/id511107467?mt=8&uo=4", "minimumOsVersion": "4.3", "artworkUrl60": "http://a397.phobos.apple.com/us/r30/Purple4/v4/e9/41/f6/e941f6ba-1cca-f6ce-641d-bb80f6dbe444/flyq_57x57.png", "averageUserRating": 4.0}