{"contentAdvisoryRating": "4+", "features": [], "languageCodesISO2A": ["EN"], "ipadScreenshotUrls": [], "releaseDate": "2012-04-03T00:40:58Z", "currency": "USD", "artistId": 281969992, "userRatingCountForCurrentVersion": 11, "wrapperType": "software", "advisories": [], "genres": ["Sports", "Entertainment"], "trackId": 513135722, "description": "MLB.com At the Ballpark is your favorite mobile companion when visiting any Major League Baseball ballpark. This official MLB ballpark application perfectly complements and personalizes your trip with My Journal, social media, offers, rewards and exclusive content.\n\nAdditional features available at select MLB ballparks include automated check-in and offers with iBeacon technology, mobile food ordering and seat and experience upgrades.\n\n**** NEW IN 2014 ****\n• Check-in automatically with iBeacon technology (select ballparks only)*\n• Newly-designed for iOS7 \n\n**** At the Ballpark features ****\n• MyTickets Mobile for delivery and storage of all MLB tickets sold (select clubs only)\n• Upload and share personal photos from your ballpark visits, dating back to 2005\n• View team statistics and watch video highlights from games attended\n• Ballpark and player entrance music\n• Social media clubhouse, including social rewards for select clubs\n• Complete tickets section, featuring special offers by club\n• Seat and experience upgrade functionality at select ballparks**\n• Passbook integration for digital ticket delivery and storage (select clubs only)\n• Check-in for ballpark offers and rewards\n• Interactive concourse maps and directory\n• Social media integration\n• Customize to feature a designated favorite MLB ballpark\n• Team schedule, ticket information and sales and promotional event listings\n• Access to food and beverage ordering available at select parks***\n• Directions and parking information\n• A to Z Guides for every ballpark\n• My Journal: Personalized check-in history for ballparks visited\n\n* iBeacon technology:\nChase Field (Arizona), Turner Field (Atlanta), Oriole Park @ Camden Yards (Baltimore), Fenway Park (Boston), U.S. Cellular Field (Chicago), Great American Ball Park (Cincinnati), Progressive Field (Cleveland), Kauffman Stadium (Kansas City), Dodger Stadium (Los Angeles), Miller Park (Milwaukee), Target Field (Minnesota), Citi Field (New York), O.co Coliseum (Oakland), Citizens Bank Park (Philadelphia), PNC Park (Pittsburgh), Petco Park (San Diego), AT&T Park (San Francisco), Safeco Field (Seattle), Busch Stadium (St. Louis), Tropicana Field (Tampa Bay) and Globe Life Park (Texas), Nationals Park (Washington DC), Minute Maid Park (Houston), Marlins Park (Miami), Rogers Centre (Toronto), Angel Stadium (Anaheim), Comerica Park (Detroit), Coors Field (Denver)\n\n** Seat and experience upgrades:\nAngel Stadium (Anaheim), Chase Field (Arizona), Turner Field (Atlanta), Oriole Park @ Camden Yards (Baltimore), Fenway park (Boston), U.S. Cellular Field (Chicago), Great American Ball Park (Cincinnati), Minute Maid Park (Houston). Kauffman Stadium (Kansas City), Marlins Park (Miami), Miller Park (Milwaukee), Target Field (Minneapolis), Citi Field (New York), O.co Coliseum (Oakland), Citizens Bank Park (Philadelphia), Petco Park (San Diego), AT&T Park (San Francisco), Safeco Field (Seattle), Tropicana Field (Tampa Bay) and Globe Life Park (Texas). Additional ballparks will be added as they become available.\n\n*** Food & Beverage or Merchandise mobile ordering:\nCitizens Bank Park (Philadelphia), Chase Field (Phoenix), Citi Field (New York) and Marlins Park (Miami). Turner Field (Atlanta), Additional ballparks will be added as they become available.\n\nContinued use of GPS running in the background can dramatically decrease battery life.\n\n© 2014 MLB Advanced Media, L.P. All Major League Baseball trademarks and copyrights used herein are the property of the applicable MLB entity. All rights reserved.", "artistName": "MLB.com", "artworkUrl512": "http://a1995.phobos.apple.com/us/r30/Purple3/v4/bb/a8/3d/bba83d28-074f-2b02-053d-028a662570f2/mzl.sffsfzig.png", "version": "3.2.3", "primaryGenreId": 6004, "primaryGenreName": "Sports", "fileSizeBytes": "18206095", "price": 0.0, "isGameCenterEnabled": false, "trackCensoredName": "MLB.com At the Ballpark", "genreIds": ["6004", "6016"], "trackName": "MLB.com At the Ballpark", "releaseNotes": "• Improved Points of Interest experience at select ballparks, with iBeacon technology\n• General usage improvements", "sellerUrl": "http://mlb.mlb.com/mobile/", "screenshotUrls": ["http://a1.mzstatic.com/us/r30/Purple4/v4/83/cd/df/83cddfe0-2cff-263f-9ff7-2fd3aa9222fc/screen1136x1136.jpeg", "http://a3.mzstatic.com/us/r30/Purple4/v4/b5/75/75/b575758e-6b29-7934-256d-04060556809c/screen1136x1136.jpeg", "http://a4.mzstatic.com/us/r30/Purple5/v4/db/67/85/db678554-6296-6ecc-7ecb-5ae476c4d529/screen1136x1136.jpeg", "http://a1.mzstatic.com/us/r30/Purple3/v4/5d/ff/7e/5dff7e12-1afe-afef-8c2e-941d522c68cb/screen1136x1136.jpeg", "http://a4.mzstatic.com/us/r30/Purple3/v4/d6/7c/55/d67c55dd-28a5-fbe3-431e-18b0c1720a9d/screen1136x1136.jpeg"], "userRatingCount": 326, "trackContentRating": "4+", "formattedPrice": "Free", "artistViewUrl": "https://itunes.apple.com/us/artist/mlb.com/id281969992?uo=4", "kind": "software", "averageUserRatingForCurrentVersion": 3.5, "sellerName": "Major League Baseball Advanced Media", "supportedDevices": ["iPhone4", "iPad23G", "iPad2Wifi", "iPhone4S", "iPodTouchFifthGen", "iPadThirdGen4G", "iPadMini4G", "iPadFourthGen4G", "iPadThirdGen", "iPadFourthGen", "iPhone5c", "iPhone5s", "iPadMini", "iPhone5"], "artworkUrl100": "http://a1995.phobos.apple.com/us/r30/Purple3/v4/bb/a8/3d/bba83d28-074f-2b02-053d-028a662570f2/mzl.sffsfzig.png", "bundleId": "com.mlb.AtTheBallpark", "trackViewUrl": "https://itunes.apple.com/us/app/mlb.com-at-the-ballpark/id513135722?mt=8&uo=4", "minimumOsVersion": "7.0", "artworkUrl60": "http://a1319.phobos.apple.com/us/r30/Purple3/v4/f9/2f/fe/f92ffed6-3d07-4209-af1b-0aa7850bb3ac/AppIcon60x60_2x.png", "averageUserRating": 3.0}