{"contentAdvisoryRating": "4+", "features": [], "languageCodesISO2A": ["EN"], "ipadScreenshotUrls": [], "releaseDate": "2012-04-24T14:40:30Z", "currency": "USD", "artistId": 495996756, "userRatingCountForCurrentVersion": 16, "wrapperType": "software", "advisories": [], "genres": ["Lifestyle", "Utilities"], "trackId": 516439697, "description": "Never forget a coupon at home again! The biggest collection of in-store coupons of any app. \n\n• Updated for iOS 8, iPhone 6, and 6 Plus • About.com 2013 Reader's Choice - Best Shopping App • 2013 Appy Award • Featured by Apple • #1 Lifestyle app • Passbook enabled •\n\nToss out the scissors and let your iPhone camera do the clipping. Simply snap a picture of a printed offer, and SnipSnap magically converts all the text, images and barcodes into a mobile-optimized offer, which you can redeem off your screen. The app works at many national retailers, though not for manufacturer coupons (yet).\n\nGather up all the coupons you have lying around. Whether they're from the Sunday paper, the mail, or just ones you found buried in your purse or couch, SnipSnap will mobilize them in a matter of minutes. When you get to a store, pull up the coupon barcode, promo code, or photograph and present to the cashier to redeem. \n\nDon't have any coupons handy to scan? Use the Discover screen of the app to see what coupons your friends and family have snipped. You can also snip from or follow our featured coupon bundles, and search our massive database of coupons to find one on demand. Best of all: We'll remind you when you enter a store you have coupons saved for, or when a coupon expiration date is nearing. Aw, snap!\n\nFEATURES:\n• IN-STORE REMINDERS: When you enter a store, SnipSnap delivers a push notification to remind you what coupons you have saved there.\n\n• SCANS ALL COUPONS: Whether you get coupons from the newspaper, mail, magazines or elsewhere, you can import all of them into the app.\n\n• FOLLOW FRIENDS: Connect to friends from your address book, Facebook, or Twitter accounts. Option to share your couponing activity to Facebook.\n\n• EXPIRATION DATE ALERTS: Get notified when your coupons' expiration dates are approaching.\n\n• STORE SUCCESS RATING: See how successful other users have been in redeeming at your favorite stores.\n\n***\nREVIEWS:\n\nClipping and saving coupons is the most classic way of saving money, but in today's digital world, it feels rather archaic. SnipSnap for iPhone lets you say goodbye to physical coupons.\n—Leanna Lofte, iMore\n\nIt’s the ideal companion to those ready to leave behind the old shoebox and scissors for something a little more mobile.\n—The Daily\n\nSnipSnap is easy to use with a beautiful user interface. Plus, it’s useful in the context of daily life. ...  This app is a must download.\n—Kathryn Hough, techli.com\n\nThe moment I managed to get 10% lopped off of a bill at an Indian restaurant thanks to a coupon someone else shared sealed the deal — I’m a couponer now (my girlfriend will be thrilled).\n—Chris Velazco, TechCrunch\n\nWhen the occasional need arises for a run to Bed Bath & Beyond, I rummage through the junk drawer ... It is no way to live, but now that I am using SnipSnap, my fruitless junk-drawer searches are a thing of the past.\n—Matt Elliot, CNET\n\nBefore you buy anything online or off, search first to see if there's coupons for it. The coupon app SnipSnap is great for finding and loading coupons into your mobile phone.\n—The Today Show\n \n***\n\nLOCATION REPORTING: SnipSnap primarily uses Apple's approved method for reporting location changes in the background. Note that this is primarily invoked and reported upon a significant location change event -- e.g. moving between two cell towers -- or if you are within close proximity to a mall or shopping center, when the GPS is briefly activated. As a result it does not typically cause the battery to be drained (unless you are, say, driving all day in the car). Location reporting can be easily disabled via the \"Location Notifications\" toggle in the Settings screen. (Continued use of GPS running in the background can dramatically decrease battery life.)\n\n** Works at most retail, restaurant and local businesses. Manufacturer coupons (redeemed at grocery stores) not supported yet, but will work with a future app update. **", "artistName": "SnipSnap", "artworkUrl512": "http://a1712.phobos.apple.com/us/r30/Purple3/v4/68/95/37/68953738-89fb-01f3-d9b7-952965f5c9d5/mzl.fdjcsrmp.png", "version": "2.9.1", "primaryGenreId": 6012, "primaryGenreName": "Lifestyle", "fileSizeBytes": "18823566", "price": 0.0, "isGameCenterEnabled": false, "trackCensoredName": "SnipSnap Coupon App", "genreIds": ["6012", "6002"], "trackName": "SnipSnap Coupon App", "releaseNotes": "Minor improvements and bug fixes.", "sellerUrl": "http://snipsnap.it/", "screenshotUrls": ["http://a4.mzstatic.com/us/r30/Purple1/v4/ff/c3/72/ffc372b7-f9fb-1023-79ff-c5405021ac6b/screen1136x1136.jpeg", "http://a4.mzstatic.com/us/r30/Purple4/v4/fa/ba/9a/faba9a05-a9d9-d80c-7701-ee4719f6085a/screen1136x1136.jpeg", "http://a5.mzstatic.com/us/r30/Purple3/v4/44/e5/3b/44e53b6e-525f-a253-1458-06b6e5ae011e/screen1136x1136.jpeg", "http://a3.mzstatic.com/us/r30/Purple4/v4/1b/de/84/1bde8403-3f1f-bedf-750a-567ea0ab549c/screen1136x1136.jpeg", "http://a3.mzstatic.com/us/r30/Purple4/v4/f4/f0/66/f4f0663c-2d21-c08c-80b3-7db04a48aa9d/screen1136x1136.jpeg"], "userRatingCount": 2116, "trackContentRating": "4+", "formattedPrice": "Free", "artistViewUrl": "https://itunes.apple.com/us/artist/snipsnap/id495996756?uo=4", "kind": "software", "averageUserRatingForCurrentVersion": 4.5, "sellerName": "SnipSnap App LLC", "supportedDevices": ["iPhone5", "iPhone4", "iPhone5s", "iPadFourthGen4G", "iPhone-3GS", "iPadThirdGen", "iPad23G", "iPodTouchourthGen", "iPadMini4G", "iPhone5c", "iPodTouchFifthGen", "iPhone4S", "iPadThirdGen4G", "iPad2Wifi", "iPadFourthGen", "iPadMini"], "artworkUrl100": "http://a1712.phobos.apple.com/us/r30/Purple3/v4/68/95/37/68953738-89fb-01f3-d9b7-952965f5c9d5/mzl.fdjcsrmp.png", "bundleId": "com.snipsnap.snipsnapapp", "trackViewUrl": "https://itunes.apple.com/us/app/snipsnap-coupon-app/id516439697?mt=8&uo=4", "minimumOsVersion": "6.0", "artworkUrl60": "http://a276.phobos.apple.com/us/r30/Purple3/v4/52/1a/bd/521abd7d-a78c-2816-34bf-cacd2edc7992/AppIcon57x57.png", "averageUserRating": 4.0}