{"contentAdvisoryRating": "9+", "features": [], "languageCodesISO2A": ["EN"], "ipadScreenshotUrls": [], "releaseDate": "2012-10-15T14:28:36Z", "currency": "USD", "artistId": 517114357, "userRatingCountForCurrentVersion": 871, "wrapperType": "software", "advisories": ["Infrequent/Mild Mature/Suggestive Themes"], "genres": ["News", "Reference"], "trackId": 517114354, "description": "*****App Store Best of 2013*****\n\nSave time and stay informed. Circa is your personal news wire, delivering to you the most important stories the minute they happen, and enabling you to follow those that matter to you so you'll never miss what happens next!\n\nLong news articles and small screens don't play well together. Circa's editors work hard to solve that problem by condensing the news and making it easier to read while on-the-go. Hunting for updates to a story you care about is also a thing of the past with Circa's new feature, Wire.  Follow any story and any time Circa's editors have an update we'll notify you, showing you only what's new – no more repetitive reading!\n\nIn Circa News 3 we've added a brand-new feature we call Wire. Each day you'll get a Daily Brief that will have stories, carefully curated by our news team, but always up-to-date in the minute you read it. With Circa, you won't have to settle for stale news digests.\n\nDon't work to get the news, let the news work for you! Our editors strive to make the news easier and faster to read, covering the day's Top Stories, and everything from World News to Technology to more Offbeat topics.\n\nFeatures:\n• Catch up quick – Never worry about intimidatingly long articles again! Circa's news team boils down stories to just the facts, keeping you informed and saving you time!\n• Follow the news – Rather than constantly re-reading articles on the same subject, Circa News allows you to follow stories that you’d like to stay up with. We'll send you push notifications each time a story you follow has been updated!\n• Never miss breaking news – Using Circa News is the easiest way to keep up with breaking news. We're very careful about what we consider breaking news, sending you a notification as events occur, then allowing you to follow stories as they develop.\n• Get a Daily Brief with all of the most important stories, delivered to you at a time of your choosing.\n• Share stories & points that you find interesting via Email, Messaging, or Facebook & Twitter.\n• Circa’s news coverage is produced by our own editorial staff from the best sources, which we provide alongside each point if you're curious.\n• Every pixel in the app, artfully crafted\n\nP.S. We also love hearing from our readers! If you'd like to send in any feedback, just hit us up at support@cir.ca and we'll be sure to respond.", "artistName": "Circa 1605, Inc.", "artworkUrl512": "http://a1058.phobos.apple.com/us/r30/Purple3/v4/6e/c2/e3/6ec2e3c9-1668-cc70-bc6f-3897d0c18527/mzl.briftigx.png", "version": "3.0.1", "primaryGenreId": 6009, "primaryGenreName": "News", "fileSizeBytes": "20325812", "price": 0.0, "isGameCenterEnabled": false, "trackCensoredName": "Circa News", "genreIds": ["6009", "6006"], "trackName": "Circa News", "releaseNotes": "First we want to thank all of you for the amazing feedback we've received about Circa News 3. Hearing just how much people are enjoying Wire has been music to our ears! We've been listening carefully to the criticisms as well, so in a future update you'll see adjustments to the design and we'll also be bringing back the option to browse specific topics! If you'd ever like to give us feedback, feel free to send us a message under \"Help & FAQ\" in the app's Menu.\n\nWe hate bugs as much as you do, so this update is all about squashing those nasties!*\n\nFixed:\n• Frequent sign outs have been fixed.\n• App appeared to be freezing, or it was taking a long time loading. No more! The app should be operating normally now for everyone.\n• App would occasionally crash when trying to sign in with Facebook\n• When sharing to Facebook and Twitter sometimes a “Connection Error” would occur\n• Sharing to Facebook will now include an image and headline\n• When signing in with Twitter, app now asks for which account to use if multiple accounts are configured with iOS\n• Other minor bug fixes\n\nNote: no real insects were harmed in the making of this version.", "sellerUrl": "http://circanews.com", "screenshotUrls": ["http://a2.mzstatic.com/us/r30/Purple3/v4/f4/89/e0/f489e03f-e981-e100-9225-aeb8028c97aa/screen1136x1136.jpeg", "http://a1.mzstatic.com/us/r30/Purple3/v4/de/bd/6e/debd6e47-4311-7429-8da3-6f03a2bd0989/screen1136x1136.jpeg", "http://a1.mzstatic.com/us/r30/Purple3/v4/a9/16/df/a916df8a-47e0-dea7-a730-33d4614a0e37/screen1136x1136.jpeg", "http://a1.mzstatic.com/us/r30/Purple3/v4/bc/a9/c7/bca9c73e-788d-291d-58f8-10e3923dcb2c/screen1136x1136.jpeg", "http://a3.mzstatic.com/us/r30/Purple3/v4/58/5a/36/585a366a-d173-322d-87d1-018588935e93/screen1136x1136.jpeg"], "userRatingCount": 8542, "trackContentRating": "9+", "formattedPrice": "Free", "artistViewUrl": "https://itunes.apple.com/us/artist/circa-1605-inc./id517114357?uo=4", "kind": "software", "averageUserRatingForCurrentVersion": 5.0, "sellerName": "Circa 1605, Inc.", "supportedDevices": ["iPhone4", "iPadThirdGen", "iPad2Wifi", "iPhone4S", "iPadFourthGen", "iPhone5c", "iPad23G", "iPadThirdGen4G", "iPhone5s", "iPodTouchFifthGen", "iPadFourthGen4G", "iPadMini4G", "iPhone5", "iPadMini"], "artworkUrl100": "http://a1058.phobos.apple.com/us/r30/Purple3/v4/6e/c2/e3/6ec2e3c9-1668-cc70-bc6f-3897d0c18527/mzl.briftigx.png", "bundleId": "com.circa.news", "trackViewUrl": "https://itunes.apple.com/us/app/circa-news/id517114354?mt=8&uo=4", "minimumOsVersion": "7.0", "artworkUrl60": "http://a1322.phobos.apple.com/us/r30/Purple3/v4/fd/16/03/fd1603cd-59bf-a1ec-e391-59e1654d3d9d/AppIcon-Release60x60_U00402x.png", "averageUserRating": 4.5}