{"contentAdvisoryRating": "4+", "features": [], "languageCodesISO2A": ["EN"], "ipadScreenshotUrls": [], "releaseDate": "2012-05-24T20:45:58Z", "currency": "USD", "artistId": 517729229, "userRatingCountForCurrentVersion": 128, "wrapperType": "software", "advisories": [], "genres": ["Food & Drink", "Travel"], "trackId": 517729226, "description": "Your iPhone can now feed you. No, your phone hasn’t learned to cook but you won’t have to either, thanks to the free, easy-to-use EAT24 Order Food Delivery & Takeout app.\n\nOrder food delivery from over 25,000 restaurants in 1,500+ cities, with more being added each day. Search from wherever you are, or wherever you’re going to be when you’re ready for some food. The EAT24 app remembers your preferences, which saves you time, and gives you coupons on a regular basis, which saves you money.\n\nWhat can our app do?\n\n- Search for specific cuisines, restaurants...even particular dishes.\n\n- It has Yelp inside. See what the foodies of Yelp think about a restaurant without leaving the app.\n\n- Eye Candy. Eat with your eyes and browse delicious food photos on the restaurant menu page. As if you weren’t hungry enough already.\n\n- In unfamiliar territory? Search by your current location, order, and the EAT24 app will have it waiting (well, really the restaurant will, but you get the idea).\n\n- Like to play favorites? We understand completely (Mom always liked us best). The EAT24 app lets you save your favorite restaurants so you can find them more easily next time.\n\n- Do you enjoy entering your credit card numbers over and over again? That’s a rhetorical question, no one does. Which is why the EAT24 app lets you scan your credit card directly into the app and securely stores your payment information for you.\n\n- Hate credit cards? Use Google Wallet or PayPal!\n\n- 24 Hour Live chat and order status support. If it isn’t right, we’ll make it right. No robots, no problem.\n\n- Cash back for future orders through our CashCoupon rewards system.\n\n- Exclusive offers and content through our Eat24Hours VIP program.\n\n- Take pictures of your food and capture the memory of your meal before you devour it. Because a picture is worth 1,000 yums, and because they make other people jealous and hungry. (And really, isn’t that the point of taking food photos?)\n\n- EAT24 Notes. Write a note about your meal right on your phone and remind yourself to order/not order an item again. (Because hunger affects memory in mysterious ways)\n\n- The My Menu feature lets you assemble an All-Star team of your favorite past-ordered items from a restaurant for easy re-ordering. And less thinking than ever before.\n\n- We added the popular Tweet My Meal function, because everyone knows that if you didn’t tweet about it, it didn’t actually happen.\n\nBest of all, once your order’s in, EAT24 handles every aspect of the delivery experience. Which means no more screwed-up orders. No more wondering where the delivery driver is. Just the ability to take back a few precious minutes of your day and enjoy. Something not quite right? Hit up our 24 Hours Live Support within the app and chat with a real human being about any issue or question you may have. We’ll make things right.\n\nTap, Relax and Enjoy with the EAT24 app.", "artistName": "EAT24", "artworkUrl512": "http://a1730.phobos.apple.com/us/r30/Purple3/v4/d8/ec/ae/d8ecaecb-e8a8-ed3a-6e83-60c2fbec2464/mzl.wbleporu.png", "version": "4.9.1", "primaryGenreId": 6023, "primaryGenreName": "Food & Drink", "fileSizeBytes": "34809173", "price": 0.0, "isGameCenterEnabled": false, "trackCensoredName": "EAT24 Order Food Delivery & Takeout", "genreIds": ["6023", "6003"], "trackName": "EAT24 Order Food Delivery & Takeout", "releaseNotes": "We killed a few bugs and improved iOS 8 optimization bla bla bla WHERE'S APPLE PAY? We know. We know. It should be in here, but the integration isn't perfect yet, and we don't want anything less than the best for you guys. It'll be here soon. Don't worry.\n\nPro Tip: Whenever you’re feeling down, just think about the fact that French fries exist.\n\nLove,\n@EAT24", "sellerUrl": "http://eat24hours.com", "screenshotUrls": ["http://a4.mzstatic.com/us/r30/Purple5/v4/91/ce/bc/91cebc66-dbc5-fe85-40da-03acdfbce675/screen1136x1136.jpeg", "http://a4.mzstatic.com/us/r30/Purple3/v4/6f/9a/29/6f9a2983-ac0c-da0a-895f-c98db87ce3f3/screen1136x1136.jpeg", "http://a2.mzstatic.com/us/r30/Purple1/v4/14/30/dd/1430ddbb-782e-55ed-3d57-d48723d54be1/screen1136x1136.jpeg", "http://a3.mzstatic.com/us/r30/Purple5/v4/7b/d6/fd/7bd6fd6f-f010-2632-e1e1-9307ce8ff5d8/screen1136x1136.jpeg", "http://a3.mzstatic.com/us/r30/Purple1/v4/31/3c/b3/313cb331-aa83-e38f-efaf-b0c378b3c0ac/screen1136x1136.jpeg"], "userRatingCount": 8979, "trackContentRating": "4+", "formattedPrice": "Free", "artistViewUrl": "https://itunes.apple.com/us/artist/eat24/id517729229?uo=4", "kind": "software", "averageUserRatingForCurrentVersion": 4.0, "sellerName": "Eat24Hours.com Inc", "supportedDevices": ["iPadFourthGen", "iPhone5s", "iPhone4S", "iPad23G", "iPhone4", "iPadFourthGen4G", "iPadThirdGen4G", "iPadThirdGen", "iPodTouchFifthGen", "iPhone5", "iPadMini", "iPad2Wifi", "iPadMini4G", "iPhone5c"], "artworkUrl100": "http://a1730.phobos.apple.com/us/r30/Purple3/v4/d8/ec/ae/d8ecaecb-e8a8-ed3a-6e83-60c2fbec2464/mzl.wbleporu.png", "bundleId": "com.eat24.eat24App", "trackViewUrl": "https://itunes.apple.com/us/app/eat24-order-food-delivery/id517729226?mt=8&uo=4", "minimumOsVersion": "7.0", "artworkUrl60": "http://a513.phobos.apple.com/us/r30/Purple5/v4/4c/ce/0c/4cce0c02-a958-28dd-23f3-df24f7933b41/icon.png", "averageUserRating": 4.5}