{"contentAdvisoryRating": "4+", "features": [], "languageCodesISO2A": ["EN"], "ipadScreenshotUrls": [], "releaseDate": "2012-08-29T13:43:51Z", "currency": "USD", "artistId": 530911648, "userRatingCountForCurrentVersion": 1, "wrapperType": "software", "advisories": [], "genres": ["Health & Fitness", "Productivity"], "trackId": 530911645, "description": "Be your best with Lift, an app that helps you put your goals into action.\n\nChoose what inspires you from our expert-led plans and community habits, or add a custom goal of your own.\n\nRecord and celebrate progress with our easy check-in system.\n\nStay on track with peer coaching, encouragement from friends, and optional reminders.\n\nWith Lift, you can...\n\n* Learn yoga and meditation through step-by-step video coaching.\n\n* Test your limits with expert-led fitness challenges and guided workouts.\n\n* Improve your diet through one of ten community diet plans, including the Slow-Carb Diet.\n\n* Build a habit around any goal.\n\nFor more visit http://blog.lift.do.  \n\nQuestions or feedback? Email us at feedback@lift.do.", "artistName": "Lift Worldwide", "artworkUrl512": "http://a669.phobos.apple.com/us/r30/Purple1/v4/0a/c3/27/0ac327a7-fcc2-3c17-f595-a623fc4caba7/mzl.nmlkhftb.png", "version": "1.9.20", "primaryGenreId": 6013, "primaryGenreName": "Health & Fitness", "fileSizeBytes": "12835829", "price": 0.0, "isGameCenterEnabled": false, "trackCensoredName": "Lift - Your Daily Coach", "genreIds": ["6013", "6007"], "trackName": "Lift - Your Daily Coach", "releaseNotes": "This release adds two things: 700 coaches for 1300 different Lift goals and Facebook login.\n\nRead on for more details about coaching.\n\n* * * * *\n\nToday's release opens access to 700 coaches on Lift covering 1300 different goals.\n\n\nLift coaches start as peers—we look for people who’ve demonstrated personal success in a goal. In this way, you can think of a Lift coach as a more experienced mentor. They’ve overcome a lot of the obstacles that stop most people from creating new habits.\n\nThe Lift coaches are focused on helping you build momentum by providing extra motivation and helping with problem solving. You’re expected to choose your own goal and be ready to make progress. They aren’t therapists and don’t need to, or want to, know your life story. Instead, they’re focused on helping you take immediate action.\n\nCoaching is $14.99/week, although we're running a promotion where the first week is free. \n\nYou can hire coaches when you go to sign up for a goal. Or, if you want to browse coaches for your existing goals, go to the Lift website:\n\nhttp://lift.do/coaching\n\n* * * * *\n\n\nHow Should You Choose a Coach?\n\nWe rank coaches according to a rough estimate of how helpful they’ve been in that particular goal. Currently, our estimate is skewed heavily toward questions answered. But you should also consider their personal success (many coaches have 100+ day streaks) and their bio.\n\nWe’re committed to finding a great coach for you. Twenty four hours after you sign up for a coach, you’ll get an email from Lift asking how things are going and giving you instructions on how to switch coaches if you’re not completely happy. We actually encourage switching until you find the right coach.\n\n* * * * * \n\n\nHow Does the Coaching Work?\n\nCoaches coach you through a chat feature inside the app. You sign up for a single goal with a coach. They’ll reach out to you within 24 hours of you signing up and will help make sure you’re ready to make progress on that goal.\n\nThen they’ll check in with you every day. Their main purpose is to hold you accountable to your goal and help you build momentum. Their secondary purpose is to answer your questions. Ask them for help and advice.\n\n* * * * *\n\n\nWhat Do You Get with Coaching?\n\n* Mentorship and accountability. The coaches listed inside Lift have personal, rather than theoretical, experience in that goal.\n\n* Advice. Coaches often have expertise that will be helpful for you. Ask for advice.\n\n* Coaches should check in with you nearly every day (according to a schedule that you work out together).\n\n* * * * *\n\n\nA Few Tips for Getting the Most Out of Your Coach.\n\n* Check in every day. The coaches want to help you and the more they see of you, the more they can respond to. If they don’t hear from you then everything they say is just a guess.\n\n* Focus on momentum. Coaches coach a single Lift-style goal—that means something you can practice several days per week. Every person has grand goals and our coaches try to get you there one step at a time.\n\n* Switch if you’re not happy. The coaches expect that not everyone will be a perfect fit with them. Most people know right away if they don’t have chemistry with their coach. If that happens, we’ll help you switch to a new coach.\n\nTo our future selves,\nTony & Erin, Alicia, Herzog, Esther, Terrie", "sellerUrl": "http://lift.do", "screenshotUrls": ["http://a4.mzstatic.com/us/r30/Purple3/v4/30/ac/2f/30ac2f51-1007-d5e0-b611-2a403b0815d1/screen1136x1136.jpeg", "http://a3.mzstatic.com/us/r30/Purple3/v4/7a/31/4b/7a314be5-dfb8-9433-8159-79b849778478/screen1136x1136.jpeg", "http://a3.mzstatic.com/us/r30/Purple5/v4/73/ab/63/73ab6323-4cf1-3cf1-8e8e-97a2cd429905/screen1136x1136.jpeg", "http://a5.mzstatic.com/us/r30/Purple3/v4/ab/e0/d7/abe0d757-9626-de50-f8a3-d4666aaf3e28/screen1136x1136.jpeg", "http://a4.mzstatic.com/us/r30/Purple1/v4/d5/14/fb/d514fbf0-4863-2b2f-9aaa-58a7bb534836/screen1136x1136.jpeg"], "userRatingCount": 968, "trackContentRating": "4+", "formattedPrice": "Free", "artistViewUrl": "https://itunes.apple.com/us/artist/lift-worldwide/id530911648?uo=4", "kind": "software", "averageUserRatingForCurrentVersion": 1.0, "sellerName": "Lift Worldwide, Inc.", "supportedDevices": ["iPhone4", "iPhone5s", "iPadFourthGen4G", "iPadMini", "iPhone5c", "iPad2Wifi", "iPhone5", "iPadFourthGen", "iPadThirdGen4G", "iPodTouchFifthGen", "iPad23G", "iPadThirdGen", "iPhone4S", "iPadMini4G"], "artworkUrl100": "http://a669.phobos.apple.com/us/r30/Purple1/v4/0a/c3/27/0ac327a7-fcc2-3c17-f595-a623fc4caba7/mzl.nmlkhftb.png", "bundleId": "com.liftworldwide.Lift", "trackViewUrl": "https://itunes.apple.com/us/app/lift-your-daily-coach/id530911645?mt=8&uo=4", "minimumOsVersion": "7.0", "artworkUrl60": "http://a1990.phobos.apple.com/us/r30/Purple5/v4/aa/5a/6e/aa5a6ea1-4514-02f5-b25a-93add456d4a0/AppIcon60x60_U00402x.png", "averageUserRating": 4.0}