{"contentAdvisoryRating": "12+", "features": [], "languageCodesISO2A": ["AR", "CS", "EN", "FR", "DE", "IT", "JA", "KO", "PT", "RU", "ZH", "SK", "ES", "SV", "TH", "ZH", "TR"], "ipadScreenshotUrls": ["http://a1.mzstatic.com/us/r30/Purple4/v4/ac/9c/f5/ac9cf501-a3ef-95e1-c64a-044d0e6b1667/screen480x480.jpeg", "http://a5.mzstatic.com/us/r30/Purple6/v4/0b/b2/09/0bb209ad-8ad6-7a4a-70ae-4c054a0eb33c/screen480x480.jpeg", "http://a5.mzstatic.com/us/r30/Purple4/v4/9a/18/fe/9a18fedb-d8be-8ebf-c3a9-69c4d6acc600/screen480x480.jpeg", "http://a3.mzstatic.com/us/r30/Purple/v4/b1/57/65/b157653c-ff82-b129-b27d-41c0af99a9f2/screen480x480.jpeg", "http://a2.mzstatic.com/us/r30/Purple4/v4/61/1d/fd/611dfdb6-a330-7850-825e-f369ff7f4486/screen480x480.jpeg"], "releaseDate": "2012-07-25T00:25:09Z", "currency": "USD", "artistId": 539297587, "userRatingCountForCurrentVersion": 1632, "wrapperType": "software", "advisories": ["Infrequent/Mild Alcohol, Tobacco, or Drug Use or References", "Infrequent/Mild Sexual Content and Nudity", "Infrequent/Mild Profanity or Crude Humor", "Infrequent/Mild Mature/Suggestive Themes"], "genres": ["Photo & Video", "Social Networking"], "trackId": 539297584, "description": "Padgram is a fast, versatile and easy-to-use Instagram App for iPad. Apart from managing multiple Instagram accounts, Padgram allows you to browse photos by category (e.g. Girls) or on a Map view. You can also subscribe to interesting tags and comment on photos with over 500 Emoji symbols. The wonderful and powerful feature - Smart Download allows you to save at most 100 favorite photos and videos from Instagram at the same time at the background, without disturbing your surfing on Padgram. Padgram supports both landscape and portrait mode, making everything look more brilliant!\n\n• #1 Photo app in 10+ countries \n• Top 10 Photo app in 50+ countries \n\nHere is what people says about Padgram: \n• \"The fastest Instagram app for ipad out there! Beautiful too! Left Instapad for this!\" by ryryjick \n• \"Simple and easy to share my instagram picture to other social networks, including pinterest.\" by Febihariadi \n• \"The swipe close makes browsing in and out of profiles fast and easy, and doesn't make you come full circle to get back to your original spot....like every other viewer out there.\" by EJ*30 \n\nExplore interesting photos \n• Browse popular photos and the photos you followed or liked\n• Browse photos in categories\n• Browse in a Map View, check out photos around the world \n• Check where a photo was taken on Map\n• Check a user's photos on Map, just like the Instagram's Photo Map feature. This is a premium feature\n• Search by tag or user name; contextual suggestions are given as you type\n• View photos in full size. Swiping Mode is enabled when viewing photos in full size, allowing users to easily swipe from one photo to another\n\nSmart downloading photos and videos \n• Save at most 100 favorite photos and videos from Instagram at the same time at the background, without disturbing your surfing on Padgram\n• Manage the downloading progress at the well designed dashboard of Smart Download. \n• Manage (such as view, share and delete) your downloaded photos and videos just like the official photo album. \n(Free version has a limitation of 1 photo or video downloaded at the same time)  \n\nStay closely with important events / friends\n• Hide a photo or a user's all photos to keep your feed less noisy\n• Subscribe to a tag or user you are interested in\n(Free version has a limitation of 3 tags/users)\n\nProtect your Instagram privacy \n• Easily set passcode lock. This is a premium feature. \n\nVivid liking and commenting \n• 1-tap or 2-tap to like photos\n• 1-tap to tag a photo with a batch of popular tags\n• Integrated Emoji keyboard with over 500 Emoji symbols\n• Type any user's name in comments can immediately @ the user and start replying\n• Tap on any comment to copy or delete it\n\nExtensive sharing options \n• Share photos to Facebook, Twitter, Pinterest, Pocket, Evernote, Tumblr and Sina Weibo\n• Send photos via Email or save to Camera Roll\n\nCheck and promote profiles \n• 1-tap to check out a user's photos, following's and followed-by info\n• Follow or unfollow people\n• Promote yourself or others with a beautiful collage, which is made of user's most liked photos\n\n[NEW] Support for multiple users \n• Just switch to a different user easily, without having to enter a password again. This is a premium feature.\n\nBeautiful layout and blistering speed \n• Support both landscape and portrait mode, just place your iPad in any orientation\n• Optimized for Retina display\n• Stacked layout makes it easy to return to where you were\n• Named \"the fastest Instagram iPad app\" by users\n\nYou can remove ads and get all premium features by upgrading to Premium version\n\nUnfortunately the Instagram API doesn't support photo upload. However, we have a quick link to launch the official Instagram iPhone app to take or upload photos. \n\nWe keep improving it. Since we cannot reply to you within the App Store, you can reach us at http://www.facebook.com/padgram and we respond to all messages promptly. \n\nNOTE: This product uses the Instagram API but is not endorsed or certified by Instagram.", "artistName": "Pinssible Labs", "artworkUrl512": "http://a1073.phobos.apple.com/us/r30/Purple5/v4/d8/ed/33/d8ed33f1-7c92-f823-c2e3-1ffb9f6062ab/mzl.yktegenh.png", "version": "6.3.0", "primaryGenreId": 6008, "primaryGenreName": "Photo & Video", "fileSizeBytes": "23836061", "price": 0.0, "isGameCenterEnabled": false, "trackCensoredName": "Padgram - Instagram Viewer for iPad", "genreIds": ["6008", "6005"], "trackName": "Padgram - Instagram Viewer for iPad", "releaseNotes": "1. Fix the bug related to keep getting logged out when the user restart the app in the special case.\n2. Fix a potential crash in iOS6.\n3. Fix other small bugs.", "screenshotUrls": [], "userRatingCount": 17761, "trackContentRating": "12+", "formattedPrice": "Free", "artistViewUrl": "https://itunes.apple.com/us/artist/pinssible-labs/id539297587?uo=4", "kind": "software", "averageUserRatingForCurrentVersion": 5.0, "sellerName": "Wuhan Pinssible Netcom Science & Technology Co.,Ltd", "supportedDevices": ["iPad23G", "iPadMini4G", "iPadFourthGen", "iPadThirdGen", "iPad2Wifi", "iPadThirdGen4G", "iPadFourthGen4G", "iPadMini"], "artworkUrl100": "http://a1073.phobos.apple.com/us/r30/Purple5/v4/d8/ed/33/d8ed33f1-7c92-f823-c2e3-1ffb9f6062ab/mzl.yktegenh.png", "bundleId": "com.pinssible.InstaPin0", "trackViewUrl": "https://itunes.apple.com/us/app/padgram-instagram-viewer-for/id539297584?mt=8&uo=4", "minimumOsVersion": "6.0", "artworkUrl60": "http://a158.phobos.apple.com/us/r30/Purple3/v4/97/fc/bb/97fcbb6f-f68c-bf0f-3f13-79ed9beec400/icon.png", "averageUserRating": 4.5}