{"contentAdvisoryRating": "4+", "features": [], "languageCodesISO2A": ["EN"], "ipadScreenshotUrls": ["http://a4.mzstatic.com/us/r30/Purple3/v4/07/65/0c/07650cb7-539d-2e76-ae9b-d21d4f6881d3/screen480x480.jpeg", "http://a5.mzstatic.com/us/r30/Purple1/v4/f8/62/ea/f862ea58-4671-ff9c-4b72-f4053aed1663/screen480x480.jpeg", "http://a2.mzstatic.com/us/r30/Purple3/v4/da/cf/a0/dacfa028-c825-88aa-1848-10322a07d6d1/screen480x480.jpeg", "http://a1.mzstatic.com/us/r30/Purple3/v4/4e/29/af/4e29af58-94e2-5ad6-ea7d-7c77bf3e2669/screen480x480.jpeg", "http://a4.mzstatic.com/us/r30/Purple1/v4/8e/2e/ca/8e2ecaf7-860e-4951-8ec2-3909385364d5/screen480x480.jpeg"], "releaseDate": "2012-12-10T16:47:28Z", "currency": "USD", "artistId": 564654037, "userRatingCountForCurrentVersion": 49, "wrapperType": "software", "advisories": [], "genres": ["Education", "Games", "Educational", "Family"], "trackId": 566773525, "description": "The Leo’s Pad Enrichment Program for Preschoolers is an award-winning adaptive-learning series in which your child will join a young Leonardo da Vinci and his friends on big adventures filled with exciting games woven into the stories. \n\nDesigned by Stanford researchers and an Emmy Award-winning creative director, the games in Leo’s Pad address over 25 skills essential to early learning and adjust to each child’s skill level as they play, so content is always highly relevant and engaging.  \n\nTry Chapter 1 for free! \n\nReviewers say:\n\n“From the start, Leo's Pad was a hit…Now that my daughter is 3 years old, I've seen her cognitive behavior improve as well as her problem-solving skills. Even after 10 months of using Leo's Pad, it is still at the top of her  list, and she plays nearly every day.” —David R., father of a 3-year-old\n\n“Leo’s Pad is one of the best designed educational apps addressing kids as a whole. It is easy to teach just numbers or letters, it is not easy to build the soft skills into the learning process. This makes Leo’s Pad stand out...”—iGameMom \n\n“The [chapters] develop critical thinking and socio-emotional growth while creatively building from foundational skills, encouraging imagination and problem solving…I hope all students have access to this wonderful learning tool. This is a great investment!”—Alahrie A., educator, principal, and mother of a 6-year-old\n\n“The animations are breathtaking, while the captivating storytelling sustains kids' interest. In addition to fun learning activities, the app weaves in songs that teach and subtle life lessons.”—Jinny Gudmundsen, editor of Tech with Kids and Kid-Tech columnist for USA Today\n\nLeo’s Pad Enrichment Program for Preschoolers breaks new ground for children’s learning in four ways:\n\n1. RESEARCH-BASED CONTENT\nThe games are designed by a team of learning scientists and based on a comprehensive early childhood curriculum. Through these games, kids practice a variety of skills essential to early learning, including problem solving, working memory, and even turn taking and delayed gratification!\n\n2. ADAPTIVE GAMEPLAY\nThe games’ difficulty levels adapt as children play, extending the value of each chapter by providing just the right level of difficulty to motivate learning and keep kids coming back for more. \n\n3. HIGH-QUALITY ANIMATION\nLeo’s Pad uses movie-quality animation to bring characters and events to life, for a captivating experience that children love to relive again and again.\n\n4. ENGAGING STORIES\nFun stories and memorable songs from our Emmy-winning creative director improve learning and maximize knowledge retention.\n\nChapter Summaries:\n\n- Chapter 1, “Gally’s Birthday”: This chapter is about being generous with friends and dreaming big. \n- Chapter 2, “Rocket to the Stars”: Preschoolers often get frustrated; they’re beginning to have big ideas, but they struggle to make those ideas happen. This chapter highlights three strategies for making big ideas a reality!\n- Chapter 3, “Catch that Question!”: This chapter touches on the idea that anything we want to learn how to do requires lots of practice.\n- Chapter 4, “A Splashing Good Time”: This chapter models an innovation mindset.  The characters find solutions to problems using whatever materials are available.\n- Chapter 5, “The Wishing Fish”: In this chapter our characters learn that courage means doing something even though it scares you.\n-Chapter 6, “Wish Upon a Fish”: This chapter’s theme is doing the right thing by someone else, even if means giving up something you really want.\n-Finale, “A Storybook Ending”: Featuring an original song from Laurie Berkner, the finale introduces preschoolers to the joy of music and the love of reading, with the hopes of inspiring them to create their own stories and music beyond Leo’s Pad!\n\nThere are no third-party ads.\n\nFor the best experience, pair Leo’s Pad Enrichment Program with Learner Mosaic, our free parenting app for the iPhone.", "artistName": "Kidaptive Inc.", "artworkUrl512": "http://a1856.phobos.apple.com/us/r30/Purple3/v4/58/e3/7f/58e37f8a-bbee-f607-4a8d-fe072a82ac6a/mzl.xbskzelk.png", "version": "2.0.0", "primaryGenreId": 6017, "primaryGenreName": "Education", "fileSizeBytes": "284592738", "price": 0.0, "isGameCenterEnabled": false, "trackCensoredName": "Leo's Pad Enrichment Program for Preschoolers", "genreIds": ["6017", "6014", "7008", "7009"], "trackName": "Leo's Pad Enrichment Program for Preschoolers", "releaseNotes": "Added Finale: A Storybook Ending\nUpdated Family Account system\nIntroduced in-app purchases\nEnhanced several games", "sellerUrl": "http://www.kidaptive.com", "screenshotUrls": [], "userRatingCount": 1312, "trackContentRating": "4+", "formattedPrice": "Free", "artistViewUrl": "https://itunes.apple.com/us/artist/kidaptive-inc./id564654037?uo=4", "kind": "software", "averageUserRatingForCurrentVersion": 3.5, "sellerName": "Kidaptive Inc.", "supportedDevices": ["iPadMini4G", "iPadThirdGen4G", "iPadFourthGen4G", "iPad2Wifi", "iPad23G", "iPadThirdGen", "iPadFourthGen", "iPadMini"], "artworkUrl100": "http://a1856.phobos.apple.com/us/r30/Purple3/v4/58/e3/7f/58e37f8a-bbee-f607-4a8d-fe072a82ac6a/mzl.xbskzelk.png", "bundleId": "com.kidapt.kidaptplayer", "trackViewUrl": "https://itunes.apple.com/us/app/leos-pad-enrichment-program/id566773525?mt=8&uo=4", "minimumOsVersion": "7.0", "artworkUrl60": "http://a1013.phobos.apple.com/us/r30/Purple3/v4/67/41/98/6741988b-4034-bc6d-a8a1-d163318e7698/Icon-72.png", "averageUserRating": 4.5}