{"contentAdvisoryRating": "4+", "features": ["iosUniversal"], "languageCodesISO2A": ["EN"], "ipadScreenshotUrls": ["http://a2.mzstatic.com/us/r30/Purple5/v4/6c/6f/76/6c6f763f-9ce5-7a90-e914-4c1a6b4213fe/screen480x480.jpeg", "http://a2.mzstatic.com/us/r30/Purple3/v4/ee/7c/ea/ee7cea53-4f9b-e890-b7bd-25ed1e202975/screen480x480.jpeg", "http://a5.mzstatic.com/us/r30/Purple3/v4/46/dc/1b/46dc1ba7-c745-b30b-7941-5abde186c083/screen480x480.jpeg", "http://a2.mzstatic.com/us/r30/Purple1/v4/80/74/8b/80748b6c-eab7-7d0e-e861-714394bcca4b/screen480x480.jpeg"], "releaseDate": "2012-10-19T22:08:45Z", "currency": "USD", "artistId": 568760030, "userRatingCountForCurrentVersion": 9, "wrapperType": "software", "advisories": [], "genres": ["Business", "Productivity"], "trackId": 568759967, "description": "Hall is a secure texting app for business that helps teams and companies collaborate by eliminating email and getting things done in real time. Messages and files are stored securely in the Cloud and synced across all your devices. Easily text coworkers, customers, and clients privately or in groups created for teams and projects.\n\nKey Features:\n\n* Security: All data is safely and securely sent with bank-level encryption\n\n* Syncing: Data is automatically synced to all your devices\n\n* Texting: Chat with users one-on-one or in a group\n\n* Cross-Company: Chat with in-network and out-of-network users\n\n* File-sharing: Easily share links, files, and images\n\n* Dropbox and Box Integrations: Share any and everything from Dropbox and Box accounts onto Hall\n\n* Text Non-Hall Users: Easily text ANY person in your contact book from within the Hall app by using phone numbers\n\n* Easy-to-Use: The Hall app was created for the ultimate user experience - Simple, logical, and visually appealing\n\n* Real-Time: Every text is sent and received in real-time without delay\n\nDropbox and Box Integrations:\n \nEasily share files from your Dropbox or Box in a private or group text. Share files, presentations, photos, or anything else stored on Dropbox or Box accounts.\n\nWhy Over 20k Businesses Love Hall:\n\n“Other messaging apps like HipChat, GroupMe, Basecamp, and Yammer used to be great, but since being acquired, they’ve way gone downhill. Hall is now my company’s go-to for business messaging. We’re really impressed.”\n\n“What an amazing user experience! Secure, fast, and easy-to-use. It’s everything my company has been looking for.”\n\n“We tried using Yammer, Podio, and Slack but found their interfaces to be unfriendly. We are an engineering team, but we still communicate with non-engineers who need a user-friendly business messenger. Hall was a great solution for us.”\n\n“My agency relies heavily on Dropbox and Box. With Hall’s new integrations, we now share files from Dropbox and Box to our clients in real-time. We are happy. And so are our clients.”\n“CoTap, GroupMe, and Podio lack web and desktop apps. But Hall works across all platforms like iMessage, which makes much more sense for business purposes.”\n\n“Productivity and collaboration have soared at our company since using Hall. People needed an outlet for their ideas, information, and concerns - now we have that!”\n\n“I love that I can connect with coworkers AND clients outside my company. I can do all my communication in one place. I hardly use email anymore, which saves me tons of time.”\n\nHow Hall Helps Teams Work Better:\n\n* Communicate with coworkers, customers, and clients all day, everyday\n\n* Eliminate email to save time and energy and avoid spam and phishing\n\n* Share links, files, and information quickly so all team members are up-to-date\n\n* Receive business messages wherever you are\n\n* Brainstorm and collaborate with teams near or far\n\n* Stay in-the-know of everything happening at work\n\n* Communicate freely with your team in a collaborative atmosphere\n\n* Access all your files, information, and contacts on any device\n\nExtra Features on Desktop:\n\n* Integrations: Trello, Asana, JIRA, Github, New Relic, Bitbucket, Heroku, Hubot, Jenkins, New Relic, Pivotal Tracker, UserVoice, Crashlytics, Zapier, Zendesk, Exceptional, and Get Satisfaction\n\n\nContact Us:\n\nWe love hearing from you! Tweet @Hall or email support@hall-inc.com. For press inquiries, email contact@hall-inc.com.", "artistName": "CompanyLine Corporation", "artworkUrl512": "http://a403.phobos.apple.com/us/r30/Purple3/v4/de/8d/0e/de8d0ed4-d525-6fb8-95ef-d5cf0e58cdb6/mzl.xldsnkki.png", "version": "2.4.7", "primaryGenreId": 6000, "primaryGenreName": "Business", "fileSizeBytes": "19291730", "price": 0.0, "isGameCenterEnabled": false, "trackCensoredName": "Hall - Team Communication", "genreIds": ["6000", "6007"], "trackName": "Hall - Team Communication", "releaseNotes": "· Find it hard to create a Group for your dream project? We made group creation as simple as 2 clicks\n· Optimized our Log In and Sign-Up experiences\n· Lots of amazing improvements for our iPhone 6 and iPhone 6 Plus users!\n· Bug fixes and UI improvements\n\nThanks for using Hall! If you have a moment, please leave us a review. It'll help feed our bot pizza.", "sellerUrl": "https://hall.com", "screenshotUrls": ["http://a1.mzstatic.com/us/r30/Purple4/v4/e3/62/c9/e362c9ce-6ac5-21bd-b6d3-b0a300159b05/screen1136x1136.jpeg", "http://a5.mzstatic.com/us/r30/Purple4/v4/32/35/fa/3235faf3-b7cf-f4c7-4fbf-2371bc668bb9/screen1136x1136.jpeg", "http://a1.mzstatic.com/us/r30/Purple1/v4/30/b0/aa/30b0aad7-3138-2e45-ae74-4658c9e057bf/screen1136x1136.jpeg", "http://a3.mzstatic.com/us/r30/Purple4/v4/5d/57/f7/5d57f7ea-6dc8-3e69-e817-45c608c9afd9/screen1136x1136.jpeg"], "userRatingCount": 125, "trackContentRating": "4+", "formattedPrice": "Free", "artistViewUrl": "https://itunes.apple.com/us/artist/companyline-corporation/id568760030?uo=4", "kind": "software", "averageUserRatingForCurrentVersion": 4.5, "sellerName": "CompanyLine Corporation", "supportedDevices": ["iPadFourthGen", "iPadMini4G", "iPadFourthGen4G", "iPad2Wifi", "iPhone5c", "iPadMini", "iPhone4S", "iPadThirdGen", "iPhone4", "iPadThirdGen4G", "iPhone5s", "iPad23G", "iPhone5", "iPodTouchFifthGen"], "artworkUrl100": "http://a403.phobos.apple.com/us/r30/Purple3/v4/de/8d/0e/de8d0ed4-d525-6fb8-95ef-d5cf0e58cdb6/mzl.xldsnkki.png", "bundleId": "com.companyline.hall", "trackViewUrl": "https://itunes.apple.com/us/app/hall-team-communication/id568759967?mt=8&uo=4", "minimumOsVersion": "7.0", "artworkUrl60": "http://a50.phobos.apple.com/us/r30/Purple1/v4/02/de/40/02de40d4-8134-deaf-e7e7-b082ac76a38a/AppIcon57x57.png", "averageUserRating": 4.5}