{"contentAdvisoryRating": "4+", "features": ["iosUniversal"], "languageCodesISO2A": ["EN"], "ipadScreenshotUrls": ["http://a3.mzstatic.com/us/r30/Purple3/v4/3d/28/8c/3d288c8c-b930-a1a8-7268-d4227db73089/screen480x480.jpeg", "http://a2.mzstatic.com/us/r30/Purple4/v4/6f/5f/7a/6f5f7a9a-ffcd-fd46-7961-f9c063acded1/screen480x480.jpeg", "http://a1.mzstatic.com/us/r30/Purple5/v4/89/03/5c/89035c21-ddaf-3ee5-4c60-5825ff0fee97/screen480x480.jpeg", "http://a3.mzstatic.com/us/r30/Purple3/v4/79/a7/89/79a789d4-150a-b108-c9cf-5583bc459d82/screen480x480.jpeg", "http://a5.mzstatic.com/us/r30/Purple3/v4/e5/4b/e3/e54be391-6d38-f623-4f34-a0d8e3794ce8/screen480x480.jpeg"], "releaseDate": "2012-12-15T14:15:47Z", "currency": "USD", "artistId": 462860141, "userRatingCountForCurrentVersion": 39, "wrapperType": "software", "advisories": [], "genres": ["Catalogs", "Lifestyle"], "trackId": 584632814, "description": "The best deals on the web are found on Slickdeals. Since 1999, our user generated model has saved consumers over $2.6 billion. Millions of users submit, vote and comment on deals across the nation so the best deals rise to our Frontpage. Of the millions of sales and promotions across the web on any given day, the 30 best deals across the nation make it to the Slickdeals Frontpage every day. Join our community of 9 million users and do not miss out on a slick deal. Ask around, people love the site/app.\n \nSlickdeals iOS App Menu (click on the three lines icon in the top left navigation to expose the menu):\n\nFrontpage Deals: The famous Slickdeals Frontpage is where the best deals in the nation rise to the top. Our community of millions vote up the best deals to our Popular Deals section. Then our seasoned team of Deal Editors review the Popular Deals to see what is Frontpage-worthy. The Deal Editors conduct the research on the Frontpage deal including price history, product reviews, coupon codes, free shipping and more. You can feel confident that you are getting a great deal with the Slickdeals community seal of approval. If you want Push Notifications on the best deals the moment they hit the Frontpage, you can set that alert in ‘Settings’ (Login Required).\n \nLocal Deals: Not only do we show you the best deals on the web across the nation but we also offer Local Deals that are aggregated from local daily deal sites like Groupon and LivingSocial. “Map View” shows you deals relative to your current location.\n \nPopular Deals: These are deals from our forums that are made popular by community votes and activities, great deals all the time from your fellow Slickdeals community members. This is where you have a chance to jump on the best deals before they hit the Slickdeals Frontpage where the deals usually sell-out quickly.\n \nCoupons: This is a NEW section. Don't shop online without first checking our extensive inventory of coupons for over 5,000 stores. We update our coupons daily so rest assured they will work.\n \nForums: The heart of the Slickdeals community is in our forums, where users help each other find the best deals, prices, product reviews and feedback. There's no limit to the types of deals you can find here - from freebies to financial discussion, HDTVs to purses - our users find the best deals on the web, anytime, anywhere.\n \nCategories: Browse deals by category including apparel, automotive, bags & backpacks, books & magazines, kids & babies, computers & laptops, electronics, flowers & gifts, food & grocery, video games, health & beauty, home & home improvement, jewelry & watches, office & school supplies, pets, sports & outdoors, travel and more.\n \nFavorites: If you register, you can save deals to your Favorites for easy reference whether it’s a deal for yourself, or a birthday gift, or something for the holidays including Black Friday. (Login Required)\n \nRemind Me Later: We know that buying on your phone can be a pain sometimes, so this feature lets you \"save\" a deal, and we'll remind you later via email or on the Slickdeals.net website so that you can complete your transaction on your computer or tablet. (Login Required)\n \nDeal Alerts: You can set deal alerts for Keywords, Stores and Categories. Receive a notification when a deal matches your criteria. Don't miss out on another Slick Deal! (Login Required)\n \nLogin: Log in to your Slickdeals account and be part of the community straight from your iOS device. If you find a deal that’s Slickdeals-worthy, go to the Hot Deals forum and submit coupons codes, promo codes, sales, freebies or anything else you deem a Slick Deal. Your voting and feedback help make the community better, which means saving more people money.\n \nHave an issue with the app? Suggestions? Praises? Send us an email at ios@slickdeals.net - Your feedback will help make this the best deals and coupons app.", "artistName": "Slickdeals, LLC", "artworkUrl512": "http://a1043.phobos.apple.com/us/r30/Purple5/v4/26/6b/3f/266b3f61-d215-e096-6953-00fef57a320e/mzl.zhelmbzr.png", "version": "2.1.6", "primaryGenreId": 6022, "primaryGenreName": "Catalogs", "fileSizeBytes": "32281520", "price": 0.0, "isGameCenterEnabled": false, "trackCensoredName": "Slickdeals - The #1 Deals and Coupons Shopping App", "genreIds": ["6022", "6012"], "trackName": "Slickdeals - The #1 Deals and Coupons Shopping App", "releaseNotes": "- Bug fixes for iOS 8", "screenshotUrls": ["http://a2.mzstatic.com/us/r30/Purple1/v4/7b/2e/94/7b2e945a-1ff1-7733-307b-081df95503a8/screen1136x1136.jpeg", "http://a1.mzstatic.com/us/r30/Purple4/v4/0a/83/11/0a831133-1d16-4761-03c3-52a3f2079809/screen1136x1136.jpeg", "http://a2.mzstatic.com/us/r30/Purple4/v4/6c/1a/81/6c1a81fe-0bf6-1fb7-72fd-0e14e4bbc735/screen1136x1136.jpeg", "http://a1.mzstatic.com/us/r30/Purple1/v4/5c/a9/2b/5ca92bb9-8465-a9bc-7cf2-a3c8a436b905/screen1136x1136.jpeg", "http://a1.mzstatic.com/us/r30/Purple5/v4/cc/30/da/cc30daa5-372f-e8d4-fd9e-b845503c3150/screen1136x1136.jpeg"], "userRatingCount": 1536, "trackContentRating": "4+", "formattedPrice": "Free", "artistViewUrl": "https://itunes.apple.com/us/artist/slickdeals-llc/id462860141?uo=4", "kind": "software", "averageUserRatingForCurrentVersion": 4.5, "sellerName": "Slickdeals, LLC", "supportedDevices": ["iPadFourthGen4G", "iPadMini4G", "iPhone5c", "iPad2Wifi", "iPodTouchFifthGen", "iPhone5", "iPad23G", "iPhone4S", "iPhone-3GS", "iPhone5s", "iPadThirdGen", "iPadMini", "iPhone4", "iPadThirdGen4G", "iPodTouchourthGen", "iPadFourthGen"], "artworkUrl100": "http://a1043.phobos.apple.com/us/r30/Purple5/v4/26/6b/3f/266b3f61-d215-e096-6953-00fef57a320e/mzl.zhelmbzr.png", "bundleId": "com.slickdeals.mobile", "trackViewUrl": "https://itunes.apple.com/us/app/slickdeals-1-deals-coupons/id584632814?mt=8&uo=4", "minimumOsVersion": "6.0", "artworkUrl60": "http://a382.phobos.apple.com/us/r30/Purple1/v4/f4/35/d0/f435d0f9-5d53-a421-8e64-b4246aac3abd/AppIcon57x57.png", "averageUserRating": 4.0}