{"contentAdvisoryRating": "4+", "features": [], "languageCodesISO2A": ["EN", "DE", "SE", "ES"], "ipadScreenshotUrls": [], "releaseDate": "2013-04-30T07:00:00Z", "currency": "USD", "artistId": 578892273, "userRatingCountForCurrentVersion": 5, "wrapperType": "software", "advisories": [], "genres": ["Health & Fitness", "Sports"], "trackId": 616360484, "description": "Alpha Trainer is the most advanced Personal Training and Fitness app that gives each user a Customized, 14-week Workout Program, based on his or her own, unique goals! \n\nWe have the largest library of over 100,000 customized fitness programs (and growing) that are professionally developed by Paul Kim, our founder who is a Certified Personal Trainer and fitness competitor, to help you attain your specific goals. Simply set your own fitness goals and get a 14-week, professional quality workout program. Whether you’re a beginner or pro, looking for a HOME or GYM workout program, trying to lose or gain weight, or trying to get stronger, faster, more muscular, or build cardio, Alpha Trainer will custom-tailor your workout to give you the perfect program. You can even select specific body parts to focus on, like your belly, thighs, rotator cuffs, etc.\n\nWhen you’re ready to work out, use our Advanced Multimedia Trainer, which times your rest, sets, and reps, with in-depth voice coaching. It also gives you detailed explanations of all the exercises (pictures and videos), demonstrated by our founder.\n\nAlpha Trainer is also the first and only app to introduce Social Motivation through your close friends via Motivation Partners, who keep you motivated and accountable to work out by sending you messages, encouragement, and gifts directly from our app! If you’re like most people, having a group of close friends who are accountable for you is among the most effective ways to get in shape, and Alpha Trainer enables this for you!\n\nSOME KEY FEATURES:\n•  Get a customized, 14-week fitness program based on in-depth GOAL SETTING. You can choose HOME or GYM workout programs, Exercise Difficulty (Beginner to Pro Level), Time per Session, Workouts per Week, Lose or Gain Weight, Level of Muscle Gain, Level of Strength Gain, Level of Cardiovascular Gain, Level of Speed & Quickness Gain, Problem Areas of the Body, Gender, Weight, Height, and much more!\n\n•  Progressive training curriculum that allows you to chart your progress, reset goals, log your weight, and change your workout programs on the fly! Includes detailed coaching and instructions for each day of your workout.\n\n•  Track your weight, see your weight graph and history, and see your exercise history.\n\n•  Advanced multimedia trainer with interval timer and voice coaching from our founder. Provides exercise demonstrations of hundreds of exercises (pictures and videos), all by our founder.\n\n•  Select Motivation Partners (close friends) to keep you accountable and motivated to exercise. We notify these partners on your workout days so that they can message, encourage, and send you gifts from our app.\n\n•  Send messages and gifts to your friends directly from our app. \n\n•  Deep game mechanics and social media integration: Earn Gold and Experience Points (XP); Levels, Leaderboards, Facebook posts, etc.\n\n•  Growing database of other workout programs that you can choose. For example, you can choose programs to increase your bench press or squat, blast your belly fat, increase your vertical jump, increase your cardiovascular health, perform HIIT or Crossfit workouts, tone your core and thighs, etc.\n\nThis service includes optional auto-renewing subscriptions called “Elite” Memberships, including 1 Month ($9.99), 6 Month ($39.99), and Annual ($59.99). If you choose to make a purchase, payment will be charged to your iTunes account at purchase confirmation. Subscription automatically renews unless auto-renew is turned off at least 24-hours before the end of the current period. Account will be charged for renewal within 24-hours prior to the end of the current period at the same price. Subscriptions may be managed by the user and auto-renewal may be turned off by going to the user's Account Settings after purchase. No cancellation of the current subscription is allowed during active subscription period. Terms & Conditions: http://alphatrainerapp.com/?page_id=41.", "artistName": "nido labs", "artworkUrl512": "http://a559.phobos.apple.com/us/r30/Purple/v4/4c/8c/16/4c8c16c5-829e-34bf-81c2-7ba4532244d1/mzl.kywiiyxe.png", "version": "1.7", "primaryGenreId": 6013, "primaryGenreName": "Health & Fitness", "fileSizeBytes": "44493371", "price": 0.0, "isGameCenterEnabled": false, "trackCensoredName": "Alpha Trainer : Get Customized Fitness Programs", "genreIds": ["6013", "6004"], "trackName": "Alpha Trainer : Get Customized Fitness Programs", "releaseNotes": "- Fixed bugs to the Audio trainer caused by iOS 8. \n- Miscellaneous other bug fixes.", "sellerUrl": "http://alphatrainerapp.com", "screenshotUrls": ["http://a5.mzstatic.com/us/r30/Purple/v4/e2/f4/b4/e2f4b45b-9192-381d-db2e-f8f5a27553cd/screen1136x1136.jpeg", "http://a5.mzstatic.com/us/r30/Purple2/v4/91/66/4c/91664c31-173e-12fe-6ba5-c0d4b426b844/screen1136x1136.jpeg", "http://a3.mzstatic.com/us/r30/Purple2/v4/35/5a/07/355a071c-4b7f-fbd5-5ec0-64c6dfb108d2/screen1136x1136.jpeg", "http://a4.mzstatic.com/us/r30/Purple2/v4/70/6a/8c/706a8c6f-d0f2-298c-bd12-be8e8d62b99c/screen1136x1136.jpeg", "http://a3.mzstatic.com/us/r30/Purple/v4/f8/41/61/f841615a-bcbb-e857-99fb-8b04b6e6b681/screen1136x1136.jpeg"], "userRatingCount": 259, "trackContentRating": "4+", "formattedPrice": "Free", "artistViewUrl": "https://itunes.apple.com/us/artist/nido-labs/id578892273?uo=4", "kind": "software", "averageUserRatingForCurrentVersion": 4.5, "sellerName": "Nido Labs, Inc.", "supportedDevices": ["iPad23G", "iPhone5s", "iPadMini4G", "iPadFourthGen4G", "iPhone4S", "iPad2Wifi", "iPodTouchourthGen", "iPhone5c", "iPadThirdGen", "iPhone4", "iPhone-3GS", "iPodTouchFifthGen", "iPad3G", "iPadFourthGen", "iPadMini", "iPadWifi", "iPadThirdGen4G", "iPodTouchThirdGen", "iPhone5"], "artworkUrl100": "http://a559.phobos.apple.com/us/r30/Purple/v4/4c/8c/16/4c8c16c5-829e-34bf-81c2-7ba4532244d1/mzl.kywiiyxe.png", "bundleId": "com.nidolabs.alphatrainer", "trackViewUrl": "https://itunes.apple.com/us/app/alpha-trainer-get-customized/id616360484?mt=8&uo=4", "minimumOsVersion": "4.3", "artworkUrl60": "http://a685.phobos.apple.com/us/r30/Purple3/v4/55/c7/04/55c70477-950a-610f-fb8a-5a43b34bcc31/1_57x57.png", "averageUserRating": 4.0}