{"contentAdvisoryRating": "4+", "features": [], "languageCodesISO2A": ["DA", "NL", "EN", "FR", "DE", "IT", "JA", "KO", "NO", "PT", "RU", "ES", "SV", "TH", "ZH", "TR", "VI"], "ipadScreenshotUrls": [], "releaseDate": "2013-07-30T21:50:20Z", "currency": "USD", "artistId": 488540104, "userRatingCountForCurrentVersion": 699, "wrapperType": "software", "advisories": [], "genres": ["Health & Fitness", "Lifestyle"], "trackId": 680170305, "description": "The \"7 Minute Workout\" is a research-backed workout program that has become an international hit! \n\nPublished in the leading research journal ACSM, and then popularized by the NYT, the \"7 Minute Workout\" is simple but effective. \n\nResearchers have selected 12 exercises that are performed for 30 seconds with 10 second rest intervals. This high-intensity training with little rest results in higher daily metabolism and is the equivalent of working out for over an hour - for only slightly longer than 7 minutes. \n\nThe best part? The exercises are simple to perform, do not require any equipment, and therefore, can be done anywhere! NO MORE EXCUSES. \n\nThis app takes this research-proven workout and guides you through the process. Further, it tracks your results, and makes it fun by allowing you to unlock rewards as you continue working out. \n\nApp features include: \n\n- stunning design \n- both male and female trainers that guide you by video, audio, image and text \n- all content is INCLUDED (no additional charges, and no need for internet connectivity) \n- track your weight with our weight tracker \n- track your activity with our activity calendar \n- workout and unlock various achievements \n\nWe are dedicated fitness professionals and app developers. We strive to make the highest quality products - if you have any suggestions, feel free to contact us. Our apps are regularly updated at no charge.", "artistName": "Fitness Guide Inc", "artworkUrl512": "http://a1745.phobos.apple.com/us/r30/Purple4/v4/d9/79/e9/d979e9d7-25ef-206f-cd4d-1f2a55d76fc8/mzl.oyljxfjm.png", "version": "1.4", "primaryGenreId": 6013, "primaryGenreName": "Health & Fitness", "fileSizeBytes": "78632767", "price": 1.99, "isGameCenterEnabled": false, "trackCensoredName": "7 Minute Workout Challenge", "genreIds": ["6013", "6012"], "trackName": "7 Minute Workout Challenge", "releaseNotes": "We have spent the last several months working hard on this free update, so we hope you enjoy it! If you have a moment, please leave us a written review on iTunes - it really helps us out more than you would imagine. If you have already written us a review, please update it. Thank you!\n\nWhat’s new with this update?\n\n- fixed critical bug for iOS 7.1 that was causing crashing\n\n- We have added three additional workout packs to the app for a total of 36 new exercises. The workouts were designed  with the help of fitness instructors to ensure it complies with the principles of the 7 minute workout. There are two ways to unlock the workouts: if you workout regularly with the app, the workouts can be unlocked for free. If you want them immediately, we have provided the option to purchase the workouts individually. Try to unlock the workouts for free by simply keeping up with the challenge!\n\n- 4 new achievements can now be unlocked\n\n- added option to change the rest duration between workout cycles\n\n- AirPlay support for iPhone users is now enabled\n\n- post your achievements directly to Facebook and Twitter after earning them\n\n- app will continue to play when your device is on lock\n\n- app will alert you when to switch sides for exercises that require you to alternate your body position \n\n- changed some of the audio cues to make them easier to understand\n\n- weight tracker and calendar have new improved appearances\n\n- you can set what time the workout alert timer should go off\n\n- fixed several bugs including those involving achievements (they will be corrected retroactively)\n\n- fixed some translation errors and added support for Thai, Vietnamese and Russian\n\nTHANK YOU for making us the #1 fitness app on the iOS platform! Again, if you have a moment, please leave us a review.", "sellerUrl": "http://www.7minworkoutapp.net", "screenshotUrls": ["http://a3.mzstatic.com/us/r30/Purple/v4/e6/11/8a/e6118ad4-5e16-b2b8-0eda-2bdc8b2dc7c7/screen1136x1136.jpeg", "http://a3.mzstatic.com/us/r30/Purple/v4/d0/86/cf/d086cfee-066a-56e5-5d95-bcfb8ca3b531/screen1136x1136.jpeg", "http://a4.mzstatic.com/us/r30/Purple/v4/df/2d/ed/df2ded6f-3e85-4112-b3e3-2c3d96014c23/screen1136x1136.jpeg", "http://a5.mzstatic.com/us/r30/Purple/v4/c1/dd/92/c1dd9291-56e9-490e-c059-86bc650c0b8c/screen1136x1136.jpeg", "http://a1.mzstatic.com/us/r30/Purple/v4/d1/3c/60/d13c600c-d4a2-4a98-39fb-a435c31bb401/screen1136x1136.jpeg"], "userRatingCount": 1557, "trackContentRating": "4+", "formattedPrice": "$1.99", "artistViewUrl": "https://itunes.apple.com/us/artist/fitness-guide-inc/id488540104?uo=4", "kind": "software", "averageUserRatingForCurrentVersion": 5.0, "sellerName": "Ariyana Felfeli", "supportedDevices": ["iPadFourthGen", "iPad23G", "iPadFourthGen4G", "iPadMini4G", "iPodTouchFifthGen", "iPhone-3GS", "iPhone5s", "iPadMini", "iPhone5c", "iPhone4", "iPadThirdGen4G", "iPhone5", "iPad2Wifi", "iPodTouchourthGen", "iPhone4S", "iPadThirdGen"], "artworkUrl100": "http://a1745.phobos.apple.com/us/r30/Purple4/v4/d9/79/e9/d979e9d7-25ef-206f-cd4d-1f2a55d76fc8/mzl.oyljxfjm.png", "bundleId": "net.7minworkoutapp", "trackViewUrl": "https://itunes.apple.com/us/app/7-minute-workout-challenge/id680170305?mt=8&uo=4", "minimumOsVersion": "6.0", "artworkUrl60": "http://a432.phobos.apple.com/us/r30/Purple/v4/dd/11/36/dd113655-f7fc-4f13-0e32-cf7b3a9321b1/Icon57.png", "averageUserRating": 5.0}