{"contentAdvisoryRating": "4+", "features": [], "languageCodesISO2A": ["NB", "CA", "HR", "CS", "DA", "NL", "EN", "FI", "FR", "DE", "EL", "HU", "ID", "IT", "JA", "KO", "MS", "PL", "PT", "RO", "RU", "ZH", "SK", "ES", "SV", "TH", "ZH", "TR", "UK", "VI"], "ipadScreenshotUrls": [], "releaseDate": "2013-09-15T02:59:20Z", "currency": "USD", "artistId": 780179337, "userRatingCountForCurrentVersion": 109, "wrapperType": "software", "advisories": [], "genres": ["Social Networking", "Utilities"], "trackId": 688695759, "description": "Connect instantly finds your friends and contacts on Facebook and other social networks – mapping where they are and what they are doing in real time.  Now getting together with friends for a drink, movie or just to hangout is a snap!\n\nSee what all your friends are doing and where they are without ever opening up Facebook, Google, Linkedin, Twitter, Instagram, Foursquare or even your phone contacts.  You’ll see the last location each of your friends checked in at and all the posts they made on their different social media profiles.  There’s no need to jump between five different apps just to see what all your friends are doing; your friends’ locations and their activities are all in a single spot with Connect. More than just a friend finder, Connect is about expanding and developing your existing relationships.  The activities tab shows you what your friends are doing when they check in their location.  No videos you don’t want to watch and no links to articles you don’t want to read.  If you’re in the mood for hitting that popular restaurant at happy hour, simply open up Connect, see who’s already there from all your social networks and drop them a message to save you a seat.  No more endless scanning of news feeds and check in posts just to set up a hangout.  Connect makes socializing convenient and easy.\n\nWith Connect, you’re able to communicate through different social media channels while staying within the app.  You can send a Facebook message, Linkedin message, text, call and email straight from the Connect interface without pulling up each app separately.  The convenient search tool also lets you filter friends and contacts by job, company, school, interest and more.  Search up a partner by his company and touch base through Linkedin, Facebook message a friend who posted about a local concert and call your mom when she checks in at the airport without ever switching apps.\n\nYou shouldn’t have to search through your Facebook, Twitter, and Foursquare accounts just to see who’s available to hangout.  See what all of your friends are doing from all of your social networks and stay in touch while on the move.\n\nConnect Features:\n\n* Syncs and updates all of your contacts from existing social networks (Facebook, Google, Address Book, Instagram, LinkedIn, Twitter and more)\n* Friend finder features show you contacts from all social networking apps in two map views: by city and by individual check in location\n* Easily search all your social networks and contacts by job, company, interests, schools and more\n* Friend profiles show information from their other social media profiles\n* News feeds show where everyone from all your social networks has checked in\n* Get notified when out-of-town friends visit your area\n* Friend locator features notify you when contacts post near you\n* Customized group lists let you see when a group of contacts check in at a certain location \n* Built in messenger features make social chats with one friend or a group simple and easy \n* Check in and tell your social networks how long you’ll be at a certain location to hangout\n\nAt Connect, we believe that you are the relationships you keep.  More relationships mean more opportunities and Connect helps you develop both.  The Connect app lets you tap contacts from all of your social networking apps at the same time.  Why divide all your social contacts into seven different apps when you only need one to reach everybody? Download Connect today.\n\nConnect is also available for the web! To download, or for questions, comments or feedback on the Connect app, check out: http://connect.com/\n\nDisclaimer:\nContinued use of GPS running in the background can dramatically decrease battery life.", "artistName": "Connect Software Corp", "artworkUrl512": "http://a1202.phobos.apple.com/us/r30/Purple3/v4/c7/8c/e4/c78ce4a6-ba50-7ab6-c6e8-ede15f891fc1/mzl.njtmduac.png", "version": "1.13.19", "primaryGenreId": 6005, "primaryGenreName": "Social Networking", "fileSizeBytes": "11450731", "price": 0.0, "isGameCenterEnabled": false, "trackCensoredName": "Connect - Social Map & Address Book | Chat, Message and Hangout with Friends by Location", "genreIds": ["6005", "6002"], "trackName": "Connect - Social Map & Address Book | Chat, Message and Hangout with Friends by Location", "releaseNotes": "- Updating location services permissions request\n- Adding global system markers", "sellerUrl": "http://connect.com", "screenshotUrls": ["http://a1.mzstatic.com/us/r30/Purple/v4/e1/fd/ab/e1fdab33-94f5-132d-604d-bc7891c31573/screen1136x1136.jpeg", "http://a2.mzstatic.com/us/r30/Purple4/v4/93/4c/d2/934cd2d2-3842-3beb-330f-22b0c0e5f134/screen1136x1136.jpeg", "http://a1.mzstatic.com/us/r30/Purple6/v4/0c/39/b0/0c39b07a-1656-0527-e407-721e0783d8a1/screen1136x1136.jpeg", "http://a2.mzstatic.com/us/r30/Purple6/v4/8f/8f/97/8f8f97e8-7e86-2733-21c3-e6f8782f7a52/screen1136x1136.jpeg", "http://a5.mzstatic.com/us/r30/Purple2/v4/8d/db/6c/8ddb6c4d-5622-2d0d-52f1-792e4c7d07fa/screen1136x1136.jpeg"], "userRatingCount": 1042, "trackContentRating": "4+", "formattedPrice": "Free", "artistViewUrl": "https://itunes.apple.com/us/artist/connect-software-corp/id780179337?uo=4", "kind": "software", "averageUserRatingForCurrentVersion": 4.5, "sellerName": "Connect Software Corporation", "supportedDevices": ["iPodTouchFifthGen", "iPhone5c", "iPad23G", "iPadMini", "iPadFourthGen", "iPadMini4G", "iPad2Wifi", "iPhone4S", "iPhone4", "iPhone5", "iPhone5s", "iPadThirdGen", "iPadFourthGen4G", "iPadThirdGen4G", "iPodTouchourthGen", "iPhone-3GS"], "artworkUrl100": "http://a1202.phobos.apple.com/us/r30/Purple3/v4/c7/8c/e4/c78ce4a6-ba50-7ab6-c6e8-ede15f891fc1/mzl.njtmduac.png", "bundleId": "com.connect.connectcom", "trackViewUrl": "https://itunes.apple.com/us/app/connect-social-map-address/id688695759?mt=8&uo=4", "minimumOsVersion": "6.0", "artworkUrl60": "http://a1760.phobos.apple.com/us/r30/Purple3/v4/82/90/62/82906245-d002-3942-9023-305cf948f074/Icon-57.png", "averageUserRating": 4.5}