{"contentAdvisoryRating": "4+", "features": ["iosUniversal"], "languageCodesISO2A": ["EU", "CA", "EN", "FR", "GL", "PT", "ES"], "ipadScreenshotUrls": ["http://a3.mzstatic.com/us/r30/Purple3/v4/73/c5/ed/73c5edcf-e898-3e55-d695-2d753c7e5b24/screen480x480.jpeg", "http://a1.mzstatic.com/us/r30/Purple3/v4/17/4c/bf/174cbf95-b266-4cbe-cd77-c94c9d1f19a1/screen480x480.jpeg", "http://a1.mzstatic.com/us/r30/Purple3/v4/1e/2c/c1/1e2cc1f1-eea7-1405-134f-f0b2fdca2497/screen480x480.jpeg", "http://a1.mzstatic.com/us/r30/Purple3/v4/8f/21/bb/8f21bb93-1771-801e-003f-8eba47d9dbaa/screen480x480.jpeg"], "releaseDate": "2014-09-13T11:42:24Z", "currency": "USD", "artistId": 692753618, "wrapperType": "software", "advisories": [], "genres": ["Lifestyle", "Utilities"], "trackId": 692753615, "description": "Make money selling your old stuff and buy great new things at bargain prices. \n\nWallapop is a free virtual flea market for iPhone & iPad that allows you to buy & sell second hand products. WALLA! \n\nMAKE MONEY FROM YOUR OLD STUFF Sell anything you want! Just take a picture and post it on Wallapop – and voilá! It’s now available to buyers in your local area. \n\nBUY GREAT NEW THINGS Everything for sale on Wallapop is displayed according to how fast you can get to it! Contact directly with the seller, and even meet him or her to see the item before you buy it. \n\nMore than three million people have joined Wallapop… WALLA! \n\nFEATURES OF THE APP \n• Wallapop lets you make money, while saving money on cool stuff. Pretty nifty. \n• Delivery charges, waiting time, untruthful product descriptions, the hassle of returns… Forget about all this. A meeting is all it takes to buy and sell whatever you want. \n• The app includes many collections and categories, including cars, electronics, fashion and accessories, babies and children, sport and leisure, video games, films, house and home… You’ll find everything you are looking for. \n• Wallapop helps you recycle, and even upcycle if that’s what floats your boat. It’s a sustainable way to shop, giving old things a second chance and a brand new owner. Ahem… Did we mention there are no delivery vans or industrial transport? \n\n*** Your exact address will always stay confidential. Your current location is only displayed within a 1km radius and will never be used for commercial use. \n\nDownload Wallapop now and join the trending local flea market… WALLA!\n\nWallapop is supported by iPhone, iPad, iPad Mini, iPod Touch and is optimized for iPhone 5 and higher. \n\nDo you have any question, problem or comment about the app? Write us at info@wallapop.com", "artistName": "SECONDHANDING NETWORKS SL", "artworkUrl512": "http://a1686.phobos.apple.com/us/r30/Purple3/v4/3d/2c/e2/3d2ce28f-3444-2d4c-e213-dfb65e48f22e/mzl.qoppdwyu.png", "version": "1.7.3", "primaryGenreId": 6012, "primaryGenreName": "Lifestyle", "fileSizeBytes": "18888467", "price": 0.0, "isGameCenterEnabled": false, "trackCensoredName": "Wallapop - Your second hand flea market", "genreIds": ["6012", "6002"], "trackName": "Wallapop - Your second hand flea market", "releaseNotes": "Finally! It’s here! The app has been adapted for the screens of iPhone 6, 6 plus, Full HD, IMAX, rear-view mirrors, baby prams and tamagotchis! We know that we should have launched it before, but our favourite unicorn has caused some unexpected problems and we had to provide him some reassurance and support.\n\nThe good news keep coming! We have fixed a bug, yep, the one who didn’t allow us to enter the app through Facebook in some cases. As a punishment, we tied our developer to a table leg, thinking he was going to go crazy, but he didn't, so we have to think about something else.\n\nOn the other hand, we have added again the image of the product on the list of conversations ( yep, we read your 437 emails and your 302 reviews that you sent us) and you can also edit the currency. Also we have fixed more bugs such as the deleting of conversations/notifications, the screen to report users, the text scrolls….\n\nAfter doing the same error, again and again, we did it! The camera of the iPad … IS WORKING! We have given a bag of M&M’s to the culprit, and when he was happy and almost enjoying it, we have taken it away from him. Sometimes we have to take hard decisions.\n\nLast but not least, the entrails of the app have been improved. It’s something that you can’t see, but you can feel. And believe us, you want it to work.\n\nThanks a lot for all your suggestions. We are working really hard to make from Wallapop a better app everyday. Enjoy!", "screenshotUrls": ["http://a2.mzstatic.com/us/r30/Purple3/v4/b9/68/f3/b968f3d9-6382-fafb-d330-515dc6e01bb6/screen1136x1136.jpeg", "http://a5.mzstatic.com/us/r30/Purple3/v4/cf/42/53/cf425306-c4e8-f8dd-4d1c-433cc839599d/screen1136x1136.jpeg", "http://a5.mzstatic.com/us/r30/Purple3/v4/e2/a4/78/e2a478fc-89d2-66ce-c4ea-1a3c12f41e5a/screen1136x1136.jpeg", "http://a4.mzstatic.com/us/r30/Purple5/v4/c7/50/e3/c750e37a-6486-125b-5ac5-3576b1885a15/screen1136x1136.jpeg", "http://a2.mzstatic.com/us/r30/Purple1/v4/39/50/73/3950736b-b130-c59c-c43b-754da8f21f58/screen1136x1136.jpeg"], "userRatingCount": 7, "trackContentRating": "4+", "formattedPrice": "Free", "artistViewUrl": "https://itunes.apple.com/us/artist/secondhanding-networks-sl/id692753618?uo=4", "kind": "software", "sellerName": "SECONDHANDING NETWORKS SL", "supportedDevices": ["iPadFourthGen4G", "iPhone5", "iPhone5c", "iPhone4", "iPadThirdGen4G", "iPadThirdGen", "iPodTouchFifthGen", "iPhone5s", "iPhone4S", "iPadFourthGen", "iPadMini", "iPad23G", "iPad2Wifi", "iPadMini4G"], "artworkUrl100": "http://a1686.phobos.apple.com/us/r30/Purple3/v4/3d/2c/e2/3d2ce28f-3444-2d4c-e213-dfb65e48f22e/mzl.qoppdwyu.png", "bundleId": "com.secondhanding.WallaPop", "trackViewUrl": "https://itunes.apple.com/us/app/wallapop-your-second-hand/id692753615?mt=8&uo=4", "minimumOsVersion": "7.0", "artworkUrl60": "http://a762.phobos.apple.com/us/r30/Purple1/v4/bd/ef/7a/bdef7a08-783e-e34c-9916-6265523f603f/AppIcon-AppStore60x60_U00402x.png", "averageUserRating": 5.0}