{"contentAdvisoryRating": "9+", "features": ["gameCenter", "iosUniversal"], "languageCodesISO2A": ["EN", "FR", "DE", "IT", "JA", "KO", "PT", "RU", "ZH", "ES", "ZH"], "ipadScreenshotUrls": ["http://a1.mzstatic.com/us/r30/Purple4/v4/56/29/34/562934d3-415d-7edc-ae87-ae712db0ba32/screen480x480.jpeg", "http://a3.mzstatic.com/us/r30/Purple5/v4/64/0b/16/640b1699-4fd2-fbec-fb97-00ba66ab6b90/screen480x480.jpeg", "http://a4.mzstatic.com/us/r30/Purple3/v4/fc/3b/cb/fc3bcb6f-fa83-15bb-d041-2ecbcf98c8ab/screen480x480.jpeg", "http://a1.mzstatic.com/us/r30/Purple4/v4/1a/33/d0/1a33d01b-c53b-49a4-7f50-ef3c6032957a/screen480x480.jpeg", "http://a4.mzstatic.com/us/r30/Purple3/v4/c1/27/76/c1277612-d122-5167-1d39-acc79a6ef9ff/screen480x480.jpeg"], "releaseDate": "2014-08-21T05:19:37Z", "currency": "USD", "artistId": 284888248, "userRatingCountForCurrentVersion": 4035, "wrapperType": "software", "advisories": ["Infrequent/Mild Cartoon or Fantasy Violence"], "genres": ["Games", "Entertainment", "Action", "Strategy"], "trackId": 847985808, "description": "Charge into battle on distant planets, and lead your troops to victory in this action-packed, combat strategy game! Build a base, recruit an unstoppable force, and challenge players across the Star Wars universe in Star Wars™: Commander! \n\nDuring a time of Galactic Civil War, competing forces need allies for their cause. The Rebellion rallies for justice and freedom, while the Empire seeks control of the galaxy. Where does your allegiance lie? Will you side with the Empire’s strength and relentlessness, or the Rebellion’s heroism and resourcefulness? The choice is yours! \n\nRise through the ranks as a powerful battlefield commander in this exciting game of strategy and competitive galactic combat! \n\nFeatures: \n• Choose your side: Will you command AT-ATs and TIE Fighters as the Empire? Or call on iconic heroes like Han Solo and Princess Leia as the Rebellion?\n• Build and defend your base: Train unique troops specific to each faction, and fortify your base with deflector shields, turrets, heavy artillery, and other defenses! \n• Lead epic battles: Strategically deploy powerful armies, units, and vehicles against enemies and players around the galaxy!\n• Form the ultimate Squad: Build strong alliances with friends and other players!\n• Travel to multiple planets and complete special missions: Play an all-new story as a valiant leader on the front lines of the Galactic Civil War.\n• Upgrade your strike team and its defenses: Strengthen your forces with multiple levels of upgrades for each unit!\n• Download now and play in your choice of English, Chinese, French, German, Italian, Japanese, Korean, Portuguese, and Spanish!\n\nInvade enemy territory and establish an impenetrable base as you join the battle for dominance! \n\nFor the best experience, we recommend playing this game on an iPhone 4S, iPhone 5/5s/5c, and iPads running iOS7 and above.  Playing on an iPhone 4 may result in longer load times and slower performance.\n\nBefore you download this experience, please consider that this app contains social media links to connect with others, in-app purchases that cost real money, push notifications to let you know when we have exciting updates like new content, as well as advertising for The Walt Disney Family of Companies and some third parties. We respect your wishes regarding your Privacy. You can exercise control and choice by resetting your Advertising Identifier in your device’s Privacy Settings.\n\nPrivacy Policy - http://disneyprivacycenter.com\nTerms of Use - http://disneytermsofuse.com", "artistName": "Disney", "artworkUrl512": "http://a1402.phobos.apple.com/us/r30/Purple3/v4/e4/22/c3/e422c3ad-2b86-8b27-6cf6-b2d32dd10803/mzl.nndektqn.png", "version": "2.2.5", "primaryGenreId": 6014, "primaryGenreName": "Games", "fileSizeBytes": "60199160", "price": 0.0, "isGameCenterEnabled": true, "trackCensoredName": "Star Wars: Commander", "genreIds": ["6014", "6016", "7001", "7017"], "trackName": "Star Wars: Commander", "releaseNotes": "New content and improved performance now available in the latest update!\nCheck out these new features:\n• Chapter 10 now available! Entice Senator Johhar Kessen to join your faction!\n• Beware of Death Troopers! Dandoran will get a little spooky in Campaign #3: The Sickness—coming soon for Halloween!\n• Prove you’re worthy of your faction in the upcoming Tournament. This PvP feature will be available soon!\n• New Empire Units: Slice your way through infantry with the Royal Guard hero and deal massive damage to turrets with the TIE Defender!\n• New Rebel Units: Repair battered vehicles with the helpful R2-D2 hero unit and take out turrets easily with B-wing strikes!\n\nNew for iOS 8 Users—Get updates in the Today panel in Notification Center when troops are finished training and resources are ready for collection! Follow these steps to turn on the widget:\n• Unlock your phone and pull down the Notification Center.\n• Tap the “Edit” button at the bottom of the screen.\n• Select Star Wars: Commander to get updates and launch the game directly from the Today panel.\n\nImprovements and Fixes:\n• Updates to PVP matchmaking that take HQ levels into account \n• Improvements to the Squad Troops Donation feature. \n• Healer Class units no longer change targets.\n• Fixed issues with progress saving, Facebook login, and notifications. \n• Fixed 1150 error on Chapter 10, Mission 9 after killing the Rancor\n• Fixed AI targeting issues where units would not lock onto the closest available target\n• Fixed newspaper appearing too frequently", "sellerUrl": "http://bit.ly/1p9NAQs", "screenshotUrls": ["http://a1.mzstatic.com/us/r30/Purple4/v4/d4/42/c4/d442c4a2-f3cb-57ef-9577-d04915ae06b1/screen1136x1136.jpeg", "http://a1.mzstatic.com/us/r30/Purple5/v4/b2/77/27/b27727bb-4d4e-e2c3-891c-70dba693a715/screen320x320.jpeg", "http://a5.mzstatic.com/us/r30/Purple3/v4/8c/41/d5/8c41d505-3f3d-2260-7d72-4df58e6d8a03/screen320x320.jpeg", "http://a1.mzstatic.com/us/r30/Purple4/v4/c4/26/d2/c426d2f4-28ff-8132-cad3-b1eef4ebe901/screen320x320.jpeg", "http://a3.mzstatic.com/us/r30/Purple3/v4/a5/cd/3f/a5cd3fd0-f9a7-1da1-fc8f-01ff8542f33f/screen320x320.jpeg"], "userRatingCount": 206478, "trackContentRating": "9+", "formattedPrice": "Free", "artistViewUrl": "https://itunes.apple.com/us/artist/disney/id284888248?mt=8&uo=4", "kind": "software", "averageUserRatingForCurrentVersion": 4.0, "sellerName": "Walt Disney", "supportedDevices": ["iPhone5s", "iPodTouchFifthGen", "iPhone5", "iPadFourthGen4G", "iPadFourthGen", "iPhone4S", "iPhone5c", "iPhone4", "iPadThirdGen", "iPad2Wifi", "iPodTouchourthGen", "iPadMini", "iPadThirdGen4G", "iPad23G", "iPhone-3GS", "iPadMini4G"], "artworkUrl100": "http://a1402.phobos.apple.com/us/r30/Purple3/v4/e4/22/c3/e422c3ad-2b86-8b27-6cf6-b2d32dd10803/mzl.nndektqn.png", "bundleId": "com.lucasarts.starts", "trackViewUrl": "https://itunes.apple.com/us/app/star-wars-commander/id847985808?mt=8&uo=4", "minimumOsVersion": "6.0", "artworkUrl60": "http://a1012.phobos.apple.com/us/r30/Purple5/v4/7f/94/ac/7f94aca9-f1fb-34d0-1f33-9ca0b5acfd16/AppIcon57x57.png", "averageUserRating": 4.5}