{"contentAdvisoryRating": "4+", "features": ["iosUniversal"], "languageCodesISO2A": ["EN"], "ipadScreenshotUrls": ["http://a3.mzstatic.com/us/r30/Purple5/v4/f7/d4/87/f7d4872a-31f6-ef83-5b2a-8a12e4d8fbdf/screen480x480.jpeg", "http://a4.mzstatic.com/us/r30/Purple1/v4/64/58/2f/64582f62-5d01-c85c-0fe9-a8297779ad58/screen480x480.jpeg"], "releaseDate": "2014-08-06T16:26:18Z", "currency": "USD", "artistId": 904250603, "advisories": [], "genres": ["Business"], "trackId": 904250600, "description": "Want to increase your selling success and profitability? Take advantage of advanced sales trainer Jim Pancero's latest app to provide you all of the best sales and sales leadership ideas and techniques that can most increase your sales.\n\nFOR EXPERIENCED SALES PROFESSIONALS - You can immediately access over 100 free videos, audio recordings and blog articles all aimed at increasing your sales and sales leadership skills. You also have access to a free advanced online Sales Evaluation test you can take to provide insight and direction to your selling career. \n\nFOR SALES MANAGERS – This free app can be the center of your sales team coaching and training efforts. Assign one of my free videos for your sales team to watch in advance of a sales team meeting (or just show it at your sales meeting – they are all less than 10 minutes in length). Then all you have to do is ask your sales team four questions…#1 – \"What did you think of the video?\" - #2 - \"How relevant are those ideas to us and our unique business?\" - #3 – What do you plan to do or try different this week based on the ideas we discussed – And then #4, during the week as you see or talk with sales reps ask \"So what success have you had so far with the new ideas you promised to try?\" Now you have a comprehensive sales training process for even your most experienced sales pros by just downloading and utilizing this free app loaded with free videos, audio interviews and blog articles…all aimed at helping you and your team increase their selling success, profitability and competitive advantage. \n\nAdditional functions contained in this free app include subscribing to my free e-mail newsletter, asking a question…or even submitting a topic you would like to see recorded for Jim's next free video posting. \n\nWANT TO BRING JIM IN TO PERSONALLY TRAIN YOUR SALES TEAM? You can access Jim's travel schedule to see if he's coming to your city, can submit a booking request to Jim as well as have access to all the information you will need to make your program with Jim a success. \n\nWANT TO TALK DIRECTLY WITH JIM ABOUT YOUR CURRENT SALES CHALLENGES AND OPPORTUNITIES? You can also contact Jim and his team directly at 800-526-0074 or by e-mailing jim@pancero.com. You can also check out our website at www.pancero.com \n\nABOUT JIM PANCERO – Jim Pancero has been a sales and sales management speaker, trainer and consultant for over 33 years having successfully conducted over 3,000 presentations or consulting sessions for 800 organizations in over 80 different industries. Jim has a very specific niche in the market...he only works with experienced “business to business” sales professionals who already know how to sell, the managers who lead them and their executives who direct them. Jim guarantees in writing and consistently proves to his clients that he has the most advanced sales and sales management training available today. Download our app today so you can see how and why he can make such strong guarantees…and can prove them! \n\nJim's honors and recognition include being inducted into the National Speakers Association's Speaker Hall of Fame (there are currently only 100 members of the Hall of Fame still alive, He has also earned the \"Certified Speaking Professional\" designation. There are only 75 of the over 3,000 member association who have been awarded/earned both of these honors. \n\nHope you download our free app…and hope we get to talk together real soon. \n\nNo matter what your seniority, experience level or past selling success…Jim can impact your selling and sales leadership success. After all…we know you're good…now the only questions is are you good enough to get better?", "artistName": "Jim Pancero", "artworkUrl512": "http://a900.phobos.apple.com/us/r30/Purple3/v4/f5/6f/ed/f56fed1e-c23f-f95b-a316-a3744f65cc05/pr_source.jpg?downloadKey=1417126322_4e420dc5f1ddb4bab845b2d0b88b8136", "version": "1.89.173.364", "primaryGenreId": 6000, "primaryGenreName": "Business", "fileSizeBytes": "27332304", "price": 0.0, "isGameCenterEnabled": false, "trackCensoredName": "Jim Pancero", "genreIds": ["6000"], "trackName": "Jim Pancero", "releaseNotes": "No changes. This is only to update the app to the new iOS 8.", "screenshotUrls": ["http://a4.mzstatic.com/us/r30/Purple5/v4/60/d3/5b/60d35bc3-703f-209c-806e-db305f57a6dc/screen1136x1136.jpeg", "http://a2.mzstatic.com/us/r30/Purple3/v4/9a/2c/6e/9a2c6ed4-5dcd-650a-7a4e-333eea4e9bba/screen1136x1136.jpeg"], "trackContentRating": "4+", "formattedPrice": "Free", "artistViewUrl": "https://itunes.apple.com/us/artist/jim-pancero/id904250603?uo=4", "kind": "software", "sellerName": "Jim Pancero", "supportedDevices": ["iPad2Wifi", "iPadFourthGen4G", "iPhone5c", "iPadThirdGen", "iPodTouchFifthGen", "iPadFourthGen", "iPhone5", "iPadThirdGen4G", "iPhone4", "iPad23G", "iPhone4S", "iPadMini", "iPhone5s", "iPadMini4G"], "artworkUrl100": "http://a900.phobos.apple.com/us/r30/Purple3/v4/f5/6f/ed/f56fed1e-c23f-f95b-a316-a3744f65cc05/pr_source.jpg?downloadKey=1417126322_4e420dc5f1ddb4bab845b2d0b88b8136", "bundleId": "mobapp.at.jimpanceroappb18899334c67f71a", "trackViewUrl": "https://itunes.apple.com/us/app/jim-pancero/id904250600?mt=8&uo=4", "minimumOsVersion": "7.0", "artworkUrl60": "http://a1654.phobos.apple.com/us/r30/Purple3/v4/cf/92/8a/cf928a50-3b13-eede-5c92-2e4b76febaff/AppIcon60x60_U00402x.png", "wrapperType": "software"}